{"1":{"topic":"david","tweets":["News Update: Marco Rubio Showcases Support for David Jolly Against Alex Sink: Marco Rubio, R-Fla., t... http://t.co/zSwwZTPwLh #alexsink","RT @MUFC_today: On the back of Crossgate at Manchester United a new David Moyes inspired PlayStation controller \n\n#ManUtd #mufc\n\nhttp://t.c…","RT @natholver: I dunno whose worse David and Corinne or Chloe and Kelly! #MKR","RT @FionaOLoughlin_: David is \u0027that guy\u0027, either the brother-in-law, the bloke in the office, or the husband of a friend, that NOBODY CAN S…","RT @GWS_Giants: GIANTSTV had the cameras rolling when CEO David Matthews made the captaincy announcement today. VIDEO: http://t.co/7Gpkx5Un…","RT @alkidavid: Alki David talks about the Zimmerman Fight on TMZ LIVE http://t.co/vzYeK7J9IB","RT @AnyoneButUtd: David Moyes offered a role bobsleigh coaching at Sochi. \n\nTeam GB impressed with his ability to get his team to go downhi…","RT @DavidRoads_: Be true to your work, your word, and your friend. -Henry David Thoreau","David is the #smilingassassin for sure! #mkr","@pewpewmcgoo @TheKooriWoman i’m just checking out the evilness of Evil David. With one eye.","RT @Fanoza2: Lmfao RT @siphoblose1: Hahahahaha *laughs like David kau* RT \"Fanoza2: Maritzburg Utd should stop Chiefs from breaking Sundown…","Wow David is an asshole","RT @ManUtd: David Moyes\u0027 pre-match press conference will take place this afternoon at the Aon Training Complex. We\u0027ll have updates here fro…","@Angus_OL @Luke5SOS @Calum5SOS please follow me omg","That guy David is such a #douche #mkr","David Beckham seeks PSG to fund his MLS project http://t.co/jhJZuNoyIO","RT @ManUtd: David Moyes\u0027 pre-match press conference will take place this afternoon at the Aon Training Complex. We\u0027ll have updates here fro…","For soldiers wanting to leave the British army: new step-by-step guide. Pls RT http://t.co/ju8S8nAY7g @CombatStress @PoppyLegion @SSAFA","@SkyNews @BBCNews @David_Cameron Main thing 1-we send troops to be killed to protect scummy asian countrys2-we give india\u0026pakistan millions","RT @DaystarNG: Dr. David Oyedepo said “there are no 3rd world countries, you only have 3rd world minds”. #FinancialUpgrade","RT @ScarlettFlame2: My interview with the gorgeous David Geftakys Musician #ASMSG  http://t.co/iKmAUuh7XD sIAC","wOw David needs to calm his tits #mkr","Need a Mortgage or Insurance advice? Contact @TFS_David H on 01482 476360","RT @DavidRoads_: Be true to your work, your word, and your friend. -Henry David Thoreau","RT @Angus_OL: On-Air NOW!\n\nStream: http://t.co/rcXR3qc1Se\n\n@Luke5SOS and @Calum5SOS taking a fan call #Bump5SOSFanCall","Why is David Cameron travelling around all the flooded areas? Who the fucks he think he is? He better be Noah and he better have that ark","Wayne Findlay repost please http://t.co/ahhPBbn0YB","@BenBarba03 I really hate David, its like mate you werent any better","[International] 507bhp V8 for new British sportscar http://t.co/ZoKEM1qOQx","RT @SoulYodeler: I don\u0027t eat fresh at all because none of you ding-dongs see fit to give me a heads up on the joke format rollouts.","What\u0027s wrong with the librarians today lol 😏 @laurenmaecox @hen_charter @orourke_david @CharlieHeyworth @Brenan137","Fingers crossed for dessert boys. David \u0026 Corinne can suck it #mkr","@csbarielle1976 Flooding in South West \"isn\u0027t that bad\", isn\u0027t important as Surrey Feel free to hate David Buick *Surrey is Home Counties!*","@TonyBridger1 @meurig73 @saladmunchers responsible for David Moyes\u0027 appointment?hahaha","Shooting Star (feat. LMFAO, Pitbull \u0026 Kevin Rudolf) [Party Rock Mix] by David Rush — https://t.co/LGhx3hzhf0","I added a video to a @YouTube playlist http://t.co/LFK1iYKz5B How Do I Get More Views On YouTube - A Review","♬ David Borden - Fog, Stars, Train, West Hill Lights, Etc. ♬ http://t.co/eKMQ0yP3Va #nowplaying","Insight to floods RT @headfirst_dom: @luliemma http://t.co/WPAjkuFicR and this more so http://t.co/d9tHcKYs4h","Christopher Eccleston and David Tennant, you both are Dalektable","@BrookeMarsham @michellemarsham and that\u0027s so good! Love Cody! Have you met him too?","Can\u0027t be fucked with school","RT @DS_books: For those that like to know a little more about their writers her is a link to my biog http://t.co/ZP5rRV4jdp …  #PDA #bookpl…","RT @yashough: If Tuesday was a person it would be David Cameron wearing nothing but spandex and crocs. No one wants to see that.","RT @suthodan: David Kotch is a legend of the highest order for saying what we\u0027re all thinking re Schapelle","RT @ITS_Training: @suffolkchamber trade group chairman David Redhead welcomes improved balance of trade data \n\n#Internationaltrade\nhttp://t…","Don\u0027t remember who recommended Neuromancer by David Gibson for @TwitBookClub this month, but thank you!  #BooksDXB","Mediterranean Diet vs. Cholesterol Pills: We Have a Winner  http://t.co/RSHX2SbOpb via @HuffingtonPost ","RT @ChiaraRochford: \"It makes no sense to elevate economics above the biosphere.\" David Suzuki http://t.co/Vp6osDI14P","RT @tamdeanburn: “@PhilipJEMiller: David MacLennan: Face to Face. In @TheHeraldPaper today by Brian Beacom. http://t.co/mYY85H3kRv” O what …","RT @FemaIeStruggle: David beckham \u0026 his daughter are so cute ☺️💕 http://t.co/sOc1V52l6F","Might just go home","RT @ed_diggins: wow.....this could be writen by a million United fans today..\nhttp://t.co/zvpBc7l8sZ\nabsolutely depressing that weve been s…","RT @GrogsGamut: Burnt hands, children overboard, it all seems the same to Peter Reith | David Marr http://t.co/yqKDi6Xzwl via @GuardianAus","RT @marcuschown: Retweet if you think the NHS would be safer run by this knitted uterus playing the piano than David Cameron http://t.co/lS…","RT @lolavonj: @trailnutter Good morning David, yes I am and happy to stay inside today. Doing my sessions","David West, Pacers cruise past short-handed Nuggets - ESPN http://t.co/cQYrgNQoSc #NBA #IndianaPacers","@davidkhangura that was when I was sparing a thought David","David West, Indiana Pacers Throttle Denver Nuggets - Rant Sports http://t.co/oATHfR7wtB #NBA #IndianaPacers","Is there any hope for us that a freak wave in Dawlish will suck that tool @David_Cameron out to sea never to be seen or heard from again?","RT @e_ManchesterUtd: So the results of yesterday\u0027s poll. Can David Moyes turn things around? You voted as follows\n\nYES - 11 votes\nNO - 13 v…","RT @DavidRoads_: Be true to your work, your word, and your friend. -Henry David Thoreau","@matthewcpinsent you didn\u0027t get this enthusiasm with David Coleman as a commentator!! Lol","@FionaOLoughlin_ You\u0027re tolerant :P did David get to you??","@BrookeMarsham @michellemarsham omg same been trying for 4 years now 😟 one day! x at least you met him haha YOURE one step ahead of me 😉","David Shrigley\u0027s Really Good Trafalgar Square commission gets a thumbs-up from us: http://t.co/0q4DDam8El","RT @DrTeddyDeLove: The David Moyes PS4 controller. http://t.co/3dGlNoM9BK","David literally has a dick shaped head #MKR","@IanJamesPoulter Wish I had one like that for my local coarse.......we have 3 club hills+very strong winds,and side slopes#nightmare :-/ x.","#mkr tnite is a complete shambles..the boys didn\u0027t do well but they owned it. David on the other hand is a pathetic human being #disgusted","David Cameron, in orange protective gear,has been on the rail tracks at #Dawlish to see for himself the severed link. http://t.co/RnTET1Pqtj","RT @DaystarNG: Dr. David Oyedepo said “there are no 3rd world countries, you only have 3rd world minds”. #FinancialUpgrade","RT @NewtonEmerson: Eamonn O\u0027Cuiv digs the hole deeper. A despicable buffoon. http://t.co/BbslvMvAuD","I added a video to a @YouTube playlist http://t.co/pZ4gK8rRE8 How To Get More Views And Subscribers Without Any Videos","RT @DavidRoads_: Be true to your work, your word, and your friend. -Henry David Thoreau","RT @ManUtd: David Moyes\u0027 pre-match press conference will take place this afternoon at the Aon Training Complex. We\u0027ll have updates here fro…","If ur a CM at united u shoud be able to tackle,pass an score. Not just fuckin pass everything like ur David beckham FFS!! Fuckin scapegoat🙈","Wilfried Zaha denies using Instagram to criticise David Moyes #MUFC http://t.co/5L1Pxec47E","RT @ChiaraRochford: \"It makes no sense to elevate economics above the biosphere.\" David Suzuki http://t.co/Vp6osDI14P","RT @DrTeddyDeLove: The David Moyes PS4 controller. http://t.co/3dGlNoM9BK","Have you heard ‘David Cook - Always Be My Baby (Cover by Andaka and Raymond)’ by @anddaka on #SoundCloud? https://t.co/n2sMiMO3up","RT @WTFFootballFact: David Moyes has named a\ndifferent starting XI for every\nsingle one of his 38 games in\ncharge of Manchester United so f…","RT @Football__Tweet: PHOTO: Wilfried Zaha looks like an absolute tit after posting this sly dig at David Moyes on Instagram.. \u003e\u003e http://t.c…","AAV: David Cameron\u0027s contempt for free speech http://t.co/BLM1l8XngN PLEASE RT","More CO2 emissions (£5 off flights)? Exacerbating the cause if trying to address the effects of flooding\nhttp://t.co/8GgXjIx78I","@steph_westbrook happy birthday 👍","RT @DavidRoads_: Be true to your work, your word, and your friend. -Henry David Thoreau","\"We are always paid for our suspicion by finding what we suspect.\" - Henry David Thoreau","@TearsnRain @David_Cameron Vision of 100.000.000 people all living in Boats Picturesque Delightful, running sewerage floating maternity beds","RT @ferwen: Village and Field Abandonment in Post-Conquest Tlaxcala A Geoarchaeological Perspective http://t.co/DJCusx8jiM via @David_Bress…","just finished a Runtastic run of 10.09 km in 46m 56s with #Runtastic PRO Windows Phone app: https://t.co/9nkkBljaT4","RT @ManUtd: David Moyes\u0027 pre-match press conference will take place this afternoon at the Aon Training Complex. We\u0027ll have updates here fro…","@mkr David is just nasty...","@FlannaganTW thanks David, appreciate that.","I added a video to a @YouTube playlist http://t.co/x71eUetdGt How To Get More Views On Your Channel And Videos","RT @preciouspress: “@janecat60: Peter Reith brings up the children overboard affair to prove ABC bias!! http://t.co/wC5XloOGEx\nBy David Mar…","What Can Football Managers Like David Moyes Teach Us About Getting Through A Tough Time At Work? http://t.co/mxsAXBAYoQ","@david3012 Hi David, can you DM me your account details so I can have a look at your bill? ^Carmel","@DaveRegion12 Hi Dave we thave Cllr David Burbage on as I type!","RT @_smileysam: David, to put it blunt - your food was shit mate #MKR2014 #mkr","Eamonn O\u0027Cuiv digs the hole deeper. A despicable buffoon. http://t.co/BbslvMvAuD","RT @Col_Kz: Tax avoidance soars to £35billion under David Cameron despite coalition promise of crackdown #benefitsstreet  http://t.co/KODZz…","RT @markohalloran: John Waters, David Quinn, Breda O\u0027Brien, John Murray, Patricia Casey and Maria Steen still have our money you know.","A Trainspotters Guide To Other Earths on Barns \u0026 Noble. \u0026 may other outlets http://t.co/8jzJPLcYkh … … … #bookplugs #1000worlds #PDA","RT @laura_travis: David is the creepiest man ever. Eww #mkr","@Dawid_Nyno thanks David","Had enough of this David bloke, absolute wanker #MKR","Video: Manchester United boss David Moyes is Flappy Bird: Infamously difficult iPhone game Flappy Bird was rem... http://t.co/9FMND9dBoW","Businessman who smuggled £1m worth of liquid cocaine into Scotland is jailed for four years: DAVID Thompson, 5... http://t.co/iIyqr0ypxy","@David_Cameron why don\u0027t u go down to Somerset where the people really need u","#Football Video: Manchester United boss David Moyes is Flappy Bird: Infamously difficult iPhone game Flappy Bi... http://t.co/dHiO6y4HNc","RT @stevemorris38: If David from #MKR isn\u0027t Australia\u0027s biggest flog he\u0027s in the grand final","@adsbringcust is this position still active David? http://t.co/twqzYI3s70","@LordManley @David_Cameron could be, he\u0027s currently surveying your community.","RT @bbecmac: someone hit david in the throat for me #mkr","When it\u0027s raining, the walk down to the bus station feels like an eternity. Absolutely sodden. But David Bowie is making it bearable.","I added a video to a @YouTube playlist http://t.co/RgkLZGHSPJ Get On First Page Of Google With Video Ranking","RT @DavidRoads_: Be true to your work, your word, and your friend. -Henry David Thoreau","Lmfao RT @siphoblose1: Hahahahaha *laughs like David kau* RT \"Fanoza2: Maritzburg Utd should stop Chiefs from breaking Sundowns record\"","RT @elishaflrn: Demi Lovato: Stay Strong. David Luiz: Stay Happy.","#Football: Infamously difficult iPhone game Flappy Bird was removed from the App Store this week amid suggesti... http://t.co/NIvxM3wumb","David is a smug, arrogant twat, it\u0027s beyond me how he hasn\u0027t been punched in the face #mkr","#Football: Video: Manchester United boss David Moyes is Flappy Bird: Infamously difficult iPhone game Flappy B... http://t.co/az9ENrm8me","Aw C\u0027mon lads bring it home with the desert! \nWhole country wants David and Corinne to nick off! #mkr #teamvic","Video: Manchester United boss David Moyes is Flappy Bird: Infamously difficult iPhone game Flappy Bird was rem... http://t.co/TXsGQb4LDf","IN THE NEWS: UK floods: David Cameron tells ministers to stop the blame game via @guardian http://t.co/dlKdSITj1c","RT @alkidavid: Alki David talks about the Zimmerman Fight on TMZ LIVE http://t.co/vzYeK7J9IB","RT @alkidavid: Alki David talks about the Zimmerman Fight on TMZ LIVE http://t.co/vzYeK7J9IB","RT @ITS_Training: @suffolkchamber trade group chairman David Redhead welcomes improved balance of trade data \n\n#Internationaltrade\nhttp://t…","Crank It Up (feat. Akon) by David Guetta \u0026 Akon — https://t.co/Cot6fVTsVu","#mkr I hope channel 7 give David and his bimbo a trip to bali and a body board bag.","@408_David man your boyfriend he a lame he ain\u0027t with the shitttttttttt .. uhh them biker boyz aha","RT @czarcASStic: “@Greebobek: Steven Moffat: I didn’t make Doctor Who sexy #doctorwho http://t.co/H5O0dt6KZI”nope, David Tennant did‼️","@David_Cameron     At least you are seeing it first hand well done Prime minister","@kristen_45 From the add - looks like tomorrow will be equally as bad! #David #mkr","Wilfried Zaha: I was not caught in bed with David Moyes’ daughter, HONEST! http://t.co/B3yER3fN8s","RT @lizzjones18: David Cameron approved a £97m cut in funding for flood protection, taking it back to £573m in 2011/12 a 17% cut in one yea…","Be true to your work, your word, and your friend. -Henry David Thoreau","Expect fireworks when David and Corinne sits together with Chloe and Kelly! I want both of them booted out. #mkr","RT @ManUtd: David Moyes\u0027 pre-match press conference will take place this afternoon at the Aon Training Complex. We\u0027ll have updates here fro…","RT @David_Tennant: Via @ReadingTeen2 Competition to win How To Train Your Dragon audiobooks 1-8 by @CressidaCowell read by David Tennant ht…","RT @MakeItSoTStaffs: Really informative presentation from David Pierpoint, CEO of our hosts this morning @sustainableCoRE","I added a video to a @YouTube playlist http://t.co/LiF6EpgKml How To Get People To Watch Your YouTube Video","@David_Major Ha, cheeky sod.","RT @madilaurenn: Don\u0027t even want to watch #mkr anymore because David and Corrine make me want to walk into oncoming traffic","Sink/Jolly: \"It\u0027s all the same cesspool.\" http://t.co/7kQHPz8TMD","RT @craftycrusty: @Devon_Hour David Cameron is in Dawlish.. He\u0027s all fenced off and kept away from the locals!","RT @cassam101: Books, Blogs \u0026 Travelogues is out! http://t.co/jhzWAjHRhj Stories via @HCElliston @David_Emanuel","RT @stevemorris38: If David from #MKR isn\u0027t Australia\u0027s biggest flog he\u0027s in the grand final","RT @ManUtd: David Moyes\u0027 pre-match press conference will take place this afternoon at the Aon Training Complex. We\u0027ll have updates here fro…","@CyclopeanView @david_ferguson @MatthewJeynes @FTAdviser @Transact Won\u0027t lose sleep over few basis points? They wont pay them, client\u0027s do!","RT @JackBraydes: David and the Gold Digger got through because Channel Seven paid a convicted drug smuggler money and they have a quota to …","RT @jimmyfallon: My friend once said, \"If you can\u0027t remember a guy\u0027s name, just call him David. Most men are named David.\" #worstadvice","@David_Cameron but the Thames has flooded I\u0027m amazed you can\u0027t leave London","I don\u0027t know what David\u0027s thinking, some expert on cooking or a comedian #please #overhim #mkr","RT @natholver: I dunno whose worse David and Corinne or Chloe and Kelly! #MKR","Care Quality Commission chairman David Prior says a rift between managers and clinicians was jeopardising safety... http://t.co/fzAQsFEWpJ","RT @ManUtd: David Moyes\u0027 pre-match press conference will take place this afternoon at the Aon Training Complex. We\u0027ll have updates here fro…","RT @CommonsHomeAffs: Counter-terrorism: Prof Sir David Omand of @warstudies, former Director of GCHQ, will give evidence at 3.30 pm: http:/…","You got to love me - David August 👌","RT @FionaOLoughlin_: I know it\u0027s a big call but I don\u0027t even think God loves David #mkr","Has Fergie\u0027s show of faith in David Moyes been a blessing or curse for the new Manchester United boss? http://t.co/Ex3UcT4N1T","@deejayfaremi  david moyes is just kill man u players daily","@dowie_jordan99 get to school you skiving cunt","RT @ManUtd: David Moyes\u0027 pre-match press conference will take place this afternoon at the Aon Training Complex. We\u0027ll have updates here fro…","For soldiers wanting to leave the British army: new step-by-step guide. Pls RT http://t.co/ju8S8nAY7g @bsggriffin @joejglenton @bestbyfarr1","RT @WayneAyres @500px: “Houses of Parliament, London”: http://t.co/7FFyUHvplu by David Mar Quinto #photography http://t.co/Y0dgOqHkVP","david beckham be my sugar daddy","Now playing David Guetta f. Sia - She Wolf (Falling To Pieces) on Radio NOVA Chicago","RT @David_Peters_: #mkr David is an expert in bad taste .... I mean - look at Corrine. I rest my case","@AntsRealityBlog @lbc973   Cameron approved a £97m cut in flood protection, – a 17% real terms cut in one year.  http://t.co/7KFb6BPiRF …","I added a video to a @YouTube playlist http://t.co/C8tFdpb2at More Views On YouTube - How Do I Get More YouTube Views","RT @FionaOLoughlin_: I know it\u0027s a big call but I don\u0027t even think God loves David #mkr","RT @DavidRoads_: Be true to your work, your word, and your friend. -Henry David Thoreau","David go home #mkr","RT @FionaOLoughlin_: David is \u0027that guy\u0027, either the brother-in-law, the bloke in the office, or the husband of a friend, that NOBODY CAN S…","Expect a kick in the teeth with that attitude David #mkr","RT @Football__Tweet: PHOTO: Wilfried Zaha looks like an absolute tit after posting this sly dig at David Moyes on Instagram.. \u003e\u003e http://t.c…","RT @DavidRoads_: Be true to your work, your word, and your friend. -Henry David Thoreau","Get the three books in David Ruffle\u0027s #SherlockHolmes Lyme Regis trilogy today! #Paperback \u0026 #ebook available! http://t.co/sJW8hn5Ki4","RT @scottishbktrust: Are you the next David Greig or Anya Reiss? Competition now OPEN for 10 minute plays! More deets @ideastap: http://t.c…","RT @WTFFootballFact: David Moyes has named a\ndifferent starting XI for every\nsingle one of his 38 games in\ncharge of Manchester United so f…","David Amerland\u0027s take on \"Live Streaming Media\" and \"Direct Audience Engagement\" using the... http://t.co/eHBdX8ocMv http://t.co/zobbvbH0mQ","@David_Cameron heard Philip Hammond on #bbcr4 say, \"politicians don\u0027t do \u0027yes or no\u0027 questions.\" Idiotic. At times like these, they should.","@cumbrianclaire I\u0027ll leave it then! Thanks anyway...\n\n😁","The David McColgan Daily is out! http://t.co/LEPilrQKv9 Stories via @BBCSportScot @LindsayScott2","Breaking out of the newsstand: Why Dennis and Future are looking beyond digital editions http://t.co/0wxZQnmBOj","@joeyjonessky @David_Cameron is desperate to be able to say, I was there, I was there, I am doing things.... #clueless","@JamesOlley What does he think of David Moyes?","Attention-seeking ways from David Bullard kodwa 😴 sibadala.","RT @alkidavid: Alki David talks about the Zimmerman Fight on TMZ LIVE http://t.co/vzYeK7J9IB","RT @ChiaraRochford: \"It makes no sense to elevate economics above the biosphere.\" David Suzuki http://t.co/Vp6osDI14P","RT @BBCJazzon3: @musicamorfosi David Helbock Action Figures a Saalfelden, sul programma @BBCJazzon3 @BBCRadio3 http://t.co/MgwDR0bqhC","@RussyBert @BlakeyBaby He stayed in listening to David Guetta Blake","\"@DavidRoads_: Be true to your work, your word, and your friend. -Henry David Thoreau\" ♥  RT ..","RT @GARSIDEK: Lot about Moyes this morning as #mufc love-in turns sour - my thoughts  http://t.co/f7RWWHrkSO","I honestly am sick of David! Your dish wasn\u0027t so brilliant either..\nHarry and Christo, I really do hope they get through! #mkr","RT @alucci: harper beckham picking her nose at NYFW is the best/cutest thing http://t.co/96xcgcyoxm http://t.co/nRrL2DyddL","Check out  Right Time Come by   Casper and the House of David - http://t.co/UEiXRmmsKW","@David_Cameron @Ed_Miliband Both You \u0026 Miliband should put your diferences to side and go together looking at crisis\nFOR GOOD OF THE COUNTRY","What is an Independent Publisher? @GuardianBooks http://t.co/6CqJtsQQdH"],"id":1}}