{"1":{"topic":"somerset","tweets":["RT @WeatherSteff: Given Somerset\u0027s rain, every drainage channel could have been doubled \u0026 large parts would still have flooded http://t.co/…","RT @yourlocalcc: Spare a thought for clubs in Somerset #nomorerain #yourlocalcricketclub","Another user from Somerset using Uptime24/7 for their online website monitoring #Uptime24/7 #onlinewebsitemonitoring","Somerset / Exeter C of C \u0026 AEDCC \u0027Meet The Neighbours\u0027 Business Luncheon, Sandy Park, Exeter 26/2/14.... http://t.co/st1XuRT5g3","RT @waterlevels: Worth repeating @TakeOffMediaUK @heathervenn123 @spencer68 my \u0027stance\u0027 is better flood management in Somerset for people, …","#AskJamesArthur Do you think that dredging rivers would have protected the Somerset levels?","Somerset / Exeter C of C \u0026 AEDCC \u0027Meet The Neighbours\u0027 Business Luncheon, Sandy Park, Exeter 26/2/14. \n\n http://t.co/ViQOyciVz7","RT @UniRdg_News: \"The idea that dredging would have prevented #ukfloods is fanciful\" - Dr Hannah Cloke in @Independent: http://t.co/OIvMujj…","RT @susannahmh: @dredgetherivers Cameron: \"Everything that needs to be done will be done.\" @itn \nhttp://t.co/BBdQLrqrWV  #somersetfloods #f…","Insight to floods RT @headfirst_dom: @luliemma http://t.co/WPAjkuFicR and this more so http://t.co/d9tHcKYs4h","EA\u0027s hare-brained Lord Smith says \"homeowners knew the risks\" about flooding.\nMaybe - but nobody told them this:\nhttp://t.co/ijqV9pq7tr","Thames breaks its banks in London as troops arrive in Somerset http://t.co/jsQIt0O8rW via @MailOnline","RT @BillOddie: Somerset Levels. It\u0027s NOT birds before humans. Management for wildlife would control flooding. Since when did this govt care…","@jordyokeefe please RT https://t.co/avsz8ZlUn7  now in 8th week of flooding! Don\u0027t let people forget about us #dredgetherivers","we are talking about predictable recurring flooding ― robert a. brady | moorland, somerset, uk | foto: justin talls http://t.co/w5x9jnRRDg","Experienced Sales person required to sell our outdoor advertising, full or part time covering Devon \u0026 Somerset.\nBasic plus commission.","RT @Mrplantmad: Does anyone know of a SAFE website to donate money to the Somerset flood victims, worried scamming websites may of popped u…","@dredgetherivers Cameron: \"Everything that needs to be done will be done.\" @itn \nhttp://t.co/BBdQLrqrWV  #somersetfloods #floods #FLAGpress","RT @in_focus: Flooding in Southwest England - 26 photos from the Somerset Levels, submerged for a month - http://t.co/xEjjC7Zy6k http://t.c…","RT @jossgarman: Ministers looking at granting #fracking licenses... on the Somerset levels: http://t.co/Mme21kDhP8 \u003c what could possibly go…","RT @TheBarleyWeasel: Hello Farmers of Norfolk \u0026 Suffolk.\nI\u0027ve been offered 2 artics to take to Somerset. Can anyone donate fodder beet or f…","@David_Cameron why don\u0027t u go down to Somerset where the people really need u","27 Staggering New Pictures Of The Somerset Levels Floods http://t.co/eVqDWcyjov","RT @TISVentures: A star is born in Somerset West. http://t.co/kkFb7YwHVe @lorraineEmery1 @wines_lithos @SeanPaulEmery @ChristianEedes #Cape…","RT @Askrigglad: The Westminster idiots send £27million in aid to China and £290million to India, both have their own space programmes. Hear…","RT @AlistairDriver: \u0027Tractor aid\u0027: Yorkshire farmers to embark on 225-mile tractor run to deliver fodder/raise plight of Somerset farmers h…","@lspraggan please RT https://t.co/avsz8ZlUn7  now in 8th week of flooding! Don\u0027t let people forget about us #dredgetherivers","RT @jwrotherham: SOMERSET FLOODS: Why isn\u0027t Farage owning up to the EU\u0027s role in this disaster? http://t.co/tshXodFqmn via @nbyward","It\u0027s ma birthday so I\u0027m playing this song ...LOUDLY!!! \u003e\u003e\u003e Snow Patrol Post Punk Progression Live At Somerset House: http://t.co/tv1yQkK0KF","North Somerset people, you can report blocked drains/flooding as well as other environmental issues https://t.co/SaXDyhjfia","RT @Legal_Experts: Somerset Business Cabinet set up to demand action over #floods #somersetfloods http://t.co/biFJNupmsB","Dutch specialists bring pumps to Somerset http://t.co/WeY5pEnmYK","@AntsRealityBlog @lbc973   Cameron approved a £97m cut in flood protection, – a 17% real terms cut in one year.  http://t.co/7KFb6BPiRF …","Further extreme weather is expected across the UK. 14 severe flood warnings in Berkshire \u0026 Surrey, 2 in Somerset.  http://t.co/EFPBppxwS1","RT @mk1969: somerset flooded for weeks. now the thames bursts, surrey gets flooded and the media goes crazy. lesson? #nobodyinnewspapersliv…","Seen in orchard! Japanese baby and her cute brother 👶💗 (at 313@Somerset) [vid] — https://t.co/mxyIz9OBfG","@NathanN1986 I’m down in South Somerset my friend. :-)","RT @mariaeaglemp: This is an unimaginably stressful and distressing time for those in Somerset who have seen their homes and bus... http://…","RT @mintageone: @hotpatooties Pls would you consider rt this link to help the flood victims here in Somerset? It\u0027s heartbreaking..https://t…","Pretty soon, the only people who will be interested in buying your house in the Somerset levels from you will be #Fracking companies.\n\nOh...","RT @TauntonsToneFM: Are you #OpenForBusiness? Give us a shout and a wave! :) #Somerset","RT @QuoteLeadership: When things are at their worst I find something always happens........W. Somerset Maugham #fate","RT @BillOddie: Somerset Levels. It\u0027s NOT birds before humans. Management for wildlife would control flooding. Since when did this govt care…","RT @gallagherbren: As soon as the floods reach the the SE its a national disaster and first 7 pages of some dailies. Don\u0027t recall this 4 So…","Wet n windy in #Pocklington this morning but nothing compared to those poor folks in #Somerset :(","RT @rdgresident: politicians in Purley or Somerset pointing fingers at each other does not stop the water :-(","I don\u0027t give a fuck about these cunts in Staines / Somerset etc with water in their front room. UKIP voting mugs. gutted.","Somerset under water for a month, not much news..Thames bursts banks, its a major news event and politicians get involved..","RT @AnonNIreland: Given the amount of press coverage the conservative voters in Berks \u0026 Surrey are getting, I\u0027m sure they\u0027re seething in So…","@stephenfry please RT https://t.co/avsz8ZlUn7  now in 8th week of flooding! Don\u0027t let people forget about us #dredgetherivers","@dlknowles Avon \u0026 Somerset Police has yet to run amok shooting suspected looters like the New Orleans Police Department did after Katrina.","#UKIPfail \u003e @jwrotherham: SOMERSET FLOODS: Why isn\u0027t Farage owning up to the EU\u0027s role in this disaster? http://t.co/qmxHZyBzqV","If are looking for #storage in north #Somerset we have plenty available, ask us for a quote","The flooding in Somerset is God\u0027s payback for not being able to get Glastonbury tickets this year.","The Westminster idiots send £27million in aid to China and £290million to India, both have their own space programmes. Heard of Somerset?","RT @Jane_Samuels: \"In Norway or France, if a planner or mayor gives permission to develop in the flood plain then they are held liable.\" Su…","RT @dredgetherivers: #FLAG is encouraging donations to @Somerset_CF \u0026 practical gifts like waders \u0026 diesel for tractors: please no more foo…","Bedfordshire YFC @LBYoungFarmers are supporting #forageaid. Pls deliver any forage for the Somerset farmers to Watergate Farm, Hockliffe.","RT @RealLeeNelson: Feel so sorry for the people of Somerset. First the floods, then David Cameron comes to visit.","RT @tauntonmayor: To help those hurt most by flooding please donate to @Somerset_CF  by texting 70070 NOAH95 £10 (or different amount) #som…","RT @TheBarleyWeasel: Hello Farmers of Norfolk \u0026 Suffolk.\nI\u0027ve been offered 2 artics to take to Somerset. Can anyone donate fodder beet or f…","@luliemma http://t.co/ei51b6vhKK and this more so http://t.co/ew4SeZeU0y","RT @BritishPatriot: I can well believe this... #Somerset http://t.co/DJJ45xqA90","RT @rdgresident politicians in Purley or Somerset pointing fingers at each other does not stop the water :-( #rdguk #rdgnews #ukfloods","RT @TescoMedia: Good news, we\u0027ve secured extra lorries to help take animal feed down to help farmers in Somerset. http://t.co/w0RbnpRaMM","Suffolk Fire and Rescue are still providing aid to flood stricken villagers in Somerset using the Bury St Edmunds Unimog","RT @nbyward: SOMERSET FLOODS: Why isn\u0027t Farage owning up to the EU\u0027s role in this disaster? http://t.co/OBFZmlaUew","Conservative Apologies and Lies in Flooded Somerset http://t.co/zVd1Tyor8w","RT @BernaMeaden: On taking office David Cameron approved a £97m cut in flood protection, – a 17% real terms cut in one year. #somerset http…","Anti-government millionaires in Somerset, Berkshire, Bucks, etc. complaining that government is too slow to help them #floods","#BBC #somerset @downingstreet @Number10press why do managers / #directors need a bonus TO DO THEIR JOB!!, JUST ANOTHER TYPE OF CORRUPTION","RT @ubrianis: #Floods are a golden opportunity for Somerset\nIt could become the Venice of the West.\nWho needs to farm when you can charge £…","@AlanCarr Don\u0027t suppose you would mind tweeting this link to help Somerset Flood Victims.Would be very grateful.TY https://t.co/L0Jl35nCz1","RT @ginandting: My mum has 1.5 acres of grazing in #Somerset (near Crewkerne) if anyone affected by the flooding needs to move their animal…","RT @rdgresident: politicians in Purley or Somerset pointing fingers at each other does not stop the water :-(","RT @Okeating: Much of Somerset will freeze over when the temperature drops today. MPs are warned to stay away but Torvill \u0026 Dean are expect…","RT @mintageone: @hotpatooties Pls would you consider rt this link to help the flood victims here in Somerset? It\u0027s heartbreaking..https://t…","@EdwardWinfield The issue is the amount of water. Dredging sadly wouldn\u0027t have done much. http://t.co/maycxBfB3Q","RT @HuffPostUK: 27 incredible aerial shots of Somerset homes under water http://t.co/WoTDUYIyEM http://t.co/1OW9N7y4Y0","RT @willpenrievans: As a farmer I\u0027ve never had good things to say about @Tesco but fair play they\u0027ve been superb providing haulage for floo…","@SarahV1982 The difference is that many more lives are at risk in the South East. The bulk of the flooding in Somerset is agricultural land.","RT @HouseofCommons: There will be an Urgent Question at 3.30pm from @meaglemp on Government\u0027s response to recent #flooding in #Somerset. Mo…","#DavidCameronPM at least he has the #guts to go and face the flooded residents of #Somerset ,now cough up with aid money ?","RT @PARRY1956: Conservative Apologies and Lies in Flooded Somerset  http://t.co/QQVGoJOiXe PLEASE RT","politicians in Purley or Somerset pointing fingers at each other does not stop the water :-(","SOMERSET FLOODS: Why isn\u0027t Farage owning up to the EU\u0027s role in this disaster?  http://t.co/do4GWx8Qra via @nbyward","As a libertarian, I feel that if you and your family choose to live in Somerset, the government should allow you to drown.","RT @TescoMedia: Good news, we\u0027ve secured extra lorries to help take animal feed down to help farmers in Somerset. http://t.co/w0RbnpRaMM","RT @TescoMedia: We\u0027ve collected 40 bales of feed for farmers in Somerset today and expect to deliver another 120 tomorrow http://t.co/t9Cm5…","@EamonnHolmes they close the TFB and show em how they feel in Somerset, perhaps then DC would take notice","Conservative Apologies and Lies in Flooded Somerset  http://t.co/QQVGoJOiXe PLEASE RT","RT @GittishamBandB: Horrendous night of wind and rain - thoughts go to Somerset and Thames area - but, being positive - we are ok and #open…","RT @scstrachota: Thank you to all Tesco distribution colleagues helping farmers in somerset. We\u0027re setting up to deliver +400 bales http://…","RT @SnapGate: @somerset_tech Thanks for the comment on my @trustiv blog, hope they\u0027re now aware of the dangers! http://t.co/6vgu0hfRwQ #top…","RT @mini_eco_craft: Feeling very grumpy about the relentless rain in #Somerset #justsaying","@KTHopkins please RT https://t.co/avsz8ZlUn7  now in 8th week of flooding! Don\u0027t let people forget about us #dredgetherivers","RT @BillOddie: Somerset Levels. It\u0027s NOT birds before humans. Management for wildlife would control flooding. Since when did this govt care…","@somerset_tech Thanks for the comment on my @trustiv blog, hope they\u0027re now aware of the dangers! http://t.co/6vgu0hfRwQ #topgear #webperf","@ryan_donnelly88 i hope the people of somerset don\u0027t see this and blame you for any further flooding coz u dint ask for it to be sunny in uk","Horrendous night of wind and rain - thoughts go to Somerset and Thames area - but, being positive - we are ok and #openforbusiness @OACltd","RT @westernshores: UK weather: Scientists say Government\u0027s obsession with deregulation \u0026 cost-cutting responsible for Somerset flooding htt…","@themichaelowen I\u0027m sure everyone in Somerset wishes you well.","@KTHopkins Pls would you consider rt this link to help the flood victims here in Somerset? It\u0027s heartbreaking..https://t.co/PSiKmyeEtm …","RT @TomClarkeC4: Unlikely refugees from the Somerset floods.  Three tortoises one weighing 5 stone keeping warm by the pub fire. http://t.c…","@stephenfry Would you be kind enough to tweet this link to help Somerset Flood Victims. 8th week and still no help  https://t.co/L0Jl35nCz1","Somerset Community Foundation is fundraising for @@Somerset_CF on @JustGiving. Show your support http://t.co/rfWc31xjK7","#BBC #somerset @downingstreet @Number10press in recent years now both flourishing unlike most of the #UK .","RT @UniRdg_News: \"The idea that dredging would have prevented #ukfloods is fanciful\" - Dr Hannah Cloke in @Independent: http://t.co/OIvMujj…","RT @Slogfrog: Bit late for that @Ed_Miliband.....this mad EU flood management directive took place on your watch - remember?\nhttp://t.co/ij…","RT @Jane_Samuels: \"In Norway or France, if a planner or mayor gives permission to develop in the flood plain then they are held liable.\" Su…","#bbcsochi no but canoeing in Somerset is a good excuse!","So sorry for all those affected by the floods. Feel so lucky. But what no trees on the Somerset plains, they seem to be few and far between","RT @jwrotherham: SOMERSET FLOODS: Why isn\u0027t Farage owning up to the EU\u0027s role in this disaster? http://t.co/tshXodFqmn via @nbyward","A star is born in Somerset West. http://t.co/kkFb7YwHVe @lorraineEmery1 @wines_lithos @SeanPaulEmery @ChristianEedes #CapeTown #wine","Roger Falconer\u0027s solution to the Levels problem seems both elegant and productive. Creating clean energy from all... http://t.co/PezGoyWA75","RT @Slogfrog: Bit late for that @Ed_Miliband.....this mad EU flood management directive took place on your watch - remember?\nhttp://t.co/ij…","RT @SvenRadio: Beneath the Somerset Levels there\u0027s SHALE GAS Why was FUNDING CUT by the same £10 million that\u0027s now been given back? http:/…","RT @BernaMeaden: On taking office David Cameron approved a £97m cut in flood protection, – a 17% real terms cut in one year. #somerset http…","Amazing story on @bbc5live last night about Sikh community in Slough and elsewhere providing voluntary help to people in Somerset #floods","RT @aljwhite: Got hold of these pics of #Somerset a couple of hrs ago. Some of them are incredible. http://t.co/YxOyRZUgio","RT @countryproteas: 225-mile \u0027tractor aid\u0027 run to raise plight of Somerset farmers | News | Farmers Guardian http://t.co/6IB5qsR5U6","RT @Slogfrog: Can\u0027t understand @BrunoBrussels why EU\u0027s incompetent role in Somerset floods evoking Wall of silence...or can I?\nhttp://t.co/…","@midthirtiesdad True, but people in Somerset have been saying for over a week \u0027this is really serious\u0027 and response was definitely weak","RT @BillOddie: Somerset Levels. It\u0027s NOT birds before humans. Management for wildlife would control flooding. Since when did this govt care…","RT @IndyPolitics: UK weather: Scientists say Government\u0027s obsession with deregulation and cost-cutting responsible for Somerset ... http://…","RT @d_whitehouse: David Cameron neknominated to drink all of the flood waters by angry Somerset Levels resident.","RT @Somerset4all: Good morning! Despite the rain - most of #Somerset is #openforbusiness","@MrPeterAndre Would you be kind enough to tweet this link to help Somerset Flood Victims? It\u0027s desperate here now https://t.co/L0Jl35nCz1","RT @HouseofCommons: There will be an Urgent Question at 3.30pm from @meaglemp on Government\u0027s response to recent #flooding in #Somerset. Mo…","#Floods are a golden opportunity for Somerset\nIt could become the Venice of the West.\nWho needs to farm when you can charge £50 per icecream","Good morning! Despite the rain - most of #Somerset is #openforbusiness","#BBC #somerset @downingstreet @Number10press thats problem with this corrupt #state it\u0027s built on bonuses based on cutting money / budgets","RT @FelicityMorse: Y\u0027all can stop making the same joke about Eric Pickles now. @BJsatire has just won #Somerset #floods http://t.co/VKmD5Y8…","RT @WeatherSteff: Given Somerset\u0027s rain, every drainage channel could have been doubled \u0026 large parts would still have flooded http://t.co/…","Don\u0027t fancy Somerset and Gloucestershire\u0027s chances of securing #flood funding now that Berkshire and Surrey are in trouble.","Daily Mail spends years telling the world how wealthy the residents of Somerset are; now asking poor people to bail them out #floods","SOMERSET FLOODS: Why isn\u0027t Farage owning up to the EU\u0027s role in this disaster? http://t.co/tshXodFqmn via @nbyward","RT @hollandtrade: Dutch firm @VanHeckGroup dispatch 13 high-capacity pumps to aid flood-stricken county of #Somerset. Via @HollandWater htt…","#forgottenfolketale from #somerset today. Anyone heard a more recent rendition of this? #Taunton #1912 http://t.co/slTb6ypCFf","@Ed_Miliband \nO we\u0027ll visit the floods on your doorstep. What about the Somerset levels?","\"It\u0027s a funny thing about life; if you refuse to accept anything but the best, you very often get it.\" ~ William Somerset Maugham","The rain fell alike upon the just and upon the unjust, and for nothing was there a why and a wherefore. - W. Somerset Maugham","RT @FuelPovAction: What the frack? \u0027New #fracking licenses could include Somerset flood plains\u0027:  http://t.co/CeTRFke2YR","@Ed_Miliband so you\u0027re interested now lts The Thames near London eh? Somerset?????","RT @BritishPatriot: I can well believe this... #Somerset http://t.co/DJJ45xqA90","225-mile \u0027tractor aid\u0027 run to raise plight of Somerset farmers | News | Farmers Guardian http://t.co/6IB5qsR5U6","Somerset farm floods plan defended\nhttp://t.co/LowV7SXm9o","Understand the hydrology- dredging isn\u0027t the  simple solution  http://t.co/KWtpPozKpM","@brianmoore666 It\u0027s pretty awful in the Thames Valley \u0026 Somerset levels but its hardly South Sudan or Syria, is it?","RT @gallagherbren: As soon as the floods reach the the SE its a national disaster and first 7 pages of some dailies. Don\u0027t recall this 4 So…","RT @MathewThresher: If another country treated the residents of the Somerset levels as our government has we wud probably go to war with th…","RT @aloadofnonsense: The Brighton Blogger - Caravanning in Somerset: http://t.co/RDs9VGvgtb","RT @FriseSally: Raining, raining, raining, raining!  Close to Somerset Levels here.   I despair for poor folk nearby.  Will it ever stop?","RT @iLauraJayne: @Josiestweet please RT https://t.co/avsz8ZlUn7  now in 8th week of flooding! Don\u0027t let people forget about us #dredgetheri…","RT @JacksonT0ny: Poor people in Somerset can be forgiven for feeling aggrieved about difference in response to them and then to Berks/Surre…","“@RoyalAirForceUK: RT @BritishPatriot: I can well believe this... #Somerset http://t.co/9084zNShwK` Oh dear! :-(”/ You don\u0027t believe that?","Oh, Somerset, land of summer people, I love you but I\u0027m so glad to be away, knowing quite how miserable floods make life.","RT @MrPaulRobinson: And there\u0027s more bad news for one family in Somerset as Neil Warnock arrives at their house on his tractor #lufc http:/…","RT @UniRdg_News: \"The idea that dredging would have prevented #ukfloods is fanciful\" - Dr Hannah Cloke in @Independent: http://t.co/OIvMujj…","Following the success of previous events there will be a Woodland Ride event held in April. Thanks to the kind... http://t.co/B83Rxk2KYu","@MhmmdHzq_ somerset mann","RT @frsimon: Have you noticed that all the while Devon \u0026 Somerset was flooded it was \"oh, never mind\" but now it\u0027s Thames Valley it\u0027s all C…","#BBC #somerset @downingstreet @Number10press now how much will it cost to put right, if you cut #EA budget how can they do their job?","Dutch specialists bring pumps to Somerset | Construction News | The Construction Index: http://t.co/IFlRbAuMyC via @tcindex","RT @FuelPovAction: What the frack? \u0027New #fracking licenses could include Somerset flood plains\u0027:  http://t.co/CeTRFke2YR","@MrPeterAndre please RT https://t.co/avsz8ZlUn7  now in 8th week of flooding! Don\u0027t let people forget about us #dredgetherivers","RT @BillOddie: Somerset Levels. It\u0027s NOT birds before humans. Management for wildlife would control flooding. Since when did this govt care…","RT @mintageone: @hotpatooties Pls would you consider rt this link to help the flood victims here in Somerset? It\u0027s heartbreaking..https://t…","RT @UKIPNCornwall: Another Day, another £50 Million to the EU - Somerset still flooded - Good thing we are flush with money! http://t.co/J0…","RT @mintageone: @hotpatooties Pls would you consider rt this link to help the flood victims here in Somerset? It\u0027s heartbreaking..https://t…","@Josiestweet please RT https://t.co/avsz8ZlUn7  now in 8th week of flooding! Don\u0027t let people forget about us #dredgetherivers","Also, a reminder of the various ways you can help farmers in Somerset http://t.co/QcSCCjtP2Q","RT @utterben: SOMERSET: \"Our entire county is underwater.\" \nSURREY: \"Our 4x4 got wet on Harriet\u0027s school run and our organic veg patch is w…","RT @waterlevels: Worth repeating @TakeOffMediaUK @heathervenn123 @spencer68 my \u0027stance\u0027 is better flood management in Somerset for people, …","@yokelbear they\u0027d just started taking the Somerset floods seriously to be fair. Also population is denser on the Thames.","#BBC #somerset @downingstreet @Number10press these thick selfish politicians stopped systematic dredging in 1995 to save money!!","Somerset is a perfect example for why disbanding The Civil Defence Corps was a stupid idea.","RT @GraceandTed: If you text NOAH95 followed by £1, £2, £3, £4, £5 or £10 to 70070 you can donate to @Somerset_CF fund. It\u0027s less than a Va…","RT @utterben: SOMERSET: \"Our entire county is underwater.\" \nSURREY: \"Our 4x4 got wet on Harriet\u0027s school run and our organic veg patch is w…","Great hearing LBC\u0027s George Painter @gpainterbristol on the ground in Somerset!","RT @utterben: SOMERSET: \"Our entire county is underwater.\" \nSURREY: \"Our 4x4 got wet on Harriet\u0027s school run and our organic veg patch is w…","And there\u0027s more bad news for one family in Somerset as Neil Warnock arrives at their house on his tractor #lufc http://t.co/sImUup5STi","“@BritishPatriot: I can well believe this... #Somerset http://t.co/9084zNShwK”// Unfair! Fiction.They are here to help.","RT @TescoMedia: We\u0027ve collected 40 bales of feed for farmers in Somerset today and expect to deliver another 120 tomorrow http://t.co/t9Cm5…","We are looking forward to tomorrow at the AMES - Agricultural Machinery Show at Shepton Mallet, Somerset BA4 6QN.... http://t.co/FdWooT8iwm","RT @csbarielle1976: And yet, this government were quick to bring the army in to help Surrey. Took them 2 months to make a decision in Somer…","RT @WesternDaily: Somerset still open for business http://t.co/kGi2GdYvJq #somersetfloods","RT @mintageone: @hotpatooties Pls would you consider rt this link to help the flood victims here in Somerset? It\u0027s heartbreaking..https://t…","RT @mintageone: @hotpatooties Pls would you consider rt this link to help the flood victims here in Somerset? It\u0027s heartbreaking..https://t…","@dredgetherivers Heart FM #somersetfloods latest. http://t.co/FjBtrGB8Ph #FLAGpress","RT @frankieboyle: Somerset is now completely cut off from civilisation, and these floods are hardly going to help","RT @TheBarleyWeasel: Hello Farmers of Norfolk \u0026 Suffolk.\nI\u0027ve been offered 2 artics to take to Somerset. Can anyone donate fodder beet or f…","RT @TheBarleyWeasel: Hello Farmers of Norfolk \u0026 Suffolk.\nI\u0027ve been offered 2 artics to take to Somerset. Can anyone donate fodder beet or f…","\u0027Tractor aid\u0027: Yorkshire farmers to embark on 225-mile tractor run to deliver fodder/raise plight of Somerset farmers http://t.co/CPi02liVYI","SOMERSET FLOODS: Why isn\u0027t Farage owning up to the EU\u0027s role in this disaster? http://t.co/qFaaTDDDdm via @nbyward","RT @TheBarleyWeasel: Hello Farmers of Norfolk \u0026 Suffolk.\nI\u0027ve been offered 2 artics to take to Somerset. Can anyone donate fodder beet or f…","Flooding in Somerset about more than climate change or Environment Agency\u0027s failings. Its result of false dichotomy between man \u0026 nature.","@DaveDixon4 except those with holiday homes on the Somerset levels or along the Thames I expect","#BBC #Somerset @downingstreet @Number10press these r the same politicians \u0026 their greedy corporate mates that allow building on #floodplains","A further piece relating EU control over Somerset floods\nhttp://t.co/GPd1JVCEyO"],"id":1,"autoSummary":"RT @Octofish: Scientists say Government\u0027s obsession with deregulation and cost-cutting responsible for Somerset #flooding http://t.co/fFTnO…"}}