{"10":{"topic":"anna segal","tweets":["Anna Segal will finish fourth. Doh!","RT @SochiOnTen: Anna Segal remains in 3rd! 1 competitior remains who can knock her off the podium! Will she hold on!","Anna Segal looks good for a third","RT @lorrainelock: This is KILLING me! only one more competitor until we find out if Anna Segal retains her 3rd place and bags the bronze! #…","This is KILLING me! only one more competitor until we find out if Anna Segal retains her 3rd place and bags the bronze! #GoAnna","Anna Segal still third! Just need the judges to be on our side!!","Yes Anna Segal still there in Bronze #goaussie She needs to hold on for one more! Ski #slopestyle #sochi","Anna Segal remains in 3rd! 1 competitior remains who can knock her off the podium! Will she hold on!","This is so tense!!!!! C\u0027mon Anna Segal!","Anna Segal is mighty close to a bronze - worst case is 4th now. @sochi2014 @dailytelegraph","Anna Segal was dudded a good 5points in her first run","High fives for anna_segal go for BRONZE girlfriend we are all rooting for you!!! #annasegal #sochi2014… http://t.co/T92AWw2RSo","RT @stahl_jason: After the first run: 1. @DaraHowell 2. @dlogan 3. Anna Segal #slopestyle #Sochi2014","RT @RealMattBell: The amount crashes on the ski slope style makes Anna Segal\u0027s run even more special. Come on Aussie #Sochi2014","Anna Segal hoping to do a Bradbury here #goAnna","Nervous times for Anna segal 2 more to come , c\u0027mon more stacks we want medals #goanna","Get up Anna segal #sochi","#Sochi2014  crash of the games so far. Awful stuff. Fingers crossed Anna Segal holds on","The amount crashes on the ski slope style makes Anna Segal\u0027s run even more special. Come on Aussie #Sochi2014","This is getting interesting - worst case scenario now for Anna Segal is 5th. #sochi14 @dailytelegraph","Go you good thing Anna Segal! #Sochi2014 #winterolympics","RT @AresMarsFlack: Lookout other skiers - Anna Segal is Steven Segal\u0027s niece: you score better than her, she snaps your neck like a twig #S…","Can anyone tell me who Anna Segal went?","RT @AresMarsFlack: Poor Anna Segal, pulls a John Belushi - face full of powder. Judges typically don\u0027t score the Belushi well #Sochi","Anna Segal close to our first medal this games. Slush the snow up baby! #Sochi2014","Hopefully Anna Segal gets a medal! Go Anna! #GoAussies #Slopestyle #Sochi2014","RT @abcgrandstand: Anna Segal crashes out on the last jump of her second run, but her first run score still has her in third place #Sochi20…","Lookout other skiers - Anna Segal is Steven Segal\u0027s niece: you score better than her, she snaps your neck like a twig #Sochi","RT @GBFreeski: Anna SEGAL AUS32 R2 goes for 7 twice, over-rotates comes up short, 28.80 no lift but sits 3rd #Sochi2014 #GoTeamGB #GoKSUM","Not looking good for Anna Segal for slopestyle podium :( #SochiOnTen (see what I did there @tim_chr)","Commentator when Anna Segal over turns in her ski-ing spin \"Oooh a 738,which isn\u0027t divisible by 180\"- the sarcastic mathematician #Olympics","We’re all (secretly) hoping every athlete crashes out from now on so that Anna Segal can win the bronze medal for Aus, right? #Sochi2014","Anna Segal still in 3rd place!! wow!! #goanna","Anna Segal is better! Surely we keep third! #Sochi2014","after watching anna segal im seriously considering taking up skiing #babe #betterthantorah?","RT @FOXSportsNews: AUSSIE ALERT - Australia\u0027s Anna Segal crashes out in her second run in the Ladies Ski Slopestyle.. still has her first r…","Anna Segal the bird skier on the winter Olympics everyday life 5/10. Cuz the rest are rotters she goes to an 8/10 #Fractions #SportingRatios","poor anna segal she was doing so well unfortunately had a stroke of bad luck","Oh! Bummer for Anna Segal on that second run. She sits in third with a few more competitors to go! #slopestyle #Sochi2014 #WinterOlympics","Anna Segal will you marry me? #Sochi2014","Well Done Anna Segal.\nYou have done ya best.\nAnd thats cool.. #Sochi2014","Final run fails for Anna Segal of Australia. 28.8 points after biting it hard. #Slopstyle #Sochi2014","RT @AresMarsFlack: Poor Anna Segal, pulls a John Belushi - face full of powder. Judges typically don\u0027t score the Belushi well #Sochi","Awww man.. Anna Segal who was having a good run, wiped out..  \u003d( ... #everystep #sochi","Oh, Anna Segal is down, that looked nasty!! Shame she could\u0027ve medaled #bbcsotchi","RT @FOXSportsNews: AUSSIE ALERT - Australia\u0027s Anna Segal crashes out in her second run in the Ladies Ski Slopestyle.. still has her first r…","RT @stahl_jason: After the first run: 1. @DaraHowell 2. @dlogan 3. Anna Segal #slopestyle #Sochi2014","RT @GBFreeski: Anna SEGAL AUS32 R2 goes for 7 twice, over-rotates comes up short, 28.80 no lift but sits 3rd #Sochi2014 #GoTeamGB #GoKSUM","aw anna segal, so close!! proud of you girl! @AnnaSegal","Well done Anna Segal #proud","Poor Anna Segal, pulls a John Belushi - face full of powder. Judges typically don\u0027t score the Belushi well #Sochi","My heart just dropped for Anna Segal :( #WinterOlympics","Going for it. Awesome effort Anna segal. #Sochi2014","RT @abcgrandstand: Anna Segal crashes out on the last jump of her second run, but her first run score still has her in third place #Sochi20…","Anna segal wipesout on her 2nd run and her 77 will stand as her best on what csn now be described as a shit course #Sochi2014 #starthut","Anna Segal crashes out in her second run but still in line for Bronze at #sochi","Anna SEGAL AUS32 R2 goes for 7 twice, over-rotates comes up short, 28.80 no lift but sits 3rd #Sochi2014 #GoTeamGB #GoKSUM","Big wipe out on last jump for Anna Segal. #Tough #Sochi2014","AUSSIE ALERT - Australia\u0027s Anna Segal crashes out in her second run in the Ladies Ski Slopestyle.. still has her first run score of 77.00","Anna Segal crashes out on the last jump of her second run, but her first run score still has her in third place #Sochi2014","anna segal crashes on her second run, can finish no better than third #Sochi2014","Anna Segal found the knuckle #Sochi2014","My heart just dropped for Anna Segal.","Anna Segal has gone down ..... going for it.","Australia\u0027s Anna Segal in medal contention in women\u0027s ski slopestyle - third spot after each competitor\u0027s first run - http://t.co/yamAKLTgta","This is nervy stuff, Anna SEGAL AUS32 is up #Sochi2014 #GoTeamGB #GoKSUM","Here we go!!! Good luck and go Anna Segal 😊😊😊","@tim_chr “Tough conditions.\" Good for Anna Segal, though!","RT @stahl_jason: After the first run: 1. @DaraHowell 2. @dlogan 3. Anna Segal #slopestyle #Sochi2014","RT @BiggestLoserAU: Hi @jasonfe25, #BiggestLoserAU will be back 7.30 tmrw! Just stepped aside for Anna Segal to hopefully triumph in #Sochi…","C\u0027mon Anna Segal! Sitting solid in third, throw down on this final run!!!","It\u0027s rock and roll time Anna Segal! #SochionTen #Willget95","Aussie Anna Segal attempting her next run at #Sochi within the next 10 minutes.","Love watching this womens Ski slopestyle. Cheering on Anna Segal. Go Aussie #Sochi2014","Anna Segal in 3rd position #goanna","RT @DewTour: After first run, 1. @DaraHowell 2. @dlogan 3. Anna Segal #slopestyle #Sochi12014 @NBCOlympics","RT @kurtley_beale: Great skiing Anna Segal..!!! #GoAussies #WinterOlympics","Were you watching Anna Segal at #Sochi2014 tonight? Lorraine Lock interviewed her for @WomensAgenda  http://t.co/744xst1nMD","RT @DewTour: After first run, 1. @DaraHowell 2. @dlogan 3. Anna Segal #slopestyle #Sochi12014 @NBCOlympics","My goodness, I\u0027m so nervous for Anna Segal. I think I can\u0027t stress enough how important her 2nd run is coming up. #SochiOnTen #GoAus","Segal through to slopestyle final: AUSTRALIAN big event performer Anna Segal has landed a berth in Tuesday nig... http://t.co/EemyQyDVvX","RT @FOXSportsNews: Australia\u0027s Anna Segal is in the bronze medal position following her first run in the Ladies Ski Slopestyle #Sochi2014","RT @Drew_N_Pearson: Some would think there was a fight between a goana and seagull tonight? Go Anna Segal! #Sochi2014","RT @MissAlissaSmith: Wow! What an awesome first finals run for Anna Segal! #Sochi2014 #goAnna","After first run, 1. @DaraHowell 2. @dlogan 3. Anna Segal #slopestyle #Sochi12014 @NBCOlympics","RT @FOXSportsNews: Australia\u0027s Anna Segal is in the bronze medal position following her first run in the Ladies Ski Slopestyle #Sochi2014","RT @MissAlissaSmith: Wow! What an awesome first finals run for Anna Segal! #Sochi2014 #goAnna","RT @FOXSportsNews: AUSSIE UPDATE - Australia\u0027s Anna Segal produces a score of 77.00 in her opening run of the Ladies\u0027 Ski Slopestyle #Sochi…","Anna Segal! You go girl! Bring home our first medal! Pleaseeeee!","Some would think there was a fight between a goana and seagull tonight? Go Anna Segal! #Sochi2014","RT @abcgrandstand: Anna Segal sits in third place at the completion of all competitors\u0027 first runs. Is Australia\u0027s medal moment coming up? …","RT @stahl_jason: After the first run: 1. @DaraHowell 2. @dlogan 3. Anna Segal #slopestyle #Sochi2014","RT @kurtley_beale: Great skiing Anna Segal..!!! #GoAussies #WinterOlympics","RT @abcgrandstand: Anna Segal scores 77.00 in her first run of the Women\u0027s Skiing Slopestyle final. She is currently in first place #Sochi2…","RT @stahl_jason: After the first run: 1. @DaraHowell 2. @dlogan 3. Anna Segal #slopestyle #Sochi2014","RT @FISfreestyle: #slopestyle finals: Dara Howell leading after first run (94.20) ahead of Devin Logan (85.40) and Anna Segal (77.00) #Soch…","#slopestyle finals: Dara Howell leading after first run (94.20) ahead of Devin Logan (85.40) and Anna Segal (77.00) #Sochi2014","Watching me some #Sochi2014 #WinterOlympics - go Anna Segal!","Amazing girl power on the slopes with Oz Anna Segal. Backwards skiing, all the cool kids are doing it! #GoAnna #Sochi2014","Australia\u0027s Anna Segal takes a jump during the women\u0027s freestyle skiing slopestyle qualifying at the Rosa Khutor ... http://t.co/VouG8EnI6J","Come on @Anna Segal\n\n I am feeling very Olympic today http://t.co/HcTUCqrXru","After the first run Anna Segal is in 3rd place - excellent position for the second run and perhaps a medal. #GoAnna #Sochi2014 @SochiOnTen","Segal through to slopestyle final: AUSTRALIAN big event performer Anna Segal has landed a berth in Tuesday nig... http://t.co/xyomDiLQwW","After the first run: 1. @DaraHowell 2. @dlogan 3. Anna Segal #slopestyle #Sochi2014","Whoa. 94 for the Canadian. Anna Segal drops to third.  #sochi2014","Aussie Anna Segal in the bronze medal position after the first of two ski slopestyle final runs.","Anna Segal sits in third place at the completion of all competitors\u0027 first runs. Is Australia\u0027s medal moment coming up? #Sochi2014","@KB34myHart moguls are still my fav,but Anna Segal is going well!! #aussie","Australia\u0027s Anna Segal is in the bronze medal position following her first run in the Ladies Ski Slopestyle #Sochi2014","Anna Segal in third spot after first of two runs!!!! C\u0027mon Aussie c\u0027mon.#sochi2014 @dailytelegraph","Anna Segal might be about to hear the greatest words any winter Olympian could ever hear \u0027Doing a Bradbury\u0027. #SochionTen #goanna","Anna Segal is a bloody champ, bring home a medal! #Sochi2014 #goaussie","RT @SochiOnTen: Go Anna! RT @TrendsSydney  Anna Segal, @annasegal is now trending in #Sydney #Sochi2014","RT @SSAnews: Anna Segal is in the finals of the Women\u0027s Ski Slopestyle it\u0027s live now on Sochi On Ten. Some big names out and... http://t.co…","RT @womenshealthaus: Tune in to watch Aussie champ anna_segal in the first ever women\u0027s Ski Slopestyle final tonight at… http://t.co/USt6OZ…","RT @AUSOlympicTeam: GREAT news! @AnnaSegal has had medical clearance to compete in Ski Slopestyle Tuesday #GoAUS http://t.co/9GFYjkGbLl htt…","This is all auguring very well for Anna Segal","I would love it if Anna Segal\u0027s Dad\u0027s name is Steven #GoldMedalforsure #Sochi2014","So exciting to watch Anna Segal. Women in sport! Love it!  #GoAnna #Sochi2014","I\u0027m calling it early..... Anna Segal will win a medal.... #aussieaussieaussie","RT @SochiOnTen: Go Anna! RT @TrendsSydney  Anna Segal, @annasegal is now trending in #Sydney #Sochi2014","I\u0027ve decided Anna Segal is my favourite winter Olympian.  Could not tell you why, I have no idea.  Pretty much cause she\u0027s on now   #GoAnna","\"@SochiOnTen: Go Anna! RT @TrendsSydney  Anna Segal, @annasegal is now trending in #Sydney #Sochi2014\" Bring home a gold!","At Extreme Park (where I\u0027m known as Julezee) watching Anna Segal try and nab the first Aussie medal. #Sochi2014 http://t.co/Z2Mg991VFJ","@BiggestLoserAU Ok no worries, can\u0027t wait! Havent been getting enough of BL this season for motivation! Good luck to Anna Segal! :)","Luvn Anna Segal. U go girl","@bettiwettiwoo Anna Segal will always be first in the Aussies minds!","RT @lehmannatlarge: Anna Segal hits lead with 77 pts in first run but big guns still to come.#Sochi2014 @dailytelegraph","RT @_jplusm: Solid first run in the Women\u0027s Slopestyle  by our own Aussie Anna Segal. Score of 77.0. #GoAnna ! @SochiOnTen","Anna Segal looking ace after her first run in the ski slopestyle finals. In first place at the moment! #Sochi2014","Anna Segal into slopestyle final - Yahoo!7 News http://t.co/Lk1JucMsEf","Last few runs have been impressive. Anna Segal\u0027s first would have to give her condidence #Sochi2014","Go Anna Segal at #sochi!","Anna Segal is killin it #GoAnna","Solid first run in the Women\u0027s Slopestyle  by our own Aussie Anna Segal. Score of 77.0. #GoAnna ! @SochiOnTen","RT @ByTheMinSochi: Anna Segal...finishes a pretty flawless run with a corked 7..very polished from the Aussie (77)","#Sochi2014 Anna Segal, another Aussie at the snow, and winning, what more could you ask for?","Watching #Sochi2014 #GoAnna and just decided Anna Segal is my new crush ...#howyoudoin!! @AnnaSegal","Halfway through Anna Segal, Emma Dahlstrom and Silvia Bertagna lead.","if the commentators are predicting that a 90+ score is needed to medal, does that mean anna segal probably WON\u0027T medal?","Having ridden the slopestyle course earlier today, I reckon that\u0027s a great score from Anna Segal. I\u0027m riding the halfpipe later.","My in depth knowledge of women\u0027s ski slope style says Anna Segal is off to a good start. In the lead with 77 points #SochiOnTen","@The_Dugongs Anna Segal of Australia just dropped a huge run down to take lead in #slopestyle #Sochi2014 #olympics","#Sochi2014 #slopestyle gz to anna segal. good first run","RT @SochiOnTen: Go Anna! RT @TrendsSydney  Anna Segal, @annasegal is now trending in #Sydney #Sochi2014","Great run by Anna Segal. Awesome start leading with 77.00 after her first run. #Sochi2014","Great start from Aussie Anna Segal to the #Sochi2014 women\u0027s slope style final! #GoAnna @tensporttv","RT @Smackinnon99: Aussie Anna Segal through to slope final. #goanna see it on @SochiOnTen http://t.co/Ur1fxoYv7K","You go Anna Segal! #sochiaustralia #goforgold","Anna Segal#nailed it","Great run from Anna Segal! #GoAnna #TeamAnna","ANNA SEGAL YOU AMAZING BEAUTIFUL OLYMPIAN #sochi2014","Anna Segal just stomped her 1st run #Sochi2014 #SochiOnTen #GoAnna","Anna Segal amazing run! Really beautiful girl ;)","RT @kurtley_beale: Great skiing Anna Segal..!!! #GoAussies #WinterOlympics","RT @abcgrandstand: Anna Segal scores 77.00 in her first run of the Women\u0027s Skiing Slopestyle final. She is currently in first place #Sochi2…","Boom! Anna Segal hits a 77.00 to go into the lead on her first run! Quality! #Sochi2014 #GoAnna","Anna #Segal #SochiOnTen.. that was awesome","Anna Segal killed that run. Good to finally see an Aussie comfortably on top!","Hot first run by Anna Segal in the ski slopestyle with a 77.00!!! Currently in the lead. You go girl! #Sochi2014 #GoAnna @SochiOnTen","That was incredible Anna Segal!!!! #GoAnna","Australia has the best run so far in Women’s slopestyle ski. Anna Segal leads with 77 points. #Sochi2014","Anna Segal hits lead with 77 pts in first run but big guns still to come.#Sochi2014 @dailytelegraph","NOICE! #TeamAustralia on the rails! Anna Segal! #Sochi2014","Anna Segal, woo you go girl! #GoAnna #SochiOnTen","How good is Anna Segal? This is bonkers!","Great run from Anna Segal!!\nPlaces alot of pressure on the rest of the competition!\n#SochiOnTen #Sochi2014 #GoAnna","Great skiing Anna Segal..!!! #GoAussies #WinterOlympics","RT @FOXSportsNews: AUSSIE UPDATE - Australia\u0027s Anna Segal produces a score of 77.00 in her opening run of the Ladies\u0027 Ski Slopestyle #Sochi…","Wow! What an awesome first finals run for Anna Segal! #Sochi2014 #goAnna","watching Anna Segal","RT @FOXSportsNews: AUSSIE UPDATE - Australia\u0027s Anna Segal produces a score of 77.00 in her opening run of the Ladies\u0027 Ski Slopestyle #Sochi…","GO GO Anna Segal 90 points next run!!! #Sochi2014 #Slopestyle #Aussie","C’mon Aussie Anna Segal. 77.00 takes her to the lead! Yeehaa!! #Sochi2014","Anna Segal scores 77.00 in her first run of the Women\u0027s Skiing Slopestyle final. She is currently in first place #Sochi2014","Finally a good score, Anna Segal a 77 to 1st #SkiSlopestyle #Olympics","Anna Segal...finishes a pretty flawless run with a corked 7..very polished from the Aussie (77)","Australia\u0027s Anna Segal put a very crowd pleasing run together to score 77.00 ... currently leads #Sochi2014","Beautiful first run from Anna Segal, getting into provisional 1st. Landing the jumps as smooth as you like. #Sochi2014 #Slopestyle","RT @SSAnews: Anna Segal is in the finals of the Women\u0027s Ski Slopestyle it\u0027s live now on Sochi On Ten. Some big names out and... http://t.co…","Woooooooo that was an awesome run #Sochi2014 Anna Segal #aussie gets score of 77.00 - in front in the final #goforgold","That was pretty clean run from Anna Segal! #slopestyle #WinterOlympics","Anna Segal puts down a great first run in the Slopestyle! New leader! #Sochi #WinterOlympics http://t.co/usZTAf3sE0","Anna segal has just completed her first final run with a score of 77","good run by anna segal","AUSSIE UPDATE - Australia\u0027s Anna Segal produces a score of 77.00 in her opening run of the Ladies\u0027 Ski Slopestyle #Sochi2014","Anna SEGAL AUS32 R1 270 rails, clean, switch5, grab fast 720 penultimate, cork7, put down nice! Takes lead 77.00 #Sochi2014 #winterashes","Pioneer Anna Segal show the fans what #slopestyle is all about. Landing a 720.","Cracking run in tough conditions Anna Segal! #slopestyle #Sochi2014","Aussie Anna Segal puts in a smashing first run for the #snowstyle FULLY SICK","Stoked to see Anna Segal in the slopestyle final tonight! #GoAus","RT @SochiOnTen: A few shaky runs to begin the ski slopestyle finals. 2 competitors till Anna Segal jumps.","A few shaky runs to begin the ski slopestyle finals. 2 competitors till Anna Segal jumps.","Wishing best of luck to Anna Segal of AUS on the Slopefinal freestyle sking now under way..Oi Oi!!","RT @SochiOnTen: Scars to success. Can Anna Segal complete a remarkable injury comeback with a medal on Sochi\u0027s Slopestyle course? We\u0027ll fin…","Two more before Anna Segal goes down for her first run in the final #GoAnna #Sochi2014","Anna Segal up soon in the slopestyle final - fist pump! #isupportwomeninsport #loveskiing http://t.co/rer69xsrfL","RT @SochiOnTen: Go Anna! RT @TrendsSydney  Anna Segal, @annasegal is now trending in #Sydney #Sochi2014","RT @SochiOnTen: Go Anna! RT @TrendsSydney  Anna Segal, @annasegal is now trending in #Sydney #Sochi2014","RT @SochiOnTen: Go Anna! RT @TrendsSydney  Anna Segal, @annasegal is now trending in #Sydney #Sochi2014"],"id":10,"autoSummary":"Anna SEGAL AUS32 R1 270 rails, clean, switch5, grab fast 720 penultimate, cork7, put down nice! Takes lead 77.00 #Sochi2014 #winterashes"}}