{"10":{"topic":"slam dunk","tweets":["RT @caldispute: all american rejects playing slam dunk is aids aidsican aidjects","Only band I would go to slam dunk this year for is h2o all the others I could see at other times","real friends and letlive. at slam dunk fuck yeah","The Slam Dunk announcement is well alright","RT @mikejhemsley: i\u0027m headlining Slam Dunk. pls RT.","RT @History_Pics: Michael Jordan during the 1987 Slam Dunk Contest http://t.co/ar4EV9TCbD","Slam dunk announcement is wank","The Slam Dunk announcement is so disappointing so far","Someone take me to Slam Dunk PLEASE?","RT @fueledbygaymen: SLAM DUNK LINEUP \nfrom kerrang magazine http://t.co/ZFReEQsKwS","I ach like the slam dunk line up so far becuase DECADE AND NECK DEEP AND ALL AMERICAN REJECTS","Idk the slam dunk announcement is okay I guess but I dont think I\u0027ll go if im already going to reading","RT @BeckyCantFlyyy: ITS SLAM DUNK ANNOUNCEMENT DAY","I am so going to one of the main slam dunk dates","Where can I get the slam dunk line up??","RT @silverIining: the slam dunk lineup is average right now but once they announce more bands it\u0027ll probably be proper good","Buzzing for the Slam Dunk announcement","RT @leyuuuur: slam dunk lineup atm is meh","Slam Dunk is always decent but...meh","PLS TELL ME NECK DEEP ARE ACTUALLY PLAYING SLAM DUNK","oh my sweet Jesus, @canterburymusic are playing Slam Dunk this year👌","RT @Kirkwood182: Slam Dunk Announcement http://t.co/7t7RuPXA8k","the slam dunk lineup is average right now but once they announce more bands it\u0027ll probably be proper good","slam dunk lineup atm is meh","IKTPQ and TGI at slam dunk though","And don’t forget - after all the Slam Dunk / Sonisphere excitement, @MillionairesCF announce show number two today too!","RT @CrackASmile_: All-American Rejects headlining Slam Dunk. Nice!","cannot BELIEVE AAR AEE PLAYING SLAM DUNK","SLAM DUNK LINEUP \nfrom kerrang magazine http://t.co/ZFReEQsKwS","Slam dunk line up looks pretty empty...only heard of two of the bands playing","NBA AllStar Weekend 2014 Schedule of Events Live Stream Sprite Slam Dunk ThreePoint Contest iPhone iPad App TNT NBA TV Start Time http://b","My Slam Dunk merch fund is now in full operation.  Feel free to help the cause!","The only thing good about today is the slam dunk announcement. Real friends, neck deep, decade, letlive, bury tomorrow. Ahhh.","Slam Dunk Festival looks incredible. Bury Tomorrow, letlive, The Ghost Inside, TDWP, IKTPQ and Caliban have made up my mind!","LETLIVE AT SLAM DUNK","Slam Dunk lineup\u0027s 50/50 so far","RT @chlo__xo: Why are people moaning at the slam dunk line up nah I think it tops last year","does anyone know if slam dunk is coming to Scotland this year/the line up for Scotland?","RT @caldispute: all american rejects playing slam dunk is aids aidsican aidjects","Slam dunk wales please announce bands today I just","Slam Dunk!?! Not a fan of that line up!?!","If the Slam Dunk announcement could happen before I start work, that would be fab.","all-anerican rejects, letlive, zebrahead, neck deep and crown the empire at slam dunk","Not feeling slam dunk this year","RT @fluorescentjess: don\u0027t actually think anything can beat last year\u0027s slam dunk line up","Slam Dunk line up doesn\u0027t look that great so far","SLAM DUNK FUCK YES","OMG if I go to slam dunk I\u0027ll have seen Bury Tomorrow three times!","all american rejects playing slam dunk is aids aidsican aidjects","RT @NotSoSlimWadey: Definitely wanna try and do Slam Dunk","RT @iLie_YouBelieve: last year slam dunk was loads better than hit the deck but it\u0027ll be the other way round this year for sure","OH MY GOD I WANT TO GO TO SLAM DUNK THIS YEAR SOMEONE TAKE ME IT LOOKS SO GOOD","Why are people moaning at the slam dunk line up nah I think it tops last year","H2O, neck deep, real friends, ugh does anyone fancy slam dunk with me that line up alone turns me on","the slam dunk line up is looking pretty decent","Bury tomorrow are playing slam dunk again!!!!","Sat in science refreshing my feed for the slam dunk announcement ahh","Slam Dunk needs more pop punk bands ngl if the real friends and neck deep are the only announce ones atm","RT @dantanglewood: i\u0027ll tell you whats happening on valentines day.\n\nslam dunk tickets go on sale.","@burytomorrow see you at Slam Dunk again!","H20 are playing slam dunk, well that\u0027s weird","The line up for slam dunk is announced today","Slam Dunk killed it this year. I\u0027m there","After that underwhelming Slam Dunk announcement, who\u0027s coming to party at Alexandra Palace tonight?","I will buy a slam dunk ticket just to see Letlive","Slam Dunk line up so far.. meh 😕 Neck Deep, Decade \u0026 Canterbury tho 👌","Praying for a good line up at Slam Dunk 🙏","Nah bun, can\u0027t do Slam Dunk because it\u0027s on dads birthday ffs","slam dunk lineup today I\u0027m so nervous","\"@r4ininjuly: The All-American Rejects, Bury Tomorrow, Decade, Real friends and Neck Deep at Slam Dunk ayyyy\" this sounds so sick","RT @HannahBowns: I was do hyped for slam dunk this year and then oh.","Slam Dunk is looking crap rn. Decade and Neck Deep are the only ones I\u0027m interested in rn","slam dunk lineup for 2014 (if anyone hasn\u0027t seen it yet) http://t.co/eL8UB6LhTu","Slam dunk ni RT @Frau_Podolski: Fa slap u«@Hpooker LMAO » you can\u0027t zone everybody babyGal :D RT @Frau_Podolski: Everyone is my Val..»","REAL FRIENDS ARE PLAYING SLAM DUNK REAL FRIENDS ARE PLAYING SLAM DUNK REAL FRIENDS ARE PLAYING SLAM DUNK REAL FRIENDS ARE PLAYING SLAM DUNK","All-American Rejects are playing Slam Dunk oh my god help","How do people know the slam dunk announcement already","Slam Dunk Day!!","Slam dunk is already looking better than last year","THE SLAM DUNK LINEUP LOOKS AMAZING","RT @JonnySomething: I\u0027m trying to keep calm. But All American Rejects are playing Slam Dunk.\n\nI\u0027m so happy.","RT @dantanglewood: i\u0027ll tell you whats happening on valentines day.\n\nslam dunk tickets go on sale.","Do I get drunk at Slam Dunk or the after party? That is the real question.","eh I don\u0027t know about slam dunk this year, I doubt I\u0027ll be upset about missing it","RT @Smok3ybones: laughing at how shit slam dunk is","Slam Dunk line-up in 3 letters: Meh.","The slam dunk announcement is fucking amazing","“@joeyblitz: We\u0027ll be announcing a festival appearance today.\" SLAM DUNK","First bands announced for Slam Dunk.","Letlive, The Devil Wears Prada, Neck Deep and Real Friends are playing Slam Dunk, yes.","When\u0027re the slam dunk announcements?!","SLAM DUNK ANNOUNCEMENT IS AMAZING. I am FINALLY gonna see TGI and Letlive.","I\u0027m trying to keep calm. But All American Rejects are playing Slam Dunk.\n\nI\u0027m so happy.","there\u0027s like three bands I like at slam dunk so far so I\u0027m not worried","why the hell is slam dunk in the middle of exams i don\u0027t understand the logic there","Don\u0027t miss the NBA Sprite Slam Dunk! http://t.co/nCoeBYoYne","RT @cavalier_y0uth: i just really wna go to slam dunk","slam dunk line up today 🙌","RT @FusRohDannerz: Kerrang! called Slam Dunk a \u0027pop-punk party\u0027. There are like 7 pop-punk bands on that lineup so far.","RT @robynwestwood: did kerrang magazine ruin the surprise or whatever for slam dunk by releasing it earlier than the official account haha","Letlive. at Slam Dunk alone is enough to make me go! @burytomorrow too is sick! Wanna check out TGI and Neck Deep so what they\u0027re both like","SLAM DUNK LINE UP IS RELEASED TODAY. WHAA?!","We gonna wait a while!! Magic wanted to put up $1m for that RT @DjZanD: No Lebron James in the Sprite Slam Dunk again #SMH\"","SLAM DUNK YOU BEAUTY.","RT @cavalier_y0uth: i just really wna go to slam dunk","Wow, the Slam Dunk Festival lineup is pretty shocking this year... or maybe I\u0027m just getting old...","Kerrang! called Slam Dunk a \u0027pop-punk party\u0027. There are like 7 pop-punk bands on that lineup so far.","RT @History_Pics: Michael Jordan during the 1987 Slam Dunk Contest http://t.co/ar4EV9TCbD","Really disappointed, Slam Dunk line up is a bit shit","The trending history of slam dunk is interactively charted at http://t.co/KHiXtdjmkn #Futures","HOW FUCKING GREAT IS THE SLAM DUNK ANNOUNCEMENT http://t.co/SrsgFD9hka","RT @Ellcfc: Slam Dunk announcement. http://t.co/HHOZZkJbBv","Slam Dunk is during my exams but I don\u0027t have an exam on the day fuck fuck fuck dilemma","RT @BTSP: #VIDEO \nLeBron James shows off his slam dunk skills in training! Incredible!\nhttp://t.co/UPvE5CVWtT","I wanna go slam dunk I just hope there\u0027s a better headliner but I\u0027d still go for neck deep, real friends, decade and letlive","RT @Markkisonfire: Slam Dunk announcement bands: http://t.co/0kpuKC1uPd","@CharlieRobery so it turns out that slam dunk line up is pretty solid so far","Slam dunk isn\u0027t that bad ffs. Man up","\"@beckywss: slam dunk lineup yo http://t.co/3HPg4EsCko\" @_lxser","All American Rejects are playing Slam Dunk X♥","RT @t0nguesurfer: ADTR to play slam dunk Wales and not the other slam dunks. Would love to see them tear Solus a new one","RT @buyinaspaceship: if ptv dont do slam dunk wales i will cry so much","I was do hyped for slam dunk this year and then oh.","did kerrang magazine ruin the surprise or whatever for slam dunk by releasing it earlier than the official account haha","slam dunk line up is the worst thing. it\u0027s a no from me","Slam Dunk looks pretty cool this year.","Oh fucking hell I have an English exam the day after decade play Newcastle and I\u0027m not going slam dunk either. Fuck","RT @aylott: This is way before it’s supposed to be online, but @mikejhemsley is headlining Slam Dunk http://t.co/vPP23SflJE","Slam dunk festival line up!! http://t.co/ioW2MXVWxF","Definitely wanna try and do Slam Dunk","Really wanted to go to Slam Dunk festival this year, but the line up looks crap :/","RT @Ellcfc: Slam Dunk announcement. http://t.co/HHOZZkJbBv","“@/Ellcfc: Slam Dunk announcement. http://t.co/htqXmKvDbl” @allweknowislyds not feeling it so far b","Slam dunk lineup today 🙌","RT @HistoricalPics: Michael Jordan wearing his iconic \"Cement\" Air Jordan III\u0027s on his way to a second Slam Dunk Champion title in 1988 htt…","laughing at how shit slam dunk is","Royal Family donate food to uk food banks http://t.co/JxMwj7EXS2 Titanfall Troy London Valentine\u0027s Day Yorkshire Slam Dunk","RT @aylott: This is way before it’s supposed to be online, but @mikejhemsley is headlining Slam Dunk http://t.co/vPP23SflJE","Bloody hell, H2O are playing Slam DUnk","RT @aylott: This is way before it’s supposed to be online, but @mikejhemsley is headlining Slam Dunk http://t.co/vPP23SflJE","THE FUCKING SLAM DUNK LINE UP HOLY SHIT.","Pretty crap Slam Dunk lineup so far","So glad it looks like Slam Dunk have removed some of the fangirl factor aka All Time Low","I don\u0027t even care about the headliners it literally everyone else and slam dunk south was alright last year so I might go hmmm","There\u0027s only a handful of good bands at slam dunk this year...lame","“@4nklebiting: Slam Dunk announcement today too fuck” wooooooooooooo! Do you know what time?","RT @Ellcfc: Slam Dunk announcement. http://t.co/HHOZZkJbBv","RT @dantanglewood: i\u0027ll tell you whats happening on valentines day.\n\nslam dunk tickets go on sale.","Nothing could beat last year\u0027s Slam Dunk line up though, for me anyway..","I\u0027m seriously excited for Slam Dunk now, even though I\u0027m not a fan of All American a Rejects","Neeeed to go to slam dunk!","@Adam_Forbes1 @Wizanyay @marko93101 Starting line-up for Slam Dunk was announced we making it a yearly tradition??? https://t.co/sEk7LELFqU","LETLIVE AT SLAM DUNK FUCK YES","line up for slam dunk looks shit so far lol","I\u0027ll pass on slam dunk this year","RT @Kirkwood182: Slam Dunk Announcement http://t.co/7t7RuPXA8k","Slam Dunk festival announcement. Fingers crossed for Ireland!","AAR is a surprising choice for Slam Dunk, anyone saying they\u0027re not big enough is a bit of a divvy though.","Slam dunk sounds so good omg","Bury tomorrow and the ghost inside at slam dunk someone hold my vagina I\u0027m dead chuffed","HOW IS THE SLAM DUNK LINEUP SO GOOD","Slam dunk already looks great defiantly going http://t.co/MWVIa53Vkw","RT @yourdxmise_: eg having a lack of money when slam dunk gets announced n wanting to go so badly but not being able to bc nO MONEY","Man that Slam Dunk line-up is a bit underwhelming, 3 bands i want to see so far, it will get better, but still nowhere near as good as 2013.","That\u0027s not a bad Slam Dunk lineup by any means. All American Rejects would be interesting to see. @goldfingermusic are always rad.","RT @BrooksBeau: how to get a girls panties wet:\n\nkiss her roughly \nshove her down on the bed\nslip off her underwear\nslam dunk em in down th…","Does anyone know yet who\u0027s playing slam dunk","RT @awgxskarth: 37 minutes until slam dunk announcement ahhhh","someone take me to slam dunk and hit the deck pls","RT @HistoricalPics: Michael Jordan wearing his iconic \"Cement\" Air Jordan III\u0027s on his way to a second Slam Dunk Champion title in 1988 htt…","Looool the headliner for Slam Dunk I\u0027m in tears why","RT @Byrdi_xD: @ThePotatoFiend @Clever_Doggie Slam dunk this year boizzzz?!? :3","RT @stxtesandminds: Slam dunk announcement is alright hopefully there will be better bands","The slam dunk announcement is good?????????","RT @timlovejoy: “@BTSP: #VIDEO \nLeBron James shows off his slam dunk skills in training! Incredible!\nhttp://t.co/mf9gUP4trR” - brilliant","RT @_ToxicValentine: Where are people getting the slam dunk announcement from, i can\u0027t find it","Gotta convince somebody to come to Slam Dunk. I really need to see Goldfinger.","Anyone know what the slam dunk line up is?? Can\u0027t find it lmao","@ThePotatoFiend @Clever_Doggie Slam dunk this year boizzzz?!? :3","RT @sarah_atl: Please let there be a Slam Dunk Wales announcement today too, hope it\u0027s happening again this year!","I love slam dunk coz its literally 10 minutes from my house hah","IS THE SLAM DUNK LINEUP RELEASED TODAY?!?","Not really a fan of the slam dunk line up","Please let there be a Slam Dunk Wales announcement today too, hope it\u0027s happening again this year!","Where is the slam dunk announcement? cause I can\u0027t find it! :(","Still not sure if I\u0027ll bother with Slam Dunk, good line up so far, but majority of those are bands who have been over here a lot recently.","@emilymaysamuelx \nHaha, thank you! \nOh man, I\u0027m so excited about slam dunk!","Bit let down by the Slam Dunk announcement but whatever","All American Rejects are headlining Slam Dunk? Really? Are they still relevant? #slamdunk","Already mentally preparing myself for Gives You Hell at Slam Dunk","All American Rejects headlining Slam Dunk this year is more than enough to make me go. Love me Tyson Ritter.","RT @majorleagve: slam dunk line up is pretty weak so far minus like two bands","I\u0027m kinda sold just for CTE at slam dunk","Slam Dunk line up is looking pretty nice","Want to go to slam dunk :( Someone be my friend pls and come with me","wow heavier line up for Slam Dunk this year. but letlive niiiiiccceee","hopefully the second slam dunk announcement will be even better","Where are people seeing the slam dunk line up?","@KinaraManku all American rejects are at slam dunk this year http://t.co/num8eVFHja","RT @FluffehAdam: Slam dunk announcement today *giddy dance*"],"id":10,"autoSummary":"\"@MikeVick: Who need a slam dunk contest when you do the dunks that LBJ do on fast breaks lmao! #BronBron\" flop alert"}}