{"11":{"topic":"shirley temple","tweets":["You\u0027ve Heard of the Shirley Temple drink! Now here is the \"Willie Scott\" drink from The Temple of Doom!... http://t.co/bKJMcBIstn","RT @TheBWaldorf_: \"I stopped believing in Santa when I was six. Mother took me to see him in a store and he asked for my autograph.\" -- RIP…","RT @Fact: Shirley Temple died last night at around 11PM. She was 85-years-old.","RT @taylorswift13: Sitting backstage at the O2 in London, thinking about what an impressive and extraordinary life Shirley Temple led. Than…","Award for most unexpected tweet today goes to @yokoono MT \"I won a costume competition by being Shirley Temple. http://t.co/WRXOYJflv3\"","RT @UsVsTh3m: A parody Twitter account tricked The Guardian into claiming Shirley Temple was a big fan of post-punk band The Fall http://t.…","RT @ABC7News: BREAKING: Actress and child star Shirley Temple has died. She was 85 years old. http://t.co/o1ZeV46gpx http://t.co/0wlJ0pLQwx","RT @JimRobbinsPhoto: I can only hope that Shirley Temple Black\u0027s life was as rich as her early film career. A thankful fan.","RT @UsVsTh3m: A parody Twitter account tricked The Guardian into claiming Shirley Temple was a big fan of post-punk band The Fall http://t.…","RT @ABC7News: BREAKING: Actress and child star Shirley Temple has died. She was 85 years old. http://t.co/o1ZeV46gpx http://t.co/0wlJ0pLQwx","RT @gramilano: BBC News - In Pictures: Shirley Temple http://t.co/RDPVebABdV","wait shirley temple died a few days ago and no one talked about it¿ she was my beyonce when i was little and the drink is poppin 2 bruh","Good luck needs no explanation.\n- Shirley Temple","RT @HistoryInPics: RIP Shirley Temple (1928 - 2014) http://t.co/KHnPMexatY","RT @taylorswift13: Sitting backstage at the O2 in London, thinking about what an impressive and extraordinary life Shirley Temple led. Than…","Shirley Temple dead at 85 - http://t.co/LriCBtbNks http://t.co/smWMf4qh1v","Shirley Temple dead at 85 - http://t.co/vUMYqfN9RR http://t.co/2EP0KsNNW3","i-rena: RIP....Hollywood\u0027s Little Princess: Shirley Temple... http://t.co/YmBHxLAZJX","RT @Nigella_Lawson: In honour of the late Shirley Temple, a reminder that drink named after her is ginger ale w dash grenadine, orange slic…","RT @UsVsTh3m: A parody Twitter account tricked The Guardian into claiming Shirley Temple was a big fan of post-punk band The Fall http://t.…","Shirley Temple dies aged 85 http://t.co/rAPDVzwJbh","Shirley Temple Black: legendary child star dies at 85 http://t.co/55HlVzBqgL via @msnents","RT @UsVsTh3m: A parody Twitter account tricked The Guardian into claiming Shirley Temple was a big fan of post-punk band The Fall http://t.…","RT @katyperry: You were the original cherry on top Shirley Temple! Rest In Peace! 🍒","RT @ravenhairgirl: Shirley Temple Black, Academy Award winning adorable child star and widely respected diplomat, sailed away on the Good S…","RT @HollywoodNBC: In memory of actress, singer, UN Representative and US Ambassador Shirley Temple Black.\nRIP \n#ShirleyTemple http://t.co/1…","RT @GAHorseRacing: Shirley Temple an American Treasure passes away. Heaven now holds her smile forever. http://t.co/RAqcZXLNvl","I didnt eem know Shirley Temple was a real person, i thought it was just a drink #excusemyignorance","RT @markmahon: Just heard about the passing away of #Hollywood icon, Shirley Temple. I met her at the \u002706 SAG Awards \u0026 she was so sweet. Re…","Shirley Temple Black, Hollywood’s Biggest Little Star, Dies at 85 http://t.co/VRkEaRguOI","RT @gramilano: BBC News - In Pictures: Shirley Temple http://t.co/RDPVebABdV","Shirley Temple, the model child star - http://t.co/i3slWsWhrN","Shirley Temple dies aged 85 http://t.co/YZtikYGHMe","RT @FilmmakerIQ: Shirley Temple 1928 - 2014 http://t.co/6Ph32qWfoi","RT @gramilano: BBC News - In Pictures: Shirley Temple http://t.co/RDPVebABdV","To be honest, I thought Shirley Temple died a long time ago. Kinda like a JonBenet Ramsey sorta thing. I guess I was wrong.","I had no idea that Shirley Temple was still alive. Thought she died years ago. Am I the only one. #ShirleyTemple","RT @gmanews: Shirley Temple Black, former Hollywood child star, dies at 85 http://t.co/SC2TCvHToU","Shirley Temple Black, child star who became diplomat, dies at 85 http://t.co/4TA3cUFtrl","@SparkyRobot you have broken my day. Now all I can see is old Shirley temple in leather trousers and a leather bikini. Like coyote ugly","Celebrities react to Shirley Temple\u0027s death http://t.co/mmW7ZIAiYL","Celebrities react to Shirley Temple\u0027s death http://t.co/UN6lId3j3Y","♦ http://t.co/3BoohnjiDl 597 ♦ Shirley Temple ♦ Shirley Temple Black, Screen Darling, Dies at 85 http://t.co/O1LNoh408x","Former child actress Shirley Temple dies http://t.co/FitiRdITEH","BBC News - In Pictures: Shirley Temple http://t.co/RDPVebABdV","VIDEO: A look back at the life of Shirley Temple http://t.co/ToLbzob7R4","RT @UberFacts: Shirley Temple died last night at around 11PM. She was 85-years-old.","Celebrities react to Shirley Temple\u0027s death http://t.co/QdILQphTET","RT @MauricioUmansky: \"@baso_flor: @KyleRichards18  Very sad news about Shirley Temple, Portia\u0027s cute curls remind me of Shirley\u0027s.\" We alwa…","RT @eonline: Taylor Swift Chops Off Her Long Hair--See the Pic! (And Was She Inspired by Shirley Temple?) http://t.co/m8O0pPKxO4","#3: Little Princess: Little Princess Shirley Temple (Actor), Richard Greene (Actor), Walter Lang (Director), W... http://t.co/t9vONVHqqY","RT @DeborahClay: RT @BBCBreaking: Hollywood star Shirley Temple dies aged 85, her family says http://t.co/kaYB3ZCMke”","#4: Baby Take a Bow: Baby Take a Bow Shirley Temple (Actor), James Dunn (Actor), Harry Lachman (Director) | Ra... http://t.co/lSt9o2TLCw","RIP Shirley Temple. I always used to love watching The Saint when I was younger.","#5: Rebecca of Sunnybrook Farm: Rebecca of Sunnybrook Farm Shirley Temple (Actor), Randolph Scott (Actor), All... http://t.co/75LHR966XS","@360Magazine Shirley Temple an icon #RIP","Celebrities react to Shirley Temple\u0027s death http://t.co/iKjRUj0BtH","RT @taylorswift13: Sitting backstage at the O2 in London, thinking about what an impressive and extraordinary life Shirley Temple led. Than…","First Tado, then Justice Cuevas, then Roy Avarez and now Shirley Temple!! What\u0027s the world coming to???","RT @taylorswift13: Sitting backstage at the O2 in London, thinking about what an impressive and extraordinary life Shirley Temple led. Than…","RT @ZacharyGordon: \"Here\u0027s to Shirley Temple, I\u0027ve never met you, but I used to drink you...a lot\" -@devbostick","RT @MaraWritesStuff: Rest in peace, Shirley Temple. Thanks for proving we CAN turn out well.","Sick Jacqui. Today may be a day for a Shirley Temple marathon. #medicinal","RT @UberFacts: Shirley Temple died last night at around 11PM. She was 85-years-old.","Celebrities react to Shirley Temple\u0027s death LOS ANGELES (AP) — The praises of Shirley Temple are being sung by celebrities across Hollyw...","Photo: karrinainoregon: nprfreshair: \"Shirley Temple, who charmed the nation as a child movie star in the... http://t.co/2Hwg3E0YYK","VIDEO: A look back at the life of Shirley Temple http://t.co/YlHDqxccRd","RT @ravenhairgirl: Shirley Temple Black, Academy Award winning adorable child star and widely respected diplomat, sailed away on the Good S…","Any star can be devoured by human adoration, sparkle by sparkle.            Shirley Temple.","RT @EOnlineUK: .@justinbieber\u0027s waxwork is removed because fans won\u0027t stop groping it. http://t.co/r0HfKfLyke http://t.co/0AwDon6ZBH","The real cause of the death of Shirley Temple Black - exclusive: http://t.co/gFkPhub9Pm via @YouTube","The real cause of the death of Shirley Temple Black - exclusive: http://t.co/eYVXG5Djko via @YouTube","RT @JustReIatabIe: RIP to the lovely, talented, and sweet Shirley Temple. You will be missed!❤️ http://t.co/QEOqPIlUTc","RT @DrOz: My thoughts and prayers go out to the family of Shirley Temple. She was an amazing talent who brightened the lives of millions.","RT @TweetLikeAGirI: RIP to the lovely, talented, and sweet Shirley Temple. You will be missed!❤️ http://t.co/yo45E65BMJ","RIP Shirley Temple the best actress out there. Heavens gained a beautiful and talented angel. Good bye my role model","RT @Markesmith: Sad to hear about the passing of Shirley Temple. Big Fall fan. Very professional.","Shirley Temple Dead http://t.co/h3fGqknulr http://t.co/8H3aiM2biZ","Celebrities react to Shirley Temple\u0027s death http://t.co/5cJFJ4tGes via Yahoo!","Shirley Temple Black, Academy Award winning adorable child star and widely respected diplomat, sailed away on the Good Ship Lollipop. RIP","[ Other - News \u0026 Events ] Open Question : What do you think of Shirley Temple movie story? http://t.co/4LQzolcc2o","RT @AkumuFiona: Shirley Temple, America\u0027s dimpled child movie star dies at 85 Shirley Temple, who lifted America\u0027s spirits as a ... http://…","RT @SuziShumaker: Beloved Child Star Shirley Temple Black Dead at 85 http://t.co/Gmj8g0aqWJ via @patricksplace","RT @yokoono: When I was 3, I won a costume competition by being Shirley Temple. Bless you, Shirley! love yoko http://t.co/PmC8ijnseR","New post: Shirley Temple - My Mum\u0026#039;s favourite child star of yester year http://t.co/yW2yNrsiLT","Shirley Temple is the most recognisable child star in movie history for one reason . . . #RIPShirleyTemple http://t.co/MBkrWB9UHX","RT @sarahstringeruk: Had another fab lesson with @DanceStudioLeed , loved the Shirley Temple tap step!","[ Other - News \u0026 Events ] Open Question : What do you think of Shirley Temple movie story? http://t.co/LTc3P5YBnp","RT @Globalgallop: “@TroyBramston: This is pretty cool: Australian PM Joe Lyons with Shirley Temple in 1935. http://t.co/pb3tBzjGIU”","Shirley Temple Black, Screen Darling, Dies at 85 http://t.co/8PeLKUlOdP","RT @thisisnotp0rn: Shirley Temple presenting Walt Disney with a special Oscar for Snow White and the Seven Dwarfs, 1939. http://t.co/b6KyUW…","Before I wanted to be Stephanie Zanoni or Red Sonia, I wanted to be Shirley Temple, me and nearly every little... http://t.co/zq3USZDibS","Celebrities React to Shirley Temple\u0027s Death - ABC News http://t.co/RVYbRZfHpb","RT @taylorswift13: Sitting backstage at the O2 in London, thinking about what an impressive and extraordinary life Shirley Temple led. Than…","RT @BuzzFeed: The best Shirley Temple quote http://t.co/eOhkBs2J0Q","[ Other - News \u0026 Events ] Open Question : What do you think of Shirley Temple movie story? http://t.co/IvwCZQ3k0S","RT @katyperry: You were the original cherry on top Shirley Temple! Rest In Peace! 🍒","Article - Shirley Temple, iconic child star, dies at 85 http://t.co/0uYjblfTZy","Famed former child actress Shirley Temple dies -  (CNN) -- Shirley Temple Black, who rose to fame... http://t.co/YfYX9Y90c3\n #ShirleyTemple","Shirley Temple was born 9 says after my mother Lillian Morrison in 1928. My mum always spoke of the impact Shirley had on her age group.","[ Other - News \u0026 Events ] Open Question : What do you think of Shirley Temple movie story? http://t.co/fDBWQE0s16","RT @ZacharyGordon: \"Here\u0027s to Shirley Temple, I\u0027ve never met you, but I used to drink you...a lot\" -@devbostick","don\u0027t order a shirley temple today.","[ Other - News \u0026 Events ] Open Question : What do you think of Shirley Temple movie story? http://t.co/vZjAaKTuZY","RT @Tosinger: Any star can be devoured by human adoration, sparkle by sparkle - Shirley Temple","\"@YouknoDani: Did you guys know Shirley Temple passed away ?! 😱\"\n\nNot A Soul Cares","Celebrities pay tribute to Shirley Temple | http://t.co/SoueLVWRLr http://t.co/4zBzz5YgDo","RT @HistoryInPics: RIP Shirley Temple (1928 - 2014) http://t.co/KHnPMexatY","RT @taylorswift13: Sitting backstage at the O2 in London, thinking about what an impressive and extraordinary life Shirley Temple led. Than…","RT @katyperry: You were the original cherry on top Shirley Temple! Rest In Peace! 🍒","RT @katyperry: You were the original cherry on top Shirley Temple! Rest In Peace! 🍒","Famed star Shirley Temple dies at 85 -  For about 18 years, she sang, tap-danced and... http://t.co/CoKIVrETQa\n #boxoffice #ShirleyTemple","I just teared up at RIP SHIRLEY, thinking it was about Shirley MacLaine. Then I realized it was about Shirley Temple. Now I\u0027m going to bed.","RT @abcWNN: #BREAKING | Shirley Temple Black Dead at 85, @ABC News Confirms  http://t.co/U3byGiGSFK | http://t.co/fEuuIovz90","RT @gracels: RIP, Shirley Temple Black. A life well lived, a bringer of joy to many. \n\nAnd the cutest kid I ever saw.","RT @thisisnotp0rn: Shirley Temple presenting Walt Disney with a special Oscar for Snow White and the Seven Dwarfs, 1939. http://t.co/b6KyUW…","RT @cdancer2012: “@Madaboutpiano: @regan_lisa :\u0027( Dancing her way to heaven I hope” RIP Shirley Temple","Changed my lock screen wallpaper to Shirley Temple. http://t.co/eoE2XUZ7NO","RIP Shirley Temple xx @ TNL HQ http://t.co/bYzfFZSYSC","#salute to one of the best! I absolutely 💚 her! Who didn\u0027t want to be Shirley Temple!? One of the best… http://t.co/3yEoc3Uw8l","RT @katyperry: You were the original cherry on top Shirley Temple! Rest In Peace! 🍒","RT @totalfilm: We\u0027re sad to say that child star Shirley Temple has died, aged 85: http://t.co/5vN2EsnQ42 http://t.co/GWApsUUv55","RT @Filmbaseuk: Farewell to Shirley Temple - the original child star  http://t.co/tAZZZuA9yq via @MetroUK","RT @onherperiod: RIP to the lovely, talented, and sweet Shirley Temple. You will be missed!❤️ http://t.co/lncNxob8TG","RT @OMGFacts: After being an actress, Shirley Temple served as the US Ambassador to Ghana and Czechoslovakia. RIP. http://t.co/V1KmR1oYjC","RT @TweetLikeJen: RIP to the lovely, talented, and sweet Shirley Temple. You will be missed! http://t.co/Ynbcj6tZbI","RT @ABC7News: BREAKING: Actress and child star Shirley Temple has died. She was 85 years old. http://t.co/o1ZeV46gpx http://t.co/0wlJ0pLQwx","RT @CauseWereClassy: RIP to the amazing Shirley Temple 💔 http://t.co/Un4tuJrCkD","RT @ItsReginaG: RIP to the lovely, talented, and sweet Shirley Temple. You will be missed!❤️ http://t.co/1nxD4y5Fhb","Rip Shirley Temple💕💕","RT @katyperry: You were the original cherry on top Shirley Temple! Rest In Peace! 🍒","RT @Jane_L_Kennedy: My childhood is officially over. Shirley Temple has died aged 85. Vale. Here\u0027s my favorite scene. Ever. http://t.co/UQQ…","RT @katyperry: You were the original cherry on top Shirley Temple! Rest In Peace! 🍒","AUS » NEWS » http://t.co/WPRSGrrc8H HOT NEWS 590 Shirley Temple Shirley Temple Black dead at 85 mahomiebeat New South Wales AUS Wollongong …","Beloved Child Star Shirley Temple Black Dead at 85 http://t.co/Gmj8g0aqWJ via @patricksplace","RT @pjhelliar: Shirley Temple has died. When will these child stars learn they don\u0027t live forever.","TCM to air tribute to Shirley Temple Black http://t.co/auXgNYba6R","Shirley Temple presenting an award to Walt Disney in 1939 http://t.co/HeLJHuUlx3","RT @BBCBreaking: Obituary: Shirley Temple, Hollywood child star turned US Ambassador, who has died aged 85 http://t.co/ZVMtAS5wpg http://t.…","Shirley Temple Black, child star who became diplomat, dies at 85 http://t.co/zhq7wTR0zl","Awe bummer, Shirley Temple died :(","RT @sagaftra: SAG-AFTRA Celebrates the Life of Shirley Temple Black.\nhttp://t.co/TmgMx5Bq7q","Shirley Temple presenting Walt Disney with a special Oscar for Snow White and the Seven Dwarfs, 1939. http://t.co/b6KyUWMsGM","RT @UsVsTh3m: A parody Twitter account tricked The Guardian into claiming Shirley Temple was a big fan of post-punk band The Fall http://t.…","RT @yokoono: When I was 3, I won a costume competition by being Shirley Temple. Bless you, Shirley! love yoko http://t.co/PmC8ijnseR","Celebrities react to Shirley Temple\u0027s death: The praises of Shirley Temple are being sung by... http://t.co/CK9z2DgQtx #Chicago #News","RT @taylorswift13: Sitting backstage at the O2 in London, thinking about what an impressive and extraordinary life Shirley Temple led. Than…","aww. @tcm already has their \"windshield wipers\" tribute to Shirley Temple up. :\u0027( Join them March 9th for a marathon of Shirley\u0027s films!","RT @yokoono: When I was 3, I won a costume competition by being Shirley Temple. Bless you, Shirley! love yoko http://t.co/PmC8ijnseR","RT @BuzzFeed: The best Shirley Temple quote http://t.co/eOhkBs2J0Q","Thank You, Shirley Temple, For The Original \u0027Mocktail\u0027 http://t.co/4zyIWpPKKc","RT @mattstevensloop: So Shirley Temple\u0027s daughter did play bass in The Melvins.","By Gopi Chandra Kharel Shirley Temple’s wavy locks are one of most coveted hairstyles, even… http://t.co/3Vsa1G4Ron","Shirley Temple Black died today, and with her, her horrible culinary creations. Animal crackers in soup? Gross.","Shirley Temple - On The Good Ship Lollipop","RT @taylorswift13: Sitting backstage at the O2 in London, thinking about what an impressive and extraordinary life Shirley Temple led. Than…","RT @TheTweetOfGod: RIP Shirley Temple, who paved the way for hundreds of other child stars, except for the part where she grew up and had a…","\"There\u0027s nothing like real love,nothing\"-Shirley temple","Rest in peace Shirley Temple - The greatest child star that ever lived! I hope Walt welcomed you to heaven #WaltDiseny #ShirleyTemple","RT @katyperry: You were the original cherry on top Shirley Temple! Rest In Peace! 🍒","RT @globeandmail: Shirley Temple, former Hollywood child star, dies at 85 http://t.co/XW3qsZ4S8j http://t.co/SAmA2YKIQB","Shirley Temple, America\u0027s dimpled child movie star dies at 85 Shirley Temple, who lifted America\u0027s spirits as a ... http://t.co/KrERKs8E4T","Foto: filmcityworld: here a drawing of Shirley Temple that mj made http://t.co/TIv9k2o5JE","RT @WorldPTV: Famous Hollywood child star Shirley Temple Black, who won academy at age 6 died at the age of 85.","RT @WhoopiGoldberg: The Good Ship Lollypop has sailed today with Shirley Temple aboard a true 1 of a kind. If you don\u0027t know her.. google o…","RT @UsVsTh3m: A parody Twitter account tricked The Guardian into claiming Shirley Temple was a big fan of post-punk band The Fall http://t.…","RIP Shirley Temple","RIP Shirley Temple! \n\nWe love you! http://t.co/70NJanXZQ2","RT @wellbelove: RIP Shirley Temple http://t.co/5yJw0hFusl http://t.co/JxBpEroDiJ","Wait wait wait did Shirley Temple die","RT @TheAcademy: Shirley Temple in 1939 presenting Walt Disney with a Special Award and seven miniature statuettes at… http://t.co/8ZKjxp29gt","RT @20thcenturyfox: We remember a woman whose achievements reached far beyond her Hollywood career.  http://t.co/MvxzruF7Vx http://t.co/rlp…","Celebrities React To Shirley Temple’s Death http://t.co/L9UMF60rM1","RIP Shirley Temple #idol","RT @VictoriaJustice: #RIP Shirley Temple... Such an adorable \u0026 talented icon. Animal crackers in my soup will never get… http://t.co/Xzrav0…","RT @HistoryInPics: RIP Shirley Temple (1928 - 2014) http://t.co/KHnPMexatY","RT @Markesmith: Sad to hear about the passing of Shirley Temple. Big Fall fan. Very professional.","“@MsLeaSalonga: RIP, Shirley Temple-Black. Sigh...” \u003d(","RT @10NewsKTEN: Former child actress Shirley Temple has died. She was 85 years old. http://t.co/tH14N5f6SH http://t.co/XPuSCtvsIe","Johnny Weir, Shirley Temple, Shaun White, Tom Brokaw, ... http://t.co/xiVHLGsaHR http://t.co/wdUgjnz6AB","Popular on Google: * Johnny Weir * Shirley Temple * Shaun White * Tom Brokaw * Bruce Jenner * Graco recall *... http://t.co/t8U1c8Afm7","Shirley Temple doll wearing Bright Eyes costume. http://t.co/GMcqjP77n6","Finalmente RT @metalinsider: Dale Crover of @melvinsdotcom remembers Shirley Temple, whose daughter was their bassist http://t.co/aRV3zCGTqe","R.I.P shirley temple, you\u0027ll be greatly missed:(","RT @flavorwire: That Time Nine-Year-Old Shirley Temple Got Slut-Shamed by Graham Greene http://t.co/7rvWWFD2Ew","RT @taylorswift13: Sitting backstage at the O2 in London, thinking about what an impressive and extraordinary life Shirley Temple led. Than…","Celebrities react to Shirley Temple\u0027s death http://t.co/KUeOeyOQ5z","RT @IAmAStove: Shirley Temple Black dies in the midst of Black History Month. there is a joke there, somewhere.","I can\u0027t believe Shirley Temple died...I grew up watching her movies and have always adored her. She was the cutest thing in the world! RIP","I can\u0027t talk tho cus I lives my whole life thinking Shirley Temple died before I was born and she died today smh","RT @JudyEGarland: Judy with the iconic Shirley Temple and the amazing Mickey Rooney. #judygarland #shirleytemple… http://t.co/StHwWt6NT4","Shirley temple was still alive?","Photoset: RIP Shirley Temple Black (April 23, 1928 – February 10, 2014) http://t.co/JA5eSgmBai","RIP to the beautiful, talented, and sweet Shirley Temple. You will be very dearly missed! http://t.co/8VGImpTe1R","RT @TheTweetOfGod: RIP Shirley Temple, who paved the way for hundreds of other child stars, except for the part where she grew up and had a…","RT @Camera360: R.I.P.  Shirley Temple http://t.co/mSr9GxeiuV","RT @KellyBlum: Rest in peace Shirley Temple","RT @SquawkStreet: Iconic child star Shirley Temple dies at 85 http://t.co/E6ECLMQ0hC http://t.co/r1zXH9uMEi","RT @matchewpwoffitt: Can we appreciate Shirley temple in her young adult years? I feel like it\u0027s under appreciated. #stunna http://t.co/M62…","RIP Shirley Temple http://t.co/bVRmMRWnG5"],"id":11,"autoSummary":"Celebrities react to Shirley Temple\u0027s death: The praises of Shirley Temple are being sung by... http://t.co/CK9z2DgQtx #Chicago #News"}}