{"14":{"topic":"sochi","tweets":["I think its snowed more here than in Sochi","white supremacy obama dyess air force base subway join http://t.co/TSVylKFYP8","SOCHI 2014 WINTER OLYMPICS: PHOTO OF THE DAY\n\nJoin us at http://t.co/1wooEWZuo9 \n\nBritain’s Katie... http://t.co/Cel64wuigu","#stripforjackie  We would be proud to have a positive icon at Sochi.\nTarek abou zeinab http://t.co/wl5bByvtgY","No Silver Medal but Two Skiers Share Gold in Women\u0027s Downhill  http://t.co/q3DyVU8WGl","Ted Ligety’s Unique Giant Slalom http://t.co/dHh3zvX1Gs","What happens when Games leave town? http://t.co/naVIvgvdw4","@AP Congrats folks for having the courage to go to Sochi despite the terror threats.","RT @cmassons: That\u0027s the SPORT!! 2014 #Sochi2014 Winter Olympics, Part I - http://t.co/Gc8JuuBhDW","Petter made a bet that he would retire if Emil won a gold in Sochi. 😆😭😂 #Sochi","Photo: teamjrcelski: 12 Daredevil U.S. Olympians to Watch at Sochi J.R. Celski Sport: Short track speed... http://t.co/pSYmRV208j","RT @NBCSports: WATCH: Revisit the best performances by American athletes from Day 4 of the #Sochi #Olympics http://t.co/12b44e3GGL http://t…","#Sochi hot tub party http://t.co/jvL0B5whN9",".@FOXSportsLive\u0027s @fs1otoole has been experiencing the local cuisine in Sochi. \n\nSome has gone better than others. http://t.co/ozmFAPwC3v","RT @badsandwich: The #Sochi Olympics are a lot like what I imagine the Olympics would be like if they were hosted by the gathering of the j…","RT @olympiccouncil: Olympic 15km Classic Cross Country  - http://t.co/RYdCvt0kAl","WATCH: Revisit the best performances by American athletes from Day 4 of the #Sochi #Olympics http://t.co/3unsJ9xpuL  http://t.co/2MjrPVydzP","RT @Sina_86: Sochi 2014: 10 amazing helmet designs at the Winter Olympics – in pictures http://t.co/VlUs31xW4J via @guardian","RT @StickmanSport: ******FREE SHIPPING ON ALL ORDERS***** #Sochi special","Billy Bush and Al Michaels – Sochi Olympic Update http://t.co/8UnCVCng37","RT @MyfWarhurst: Spoke to @theprojecttv tonight about climbing ski jump at #Sochi. This is what I saw. When I opened my eyes. Once. http://…","Well done @ChemmySki. Top 20 finish an awesome result. #sochi","Green spring 2014: Stella McCartney tennis fashion: While Maria Kirilenko is in Sochi watching figure skating ... http://t.co/4hQ4pHBXIK","Simple, clear, effective: this Audi #copy is absolutely stunning #Sochi via @AdFreak http://t.co/UFWdrpnHtc http://t.co/EcZtswBiaS","Corruption sting follows Indian athletes to Sochi: NEW DELHI (AP) — The taint of corruption… http://t.co/AM8FhDl8CH",",Countdown To Sochi: Will The City Be Ready? http://t.co/6XOjowtaTJ","What happens when Games leave town? http://t.co/1VUZNUwmnC","RT @CharlesRobinson: Seriously, I have no idea why I\u0027d trust the Russian stat guys in Sochi. I must be out of my mind.","@SochiFans Do you have a picture of Latvia fans at Sochi?","Anyone else watching #sochi Ice Hockey on @channel10 quietly singing Monty Pythons \"Finland, Finland, Finland...\"?","Maze, Gisin tie for gold in women\u0027s downhill: In a rare tie in Alpine skiing, Tina Maze of Slovenia and Domini... http://t.co/d55NSec3Le","RT @HuffingtonPost: A luger in #Sochi strapped a GoPro on his helmet to make this awesome video http://t.co/J96Huzi4pt","RT @USATODAYsports: Tina Maze, Dominique Gisin tie for women\u0027s downhill gold: http://t.co/XAStqWE6G1","RT @NBCSports: WATCH: Revisit the best performances by American athletes from Day 4 of the #Sochi #Olympics http://t.co/12b44e3GGL http://t…","@MarkHoward03 looking to pre program the judges scores from inside judge booth at sochi #getbeggsmithonthejob http://t.co/G9Y869NgEe","Digits: We test out dating apps, review \u0027Final Fantasy XIII\u0027 and search for Sochi problems http://t.co/7Jtf5Q93Fy","RT @RT_com: AMAZING PHOTO: #Sochi Olympic Park as seen from #ISS - via @NASA http://t.co/h5ls9MyWEK http://t.co/xEpRxf3rP9","Beer Fridge Cheers Canadian Olympians at Sochi http://t.co/l5cZXugsj3 via @TIMEWorld","Jason Jones Live From Sochi-ish: Commie Dearest | Comedy Central - Yahoo Screen http://t.co/abyeh57AWv via @Yahoo","Some awesome photos from Sochi\nPhoto Gallery: Day 4 http://t.co/g8AxN4Mewd","Switzerland\u0027s Dominique Gisin reacts after finishing the women\u0027s downhill the Sochi 2014 Winter Olympics, Wednesd... http://t.co/7Qo0f7cu6x","United States\u0027 Jacqueline Wiles finishes in the women\u0027s downhill at the Sochi 2014 Winter Olympics, Wednesday, Fe... http://t.co/KZmwy11c6L","I support Michael Christian MARTINEZ at Winter Games 2014 in Sochi!","RT @WSJeurope: Images of #Sochi2014 from space: http://t.co/r4cDejE6fU (NASA) http://t.co/nhZr5wuzoK","Slovenia\u0027s Tina Maze makes a turn as she nears the finish in the women\u0027s downhill at the Sochi 2014 Winter Olympi... http://t.co/bqOGWQjBsg","Germany\u0027s Maria Hoefl-Riesch looks up from the finish area after competing in the women\u0027s downhill at the Sochi 2... http://t.co/m3rbtgGXSp","RT @xxxriainxxx: How Sochi Opening Ceremony became a Pride Parade. http://t.co/SKFByp8Klt","RT @UNICEF: #LGBT youth are at higher risk of violence \u0026 suicide, which is why Ban Ki-moon’s words are so important #Sochi http://t.co/JKVi…","Britain\u0027s Chemmy Alcott smiles after finishing the women\u0027s downhill at the Sochi 2014 Winter Olympics, Wednesday,... http://t.co/bYSCI5nGaX","Switzerland\u0027s Lara Gut reacts after finishing the women\u0027s downhill at the Sochi 2014 Winter Olympics, Wednesday, ... http://t.co/BWr0zu8aKr","Condemn Sochi for Mass Killing of Stray Dogs - ForceChange http://t.co/fa1w7mC2LC","RT @CharlesRobinson: The gold medal tie in women\u0027s downhill skiing in Sochi is the first timed-event gold tie in the 90-year history of the…","Sarah Palin must be happy the Olympics are in Sochi Source: http://t.co/CNv9uInO9q","RT @KirstenHenry: Volunteers smuggle Sochi dogs out of town to save from being killed:\nhttp://t.co/nsxRkbTjCo\n\n#sochidogs","So it appears @nytimes has a nice touch for short visual stories about winter olympic sports. http://t.co/Y8WZpiTv4H\nThanks @mbostock !","Images of #Sochi2014 from space: http://t.co/r4cDejE6fU (NASA) http://t.co/nhZr5wuzoK","Slovenia\u0027s Tina Maze kisses the snow after finishing the women\u0027s downhill at the Sochi 2014 Winter Olympics, Wedn... http://t.co/QpdPXSeDbL","Italy\u0027s Verena Stuffer smiles after finishing the women\u0027s downhill at the Sochi 2014 Winter Olympics, Wednesday, ... http://t.co/CO1vZuMgab","RT @KhaledTalib: To the volunteers who smuggle those dogs out of Sochi, you guys are magnificent!","Corruption sting follows Indian athletes to Sochi http://t.co/C9G3KiMVCE","Corruption sting follows Indian athletes to Sochi The Associated Press http://t.co/Pot159plxC","RT @NoSochi2014: In Dutch newspaper Parool on February 6, about Circassians and Sochi.\n\nTranslation of the article:\n\nAccording to... http:/…","RT @KDPomp: Womens hockey between USA and Canada in Sochi will be intense. Last time they met, a brawl broke out. Anxious to watch","Tina Maze, Dominique Gisin tie for women\u0027s downhill gold: http://t.co/XAStqWE6G1","RT @cbccolleenjones: There are 8 men swimming in Sochi in numb your feet kind of water.Give them a medal @CBCOlympics http://t.co/o2IWn5RZz1","#Sochi you are still a hero Shaun","RT @JerseySurf: Acceptable reasons to be awake right now: 1. West coast USA. 2. Olympian in Sochi. 3.  European 4. College student pulling …","ESPN: Tie for gold a first in alpine  http://t.co/82PsR8Eesp","Sochi: Paradise lost?: More than $50 billion has been spent in reshaping Sochi for the Winter Olympics, in the... http://t.co/UKE4dPfEiO","RT @guardian: The Sochi stray dog dilemma: does the world care more about Russia\u0027s animals than humans? http://t.co/cIdVXuT0YI @guardian_sp…","WATCH: Revisit the best performances by American athletes from Day 4 of the #Sochi #Olympics http://t.co/12b44e3GGL http://t.co/LVgsh5f6I8","How darn good are the ice hockey girls. #Sochi","RT @CharlesRobinson: Seriously, I have no idea why I\u0027d trust the Russian stat guys in Sochi. I must be out of my mind.","#SOCHI2014: Live visualization of the most shared photos on Twitter http://t.co/GVzuglVA9p #interactive via @TwitterData","So amazing to see Sarah soar! Sochi http://t.co/2Vw93Agh0u #KelloggsChampions #ad","RT @TimesLIVE: Sochi as gay as Cape Town http://t.co/srmyBuaf6a \"Sochi was the unofficial gay capital of the Soviet Union.\" #ToThePoint","RT @NBCSports: Tina Maze \u0026 Dominique Gisin make Olympic history by tying for gold medal in women\u0027s downhill! http://t.co/PJJ3dj4Nam http://…","RT @theinquisitr: #Sochi Fisht Stadium seen at  night from space on #ISS via  @NASA_Johnson http://t.co/03i3a6p5ML - @HuffPostUKPics","RT @DesignTimes: See the entire halfpipe run that beat Shaun White — all in one picture #Sochi http://t.co/pWdJGYbF7O","Tell the IOC there should never be cruelty under its watch again after the Sochi street dog cull.  http://t.co/qLl6QCcmX5 via @HSIGlobal","RT @MyfWarhurst: Spoke to @theprojecttv tonight about climbing ski jump at #Sochi. This is what I saw. When I opened my eyes. Once. http://…","RT @globalvoices: Russia\u0027s Patriotic Overdrive in #Sochi? (@runetecho) http://t.co/e9IMNoj6yV \"anyone toying with the WWII narrative better…","Can you imagine if the beam was different every time you competed? This half pipe situation is so sad. #sochi #halfpipe","In Sochi, the issue is stray dogs.\nIn Pyeongchang, host of the 2018 Games, the focus will be dog meat.\n@AlastairGale\nhttp://t.co/5LBPay1CUt","RT @PhoenixRises69: My mom eloquently summed up the spirit of the Sochi Winter Olympics, when she said...\n\n\"Ooh, it looks cold. I hope they…","Sarah Palin must be happy the Olympics are in Sochi http://t.co/XonBS6yi0r #uk #unitedingdom","RT @RT_com: AMAZING PHOTO: #Sochi Olympic Park as seen from #ISS - via @NASA http://t.co/h5ls9MyWEK http://t.co/xEpRxf3rP9","RT @alecsbains: There\u0027s a beer fridge at Sochi that only opens with a Canadian passport http://t.co/1rwceouy24","Tahoe City’s “Tahoe House” coffee honored at Sochi Winter Olympics http://t.co/36dX4UIUOw #scpick","Historic women\u0027s downhill, a tie at the top. http://t.co/yL7D5WXk7Z","Nose so big, niggas snowboard down it #sochi","i-rena: Sochi 2014: 10 amazing helmet designs at the Winte... http://t.co/f4rrvyPw7H","Swiss day at Sochi! Congratulations Dominique Gisin and Lata Gut!!!","RT @KirstenHenry: Volunteers smuggle Sochi dogs out of town to save from being killed:\nhttp://t.co/nsxRkbTjCo\n\n#sochidogs","RT @AdventureSlo: And we have GOLD medal in Sochi in downhill skiing. Congratulations to Tina Maze. We get medals everyday. Small... http:/…","P\u0026G Thank You, Mom | Pick Them Back Up | Sochi 2014 Olympic Winter Games: http://t.co/k0mumyT3rL @youtube #Sochi2014 #BecauseOfMom","RT @theinquisitr: #Sochi Fisht Stadium seen at  night from space on #ISS via  @NASA_Johnson http://t.co/03i3a6p5ML - @HuffPostUKPics","RT @disturbmedia: My fave skeleton helmet from #Sochi2014 More here: http://t.co/hiapxWB6UF http://t.co/vKj0XeZKww","RT @UNICEF: #LGBT youth are at higher risk of violence \u0026 suicide, which is why Ban Ki-moon’s words are so important #Sochi http://t.co/JKVi…","RT @TheOffsideRules: Johnny Weir is a walking middle finger on the streets of Sochi today. An American hero. http://t.co/x43zbneCb0","Seriously, I have no idea why I\u0027d trust the Russian stat guys in Sochi. I must be out of my mind.","There’s a fridge in Sochi that only opens with a Canadian passport: http://t.co/eR6NonqZHx","http://t.co/7Avr77P1NX I cannot believe what I\u0027m reading. This is appalling #SochiProblems #seriousproblems","RT @RT_com: AMAZING PHOTO: #Sochi Olympic Park as seen from #ISS - via @NASA http://t.co/h5ls9MyWEK http://t.co/xEpRxf3rP9","RT @UNICEF: #LGBT youth are at higher risk of violence \u0026 suicide, which is why Ban Ki-moon’s words are so important #Sochi http://t.co/JKVi…","RT @GPinLV: Our Winter climate here is significantly colder than #Sochi so let me be the first to propose #CharlestonSC as host for #Winter…","RT @nytimes: 12 Olympic athletes to watch at the Sochi games http://t.co/FfyLrxNINA","Sochi Olympic Park Viewed From the International Space Station - An Expedition 38 crew member aboard the #ISS too... http://t.co/Enzq801PG1","RT @UNICEF: #LGBT youth are at higher risk of violence \u0026 suicide, which is why Ban Ki-moon’s words are so important #Sochi http://t.co/JKVi…","RT @pennymeigh: Sochi greenest Olympics ever? Unfortunately anything but... http://t.co/3EakNhR2YN via @TravelMole","RT @TimesLIVE: Sochi as gay as Cape Town http://t.co/srmyBuaf6a \"Sochi was the unofficial gay capital of the Soviet Union.\" #ToThePoint","RT @alixkenz: Guy at training watching me throw- \"did you get sent home from Sochi?\". Told him \"wrong Olympics mate\", like the legend I am.","Whatever team you play for... http://t.co/9qpjbW7QgI","American snowboarder Shaun White loses to Switzerland Podladtchikov for the halfpipe title in Sochi. #olympris http://t.co/5iPeOhVmFY","Them go \"sochima\" their broda house \"@shoucudozeeye: Nigerians no go sochi sef?\"","Sochi 2014: 10 amazing helmet designs at the Winter Olympics - in pictures\n\nhttp://t.co/JBFMB2rAqc","Sochi is getting so much hate lol","Brrrrr. Hong Kong Is Colder Than Sochi, Site of 2014 Olympics - China Real Time Report - WSJ http://t.co/wjILuJQch1 via @WSJ","RT @sarahward: Man on fire! Tatsuki Machida literally defies gravity. #figureskating #Sochi","RT @BrianneMcL: Beautiful day in sochi! And it\u0027s GAME DAYY vs canada! Our favorite :) @usahockey #Sochi2014 http://t.co/eESq669aor","RT @HuffingtonPost: This Olympic skier surfs in Maui, wins medals at Sochi, and beats all of us at life http://t.co/Y6QP4RivbT","RT @cbccolleenjones There are 8 men swimming in Sochi in numb your feet kind of water.Give them a medal @CBCOlympics http://t.co/V1pSoZgS2k","RT @LypstickJungle: My favorite winter sport is wine drinking.#Sochi","Breaking-Sochi Oly: Tina Maze of Slovenia \u0026 Dominique Gisin of Switzerland tie for Gold Medal in the Women’s Downhill.First tie since 1998.","GOLD medal for Slovenia in Sochi!! Congrats to Tina Maze!! #slochi","RT @GMA: Yes, @guskenworthy, bring us all the #Sochi puppies you can find: http://t.co/VHNIYv3UGs http://t.co/zKDBsTxn5v","Live Winter Olympics action on our big screen right now! Come down, plus we\u0027ll have live bingo at 11.30am, cash prizes available. #sochi","RT @plosblogs: Behold! The awe-inspiring beauty of the Canadian #skeleton team’s helmets! via @daniel_lende http://t.co/MKYUEG8bIO http://t…","RT @NoSochi2014: In Dutch newspaper Parool on February 6, about Circassians and Sochi.\n\nTranslation of the article:\n\nAccording to... http:/…","RT @CNNYourMoney: Get ready for the men\u0027s halfpipe final today by watching the business of being Shaun White http://t.co/Rqi2NnJBjw #sochi","@lindseyvonn sad you cannot compete in #sochi Hope many competitions ahead, if not you are still champ, had amazing career #thumbsup","That\u0027s the SPORT!! 2014 #Sochi2014 Winter Olympics, Part I - http://t.co/Gc8JuuBhDW","RT @STARZYahoo: Sochi Olympics from space pic @graceslick77 @bleu_ruby @lindasue0818 @kaysm522 @hiitsmecarol @Oreilly1Peter @12_jena http:/…","#DBRYDAILY MMXIV DISC 1 \n\n[Instrumental]  Neon Lights (Celebration) \n\nhttp://t.co/OpCU97XEFe #sochi #sochi2014","RT @NBCSports: Tina Maze \u0026 Dominique Gisin make Olympic history by tying for gold medal in women\u0027s downhill! http://t.co/PJJ3dj4Nam http://…","Fans Enjoy The Atmosphere At Sochi 2014: A Norwegian fan dressed as a viking smiles ahead of the medal ceremony http://t.co/26hStnSrLl","RT @zbleumoon: 💜 💜 💜 💜 💜 💜 💜 💜 💜 💜 💜 💜 💜 💜 💜 💜 💜 \n#HELP 2000 Stray #DOGS \u0026 #CATS at Olympics!    \nQuick Sign http://t.co/yrJ6FnuVs9  http:/…","Photographing #Sochi2014 with #Getty\n http://t.co/E7kK2BxLnG","RT @BBCSochiTrolley: How do I sleep through the cold Sochi nights? Personally, I prefer spooning with a cuddle :-) #sochitrolley http://t.c…","Dominique Gisin - Downhill Sochi Goldmedal Winner - Wallpapers - Wide x 4: Posted by Agnes:     http://t.co/SjNcjNnV2O","Lara Gut - Wallpapers Sochi Downhill - Wide - x 3: Posted by Agnes:   http://t.co/naveTrjDIk","Dominique Gisin, Lara Gut and Nicole Hosp - Sochi Downhill - Pics x 12 lq: Posted by theOguy:\noutstanding!!   http://t.co/PuexuJZhZQ","RT @MarkWellington6: One tester also collected urine in wrong container. Random or convenient testing? Wonder if Maria was tested in Sochi?…","Photoset: kaner-con-queso: psymcdingo: Looks like Sochi is ready for the Olympics Part II Part I Source... http://t.co/WjAulnRHFg","Over the Boards: Subban set to do whatever it takes: SOCHI -- P.K. Subban might be the next Drew Dought... http://t.co/rK06Bl18WI - #NHL","RT @cotsonika: Bumped into Chris Chelios, who is in Sochi working for Fox Sports. I told him I was headed to Team Canada\u0027s practice. His re…","RT @YahooSports: Shaun White shows disappointment after failing to medal. http://t.co/suHynndUDO #Sochi2014 http://t.co/vcECOPQfBo","RT @cbccolleenjones: There are 8 men swimming in Sochi in numb your feet kind of water.Give them a medal @CBCOlympics http://t.co/o2IWn5RZz1","RT @filmonlive: Sochi 2014: The 7 essential extreme skiing movies http://t.co/ecurnjA6hN","Corruption Sting Follows Indian Athletes to Sochi: India snafu at Sochi stings athletes, but little outrage ba... http://t.co/S4SExbWMoh","Sochi’s Empty Seats Difficult to Ignore http://t.co/pWwPZviFKC","Love love love, the giant screen behind/on top of halfpipe. It\u0027s so Hunger Games / Goblet of Fire. #sochi #halftimeshow","RT @UNICEF: #LGBT youth are at higher risk of violence \u0026 suicide, which is why Ban Ki-moon’s words are so important #Sochi http://t.co/JKVi…","RT @BreakingNews: Women\u0027s downhill alpine skiing event concludes in Sochi; for results: https://t.co/FOV7HUv3NB","\u0027Fridgescimination\u0027: This Beer Fridge Only Opens For Canadians.\nIf you\u0027re in Sochi right now, better make some... http://t.co/89I2OIiQFr","Sochi realization: Shaun White is too old. \nWtf does that mean for me?","RT @KarlreMarks: There\u0027s a special event this year in Sochi, skiing down to the waterfront and then swimming. The Lebanese team is expected…","RT @UNICEF: #LGBT youth are at higher risk of violence \u0026 suicide, which is why Ban Ki-moon’s words are so important #Sochi http://t.co/JKVi…","RT @emilieautumn: RT @Salon: The biggest Sochi scandal no one\u0027s talking about http://t.co/4336f5IbYQ","ESPN: Tie for gold a first in alpine  http://t.co/7ISy1yLwZK","@BillyBush @liveAccess from #Sochi w/ #AlMichaels?  Is that a heart shaped #tat?\nTake a listen @WGNRadio http://t.co/w6QNEhoRg0","RT @BBCSochiTrolley: Brrrrrr!!! It\u0027s a cold day in Sochi! Anyone fancy making me a brew? :-) (one sugar please) #sochitrolley http://t.co/J…","Sochi 2014: Slopestyle opening day overshadowed by Shaun White... http://t.co/AwwsdolRlt\n #AmericansJamieAnderson #KarlyShorr #ShaunWhite","Favorite thing I’ve seen about Sochi14 lololol http://t.co/QadVLJlIXP","Me up with Alex Bilodeau who calls brother Frederic his \"inspiration.\" Check it out in Yahoo Sochi Minute @michfarr http://t.co/M3WV5j6p0W","RT @StayPuft: The Ghostbusters are currently investigating the Sochi water supply. And you will not believe what they found. http://t.co/GO…",",Tight security at Sochi Olympics gives sense of comfort http://t.co/VYBWRtmpOy","RT @rikwalters: 10% Of Sochi U.S. Olympic Athletes Hail From One Utah College  http://t.co/L7dUAGQXLT","RT @FreedmanDennis: I now get to watch downhill skiers at both Sochi and centurion.","(#DmArgeniis_x3) Corruption Sting Follows Indian Athletes to Sochi: India snafu at Sochi stin... http://t.co/Qu2qLVNhUQ (#DmArgeniis_x3)","RT @AP: PHOTO: France\u0027s Marie Marchand-Arvier crashes into safety netting during women\u0027s downhill at #Sochi2014 games: http://t.co/ZmO4Q6sv…","The Winter Olympics are boring apart from the Ice Sochi games","Corruption Sting Follows Indian Athletes to Sochi http://t.co/pPb6Pg9BD1","@thelnino25 hey nino just wanted to say thanks for a great game against Nashville the other night! Good luck in Sochi #numberonewildfan","RT @NASA_Johnson: Dramatic photo taken by the ISS crew showing #Sochi Olympic Park. Fisht Stadium and the flame are visible. http://t.co/2v…","WOW! Just watched the women\u0027s downhill live from Sochi! Not giving anything away, but it is a must watch!!","A 150 years ago, #Sochi was the site of a horrific ethnic cleansing http://t.co/EHwoUOhdxY","RT @sportingnews: Shaun White brings us the #Sochi2014 photo of the day - http://t.co/ZHXz6P5l6z http://t.co/KuqGm32Erl","RT @DepressedDarth: I\u0027m in Sochi #Olympics2014 http://t.co/FPbx75EmKE","And we have GOLD medal in Sochi in downhill skiing. Congratulations to Tina Maze. We get medals everyday. Small... http://t.co/cslkPDK7lz","RT @lilkuo: Yesterday, Hong Kong was colder than Sochi. http://t.co/LENpRxwfIE http://t.co/49jc2Jd9AB","16 Things Johnny Weir Has Looked Like During His Time In Sochi http://t.co/fDEx2SeRpz","Corruption Sting Follows Indian Athletes to Sochi: India snafu at Sochi stings athletes, but little outrage ba... http://t.co/oX205QjU6l","get it, like Sochi but I said \u0027Sochill\u0027 aha a haha hah ahhah","Corruption Sting Follows Indian Athletes to Sochi: India snafu at Sochi stings athletes, but little outrage ba... http://t.co/nsZYJSWNWG","So happy for @dominiquegisin. If I had to choose ONE athlete to win a medal in #Sochi, it was Domi. I still can\u0027t believe it #Sochi2014","#FlakoBoow: Corruption Sting Follows Indian Athletes to Sochi: India snafu at Sochi stings athletes, but littl... http://t.co/KTpsMNgaJp","Corruption Sting Follows Indian Athletes to Sochi: India snafu at Sochi stings athletes, but little outrage ba... http://t.co/KTpsMMY1vh","#Team_WeyFlakoo: Corruption Sting Follows Indian Athletes to Sochi: India snafu at Sochi stings athletes, but ... http://t.co/wA8vEDYUa6","Corruption Sting Follows Indian Athletes to Sochi: India snafu at Sochi stings athletes, but little outrage ba... http://t.co/QNJl3QnIHj","RT @PhoenixRises69: Allow your hamster to enjoy the spirit of the Sochi Winter Olympics, by crafting him an awesome luge from guttering and…","Corruption sting follows Indian athletes to Sochi http://t.co/kpZJkVkXJG","RT @WIRED: The weirdest thing in Sochi? Your face on a giant screen of morphing pistons http://t.co/kpE7el78tE http://t.co/r7we0VkrCW","RT @USOlympic: With a bronze, @erinhamlin is the 1st ever U.S. #Olympic medalist in singles #luge! http://t.co/RoOuuedXQe #GoTeamUSA http:/…","RT @Molson_Canadian: Spotted! The beer fridge in Canada Olympic House in #Sochi #wearewinter http://t.co/E3hMUTtQRt","@rocketdryer in #sochi . What a stunning morning here.. 10 degrees in a hockey jersey and running shoes!  Life is... http://t.co/bxV65QLDwS","@thelnino25 are you and mark streit gonna get it done in Sochi?","New post: Sochi\u0026#039;s lonely protester http://t.co/I1LEnlN55l","@WillDowningComm are u in Sochi ? Is there any were I can watch the IOC broadcast feeds? Like at the summer games ?","RT @jsmillwood: Yuri is a class act. Won with great respect to his heroes and competitors. #sochi"],"id":14,"autoSummary":"#FlakoBoow: Corruption Sting Follows Indian Athletes to Sochi: India snafu at Sochi stings athletes, but littl... http://t.co/KTpsMNgaJp"}}