{"18":{"topic":"canada","tweets":["Tories deliver ETA for contentious Canada Job Grant #cdnpoli http://t.co/sAeoLEFWw0","Securities Litigation Snapshot http://t.co/mrIx05vrF5 - By @BLGLaw","#Sweepstakes - Win A Check From #Kelloggs For $20,000 - CANADA http://t.co/JGcxMOEfVl","Listeria Recall: Canada Old Cheddar Cheese | Food Safety News http://t.co/vlUcWRxjK3","SOCHI 2014 WINTER OLYMPIC GAMES\nCanada Chooses three Sisters for Its Olympic Skiing team.\nJustine Dufour-Lapointe,... http://t.co/Zwnd1ZicVB","RAW LEADS FOR AUSTRALIA CANADA, UK \u0026 USA AVAILABLE @ LOWEST RATES  callcenterbizz http://t.co/KwK751MEdV","In womens hockey US-Canada rivalry has become border brawl: SOCHI, Russia - As North American neighbors, Canada... http://t.co/R9hHtvxwTN","A happy German Shepherd puppy with a happy new owner in Montreal, Canada http://t.co/Bcp5XLZF7Q","RT @irajdeep: The First NaMo Tea Stall iN Silicon Valley, by Professionals From Microsoft, Cisco, Apple, eBay, Oracle http://t.co/oRBiFFvUr…","Job in Canada: Real Estate Lawyer, Western Educated, Fantastic Salary and Benefits, Dubai, UAE – Apple Search \u0026 ... http://t.co/Meotfhhxro","RT @commonfemaIe: Canada took the gold medal for looks this year that\u0027s for sure http://t.co/yC1VgUjJ1h","@KeptitGforYa lmao eff that .. I swear Canada has this .. Think we\u0027re more hungry for that gold 😂😂","U.S. construction workers unearth ice age mammoth tusk http://t.co/eLsNvDP0Ds robsoninc #news #canada","Transgender woman held in men’s jail transferred to women’s facility http://t.co/ti7aGK8Cpu robsoninc #news #canada","Canada-USA game today, and I have a meeting through the whole thing. Someone want to live text me the game?? #TeamCanada #OlympicHockey","RT @canadacomsports: Norway, China stay undefeated, U.S. finally gets win on the board in men\u0027s Olympic curling http://t.co/8SBzR8fLeE","WATCH: Canada’s cross-country ski coach rushes to help Russia’s Anton Gafaro after fall http://t.co/ehfwfs6Fx4","@SaraMojtehedz via@africaprogress: #Canada #mining investment in #Africa grew from 6bn. in 2005 to 32bn in 2011: http://t.co/WCe98BXSgG","@Andreeac35 @WLW_ITALIA @WLWHungria @WLW_Canada @WLWTexas @WLW_Florida @WLW_GRECIA @BeokaSz @SaraJan29 Beautiful day! http://t.co/Z5CEUGveqI","RT @BradyMcCollough: My story on Sidney Crosby, his life under Canada\u0027s microscope and the change in him that\u0027s hard to see from far away: …","RT @FraserAird: Last breakfast with @SandraAird before she heads back to Canada","I\u0027m gonna feel really bad for the US women after Canada kills them.","Beer Fridge Cheers Canadian Olympians at Sochi http://t.co/l5cZXugsj3 via @TIMEWorld","RT @MNWomensHockey: Good luck to USA #Gophers @meganebozek, @AmandaKessel8, @GigiMarvin, @_aschlep \u0026 @LeeSteck2 vs. Canada at 6:30 am CT! #…","@dahliaface I still hope he gets that damn cozie. I tracked it, it\u0027s delivered in Canada.","Oil Imports from Canada could benefit RIL: Canada, the world\u0027s third largest oil reserve (Behind Saudi Arabia ... http://t.co/lvNTqyelRA","RT @Andreeac35: @Juca_1980 @WLW_ITALIA @WLWHungria @WLW_Canada @WLWTexas @WLW_Florida @WLW_GRECIA @BeokaSz @SaraJan29 morning girls http://…","India\u0027s Piramal, Canada\u0027s CPPIB form $500 mln realty investment fund - Reuters http://t.co/UCnUqNuuzW #investment #india","Della Wolf is B.C.\u0027s 1st child with 3 parents on birth certificate http://t.co/hi6xtJou48","Waiting for Spain ^_^\nBye Canada , im not interested at you :\u0027)","RT @KDPomp: Womens hockey between USA and Canada in Sochi will be intense. Last time they met, a brawl broke out. Anxious to watch","Bellator Returns to Canada for Bellator 119 and Season 10 Heavyweight Finals - By Press Release Bellator... http://t.co/bDQdohhSrq","Bellator Returns to Canada for Bellator 119 and Season 10 Heavyweight Finals http://t.co/P0x6dOCgcJ","RT @PennyRed: Canada, which has been so vocal about LGBT rights, just sent a trans woman who committed no crime to a MEN\u0027S PRISON - http://…","feels like im the only person from canada in Atlanta * sigh *","Bellator Returns to Canada for Bellator 119 and Season 10 Heavyweight Finals http://t.co/EhZFgBLetN","#BlueWaterBridge as of 4AM wait times to cross into the U.S. and Canada is less than 15 min. for all motorists","Bellator Returns to Canada for Bellator 119 and Season 10 Heavyweight Finals http://t.co/EewkiJozdW","Bellator Returns to Canada for Bellator 119 and Season 10 Heavyweight Finals http://t.co/uUfWR8aB0C","#nowplaying on CKOE FM Monc-ton Canada http://t.co/kYROXs9vjm Over My Head by Brian Littrell","Thanks Tom. RT @tomcunderwood: Moving new story of forgiveness from @ForgivenessProj - http://t.co/gZO6b83vCR","Bellator Returns to Canada for Bellator 119 and Season 10 Heavyweight Finals http://t.co/xS9HTY8RiE","@SoaRCoan and btw its 9 11 up to the right where canada and norway is ye","Bellator Returns to Canada for Bellator 119 and Season 10 Heavyweight Finals http://t.co/gQOJQd4vVD","RT @NickelodeonDVD: RT \u0026 follow to WIN a copy of ‘Max \u0026 Ruby: Everybunny Loves Spring!’ on DVD! US/Canada only. Ends 2/14 at 12PM EST.","RT @wyshynski: Reminder: It is your duty as a hockey fan to watch USA/Canada women at 730 am EST.","RT @FetzerInstitute: \"#Forgiveness is a hard word, it demands a lot of you \u0026 is so often misunderstood...\" Powerful @ForgivenessProj story …","RT @BilalSpeaks: Girl... tonight you can be like Canada\u0027s medal count... On the top #OlympicPickupLines","RT @kidrauhlthief: So one of my primary school teachers are going to Canada so I told him to go to the avon theatre and take a photo of Jus…","Team Canada Beer Fridge: Canadian Passport Needed http://t.co/SHLJzUrkwR","RT @NatGeo: Photo of the Day: Yukon Night http://t.co/Hhal5h81q8 #pod #photography","the tiniest, bitchiest of gripes. spot the difference.\n\nu. s.: http://t.co/j3RRXwrZ2h\ncanada: http://t.co/HBG399u6H0","Opening Excerpt from \"Western Canada in Less Than a Month\" \n\n#doncasterisgreat #sheffieldissuper http://t.co/VO6nlIlk3l","RT @vfxgordon: @padster @VFXSoldier @VFXTippingPoint @scott_squires When the company you work for asks you to move to Canada, something\u0027s w…","Norway, China stay undefeated, U.S. finally gets win on the board in men\u0027s Olympic curling http://t.co/8SBzR8fLeE","SadGretzky.gif -- Revisiting Canada\u0027s stunning loss to the Czech Republic in Nagano http://t.co/i7lBUNda59 via @theScore","New fossil bed found by scientists hailed as \u0027motherlode\u0027 http://t.co/z4qD0V87e3","RT @NatGeo: Photo of the Day: Yukon Night http://t.co/Hhal5h81q8 #pod #photography","Brain-dead Canadian woman dies after #baby boy born | http://t.co/rPNSDGQcDs | #Canada #Pregnant","If Canada keeps winning medals, its gonna become damn near unbearable to watch the rest of these Winter Olympics in our house. #CanadianWife","foot care podiatry chiropody would be covered under government health insurance in Canada","RT @VFXSoldier: @scott_squires @VFXTippingPoint How do you tell if a VFX issues article was written in Canada? No mention of the subsidy is…","Dr. Sergio M. Alcocer - Canada and Mexico 70 years of Bilateral Relations: http://t.co/K34OXZJLbh via @YouTube","RT @Santyparihar1: \"In ten days a kid from a small town in Canada will perform at the world\u0027s most famous arena Madison Square Garden.\" #3Y…","RT @CDNOlympicTeam: CANADA\u0027s women face USA in hockey tomorrow! http://t.co/RppV8RvwSP RT if you think we\u0027ll show them that #WeAreWinter ht…","@AllTimeLow if you guys don\u0027t come to canada soon I\u0027ll bitch slap all of you xoxo","So that it\u0027s really worth, one of the camermen just drove by the Canada Games Centre and didn\u0027t see anything at all. So that\u0027s good news....","RT @camilacabello97: hiiiiiiiii canada. you\u0027re cold. you also have great food. i like u canada","Canada Protests #Russia\u0026#8217;s Anti-Gay Law With Winter Olympics PSA (VIDEO) - \nCanada is... http://t.co/aNARy8YYZW\n #WinterOlympics","RT @am640: #Toyota is recalling 1.9 million hybrid Prius cars globally for a software glitch that could cause the vehicle to stall. 13,000 …","Sand Glass ~ EurAsia is out! http://t.co/BHMJ0k3az3 Stories via @MSF_canada","Flappy Bird is the ultimate mobile game ripoff | http://t.co/0KtVNdoGf5 - http://t.co/Gx1ZOj0Y8k","RT @BrianneMcL: Beautiful day in sochi! And it\u0027s GAME DAYY vs canada! Our favorite :) @usahockey #Sochi2014 http://t.co/eESq669aor","i have the shittiest data plan 2 sigh phone bills are so fucked up in canada","Yes! The sun in France! When I think if there wasn\u0027t the Gulf Stream we would have the same weather in Canada, snow, the dream! @BITTENKGW","How sweet would it be to see Sid \u0026 Canada vs. Geno \u0026 Russia in the Gold Medal Game?","#Sports Get A Room, Canada: \n\nFor the second Winter Olympics in a row, Canadian speed skating husband and wife... http://t.co/VlW9D4nvTA","Get A Room, Canada http://t.co/2ycWKnaBvb #KsFanHeadquarters","RT @enriq_romero: @CONSUELOCDUIN @luzmarpal Aurora Borealis Picture --Arctic Photo -- National Geographic Photo of the Day http://t.co/n678…","But why do all the hot people live in Canada, America or in the UK","RT @NatGeo: Photo of the Day: Yukon Night http://t.co/Hhal5h81q8 #pod #photography","RT @Barbara_Anne38: Repeat of 2010?? Canada\u0027s gonna bring home the gold baby!!! 😊😊 #TeamCanada","I got nothing but love for my people in Canada. I met some of the realest ones out there.","RT @wh_honeytree: ♥Ricewreath donation for WOOHYUN group order in USA/CANADA♥ →  @GoldenInspirits  http://t.co/IHtEdV3RHh http://t.co/55qY8…","RT @nadya: Canada denies trans comedian @aedison entry, throws her in a men\u0027s prison. WHAT. http://t.co/KPPcPDJ4y0","RT @HG_Personal: PENS FANS ARE NOT ALLOWED TO VOTE\n\nRetweet if you think Kunitz should not be on Canada.\nFavorite if you think Kunitz shoul…","RT @cotsonika: Bumped into Chris Chelios, who is in Sochi working for Fox Sports. I told him I was headed to Team Canada\u0027s practice. His re…","RT @kayaturski: Gave the ladies that have been cleaning my room some Canada tees. They were psyched!!! Converted some Russians 😜 #CanadaPro…","RT @GoldenInspirits: OGS Returns Rice Wreath with @wh_honeytree \u0026 That\u0027s Dope ♡ [USA/CANADA GROUP DONATION] \nhttp://t.co/6w6EjD9V21 http://…","@WebProNews: #web Team Canada Beer Fridge: Canadian Passport Needed: Canada sure knows ... http://t.co/a6NtqUAq3G http://t.co/AWFI7OcN1j","Team Canada Beer Fridge: Canadian Passport Needed http://t.co/D62HYFw0rL","HUFF POST - Nova Scotia\u0027s economy under microscope, report coming on best course ahead http://t.co/ZWd4Hp1ta2","RT @MandyMorbid: http://t.co/n3YbMqmjtn been following this story about Canada\u0027s major fuck up handling @aedison :/","@wongacanada: Fast little loans that give you lots of control: http://t.co/uYwFwb3Ggp #canada #money #cash","@BBKavyn Yep, and I can\u0027t be too mad since my favorite show Supernatural is filmed in Canada.","RT @markmcmorris: CANADA \nI missed you","if MAGCON ever decides to come to Toronto or tour Canada its gonna be when the weather gets warmer #GetYourHopesUp☺️","RT @Can_ada: CDNs have given up on this govt being honest or accountable, we have not given up on #Canada\n#cdnpoli #UnfairElxnsAct\nhttp://t…","It really annoys me that I\u0027ve seen Niagara falls and other beaut stuff in Canada but I was just too young and stupid to appreciate it","RT @bruce_arthur: My column on the brilliant Dufour-Lapointe sisters, their big-hearted parents, and a beautiful family: http://t.co/fPilpY…","Truck Mechanic Required in Canada.Call 0552504364: TBA - Adjust, repair or replace parts and components of com... http://t.co/1I7s6ewJJK","[ Immigration ] Open Question : how to apply going canada ,i had my emplyer already name thomas toss he gave me ... http://t.co/t0ZUb0V4zf","RT @GoldenInspirits: OGS Returns Rice Wreath for Sungjong ♥ with @bellabella_sj [USA/CANADA GROUP DONATION] http://t.co/q80yvifGFO http://t…","RT @NatGeo: Photo of the Day: Yukon Night http://t.co/Hhal5h81q8 #pod #photography","Repeat of 2010?? Canada\u0027s gonna bring home the gold baby!!! 😊😊 #TeamCanada","[ Immigration ] Open Question : how to apply going canada ,i had my emplyer already name thomas toss he gave me ... http://t.co/arAbYV3RQ3","[ Immigration ] Open Question : how to apply going canada ,i had my emplyer already name thomas toss he gave me ... http://t.co/ZNdQxaKJHo","RT @NatGeo: Photo of the Day: Yukon Night http://t.co/Hhal5h81q8 #pod #photography","@Oreo are the new cookie dough and marshmallow crispy flavours available in Canada?","RT @markmcmorris: CANADA \nI missed you","RT @Bunny_Godfather: Angel\u0027s sad story from the killing waters of Taiji, Japan http://t.co/6W89Q7bvIb #tweet4taiji #Dolphins","RT @markmcmorris: Back to home soil I go, let the media tour continue! 🙈\nCANADA bound :)\n#byesochi http://t.co/idxPtm4e2a","RT @NatGeo: Photo of the Day: Yukon Night http://t.co/Hhal5h81q8 #pod #photography","RT @Molson_Canadian: Spotted! The beer fridge in Canada Olympic House in #Sochi #wearewinter http://t.co/E3hMUTtQRt","RT @GlobePosts: Moraine Lake, Canada http://t.co/ge6sJr371W","\"@HeroInSupras: “@TypicalGirI: CONGRATULATIONS ON YOUR FACE GO CANADA http://t.co/0aUEDVIBf4” @GrandeSupras\" hello Mark :3","@hemxingsxx the hockey game is on soon USA VS Canada","RT @Molson_Canadian: Spotted! The beer fridge in Canada Olympic House in #Sochi #wearewinter http://t.co/E3hMUTtQRt","RT @NBCLA: .@kstack16 \u0026 Team USA women\u0027s hockey face off against Canada tomorrow. Tweet your support using hashtag #Go4Gold! http://t.co/fF…","Wow. “@drLisaM: Canada: Healthy Baby Is Delivered by Woman Declared Brain-Dead http://t.co/LBx1TKWeq3”","Irving Layton~ In Pierre Elliott Trudeau Canada has at last produced a political leader worthy of assassination.","RT @NatGeo: Photo of the Day: Yukon Night http://t.co/Hhal5h81q8 #pod #photography","so all my roommates are leaving Canada for the weekend... you know what that means homie g\u0027s","Once again, Canada blazes trails. Children need *all* the parents! http://t.co/sQFiqTVMlS","#Amazon #Canada Baume Mercier Men\u0027s Capeland Chronograph Dial Watch Silver A10000 by Baume \u0026 Mercier ... http://t.co/H4Ef4DHzSX #Watches","#Amazon #Canada red line Men\u0027s RL-50049-01-RDS Torque Sport Black Dial Red Silicone Watch by Redline ... http://t.co/4hy33IlH1m #Watches","#Amazon #Canada Identity London Gun Metal Bracelet Strap Ladies Fashion Watch 283/6911 by Identity Lo... http://t.co/UjYi7JBTMK #Watches","#Amazon #Canada Stuhrling Original Women\u0027s 505.11441 Chantilly Swiss Quartz Rosetone Mesh Watch by St... http://t.co/P81lt5zeAO #Watches","#Amazon #Canada Invicta Men\u0027s 12746 Bolt Reserve Chronograph Champagne Mother-Of-Pearl Dial Stainless... http://t.co/DBUXEvmL5G #Watches","96Tears, A Wonderful Vintage Clothing and Accessory Store in Toronto, Canada http://t.co/lS6226aUUF","Time to get some sleep. Got to get up at 4am to watch @Hilary_Knight and the USA Women\u0027s Hockey Team play Canada! #GOUSA #DawnsEarlyLight","RT @NatGeo: Photo of the Day: Yukon Night http://t.co/Hhal5h81q8 #pod #photography","RT @NatGeo: Photo of the Day: Yukon Night http://t.co/Hhal5h81q8 #pod #photography","#nowplaying on CKOE FM Monc-ton Canada http://t.co/kYROXs9vjm True Things by Jj Heller","i already know canada is going to win the olympics i mean they came with a fucking army","RT @TheIambicPen: \"Well, I wouldn\u0027t marry anyone who was really wicked, but I think I\u0027d like it if he could be wicked and wouldn\u0027t.\" #WhatW…","Ask me where I\u0027m from I say ca ca canada","RT @TheWorldStories: Emerald Lake located in Yoho National Park - British Columbia, Canada http://t.co/qJumsNCZB5","\u0027Mother Lode\u0027 of Fossils - Retinas, corneas, neural tissue, guts and even a possible heart and liver were found. http://t.co/KQqgVhBvXH","the (in)complete list of coworking spaces in Canada: part two - http://t.co/e5sKqkpaz0","RT @JBsexykidrauhl: *In school*    \nTeacher: Who can tell us something about Canada?     \nMe: *pull hand*     \nTeacher: Justin Bieber doesn…","Bumped into Chris Chelios, who is in Sochi working for Fox Sports. I told him I was headed to Team Canada\u0027s practice. His response: \"Boo.\"","Canada is about to get its first public medical marijuana company http://t.co/VxzmHTu8YP","I wanna go away again Cali was dope,,,,,,I\u0027m ready to go again Canada maybe!","For my whole life, I\u0027ve wondered about the advantages of having dual citizenship. with Canada. Now I know. #thanksMUM http://t.co/WNXVT8KUqs","Photo of the Day: Yukon Night http://t.co/aNZHkqj1K5  #pod #photography","RT @RickTufts: @VyeOne Re the B of Canada turning over the creation of money to the commrcial banks,  Canadians never knew about it or its …","Enter for a chance to #WIN a $50 M\u0026M Meat Shops Gift Card! (Canada only) ends 2/14 #GIVEAWAY #MMValentine http://t.co/SRIWJsC3KS","#Markets ▪ Europe higher after Yellen debut, China data; SocGen up 2.8%: European stocks followed their Asian ... http://t.co/r994DMj86q","RT @BizAlertz: [Wall St Journal] Canada Clamps Down on Rich Chinese Migrants http://t.co/dKoJEdVAo6","Last breakfast with @SandraAird before she heads back to Canada","RT @RoyalReporter: The Queen and the Earl of Wessex hosted a lunch for Canada\u0027s Governor General David Johnston and his wife at Buckingham …","Piramal, Canada\u0027s CPPIB form $500 million realty investment fund: MUMBAI (Reuters) - Piramal Enterprises Ltd h... http://t.co/d14JY8Dt8R","RT @conradhackett: Should society accept homosexuality?\n88% yes - Spain\n80% Canada\n60% US\n16% Russia\n9% Turkey\n2% Pakistan\n1% Nigeria  http…","Get more locals \u003e\u003e Get your Pets biz in Winnipeg Manitoba Canada listed FREE in WomTown directory.","FREE to businesses \u003e\u003e Owners of Event Planning and Services biz in Winnipeg Manitoba Canada get FREE business lisings at WomTown.","RT @BestEarthPix: Moraine Lake, Canada http://t.co/JPZYsCHFSo","RT @KatePettersen_: Canada guaranteed a medal in men\u0027s #slopestyle final. Will it be @markmcmorris or @MaxParrot? #CBCOlympics","Canada budget 2014 looks to slash public servants’ benefits in effort to save billions http://t.co/jDIIPpd7nQ Try it in UK  Parliament...","@CONSUELOCDUIN @luzmarpal Aurora Borealis Picture --Arctic Photo -- National Geographic Photo of the Day http://t.co/n678ZUfG9C  vía @NatGeo","RT @YouthJobSummit: Canada\u0027s budget focus on youth unemployment, apprenticeships and innovation is welcomed by @GBCollege #jobsforyouth htt…","Canada budget 2014 looks to slash public servants’ benefits in effort to save billions http://t.co/jDIIPpd7nQ Try it inUK  Parliament...","Looking forward to the men\u0027s hockey starting today. Cheering on Finland, Russia, US \u0026 Canada. Basically teams with #Pens players #Sochi2014","RT @GoldenInspirits: OGS Returns Rice Wreath for Sungjong ♥ with @bellabella_sj [USA/CANADA GROUP DONATION] http://t.co/q80yvifGFO http://t…","@PastorMark reaching #Canada... https://t.co/G6La9QeR7Z","RT @HMADavidSlinn: I am beginning to realise just how seriously #Canada takes the Winter Olympics! #canadianwife","INSIDER CONFIRMS - #ARTIFICIALSNOW FALLING OVER US \u0026 CANADA - SEE HOW THEY\u0027RE DOING IT! http://t.co/qMBnUVVZ86","RT @Molson_Canadian: Spotted! The beer fridge in Canada Olympic House in #Sochi #wearewinter http://t.co/E3hMUTtQRt","RT @TimHortons: Only in Canada… Thanks to our guest Abu for sharing this photo. http://t.co/515HEuE04t","RT @DerelictPlace: Abandoned Tunnel behind Niagara Falls, Canada http://t.co/E1bLlVUjod","And now Im going back to sleep. Hopefully I manage to get up to watch USA-Canada.","@TinaMaze CONGRATULATIONS from Canada!","Yeah.Over 106 downloads of jabujicaba# in China, Singapore, Thailand, Italy, Spain, Germany, Switzerland, US, Canada, Brazil and Britain!","Brain-dead Canadian woman dies after son\u0027s birth http://t.co/gTWKHTc1E1","The Night I Cheered for Canada | MICHAEL KETTERER - Michael Ketterer is one of my favorite Christian... http://t.co/GUyZkVnOr7","Now playing Frank Chacksfield \u0026 His Orchestra - A man and a woman on Crystal Radio Canada","damn I want to watch Canada vs USA at 430am. Should have went to bed earlier.I guess I\u0027ll DVR it.","Angel\u0027s sad story from the killing waters of Taiji, Japan http://t.co/6W89Q7bvIb #tweet4taiji #Dolphins","Why do I even care to hear it won\u0027t be anything about Canada anyways","@dominiquegisin CONGRATULATIONS from Canada!","@Skelly_Rider big fan! Could we all see the reference you used for your helmet?! GO TEAM CANADA!","Positioned For Growth With Simon Fish (Video Content) http://t.co/YArxiYBdIM - By @blakeslaw","RT @ReutersIndia: Piramal, Canada\u0027s CPPIB form $500 million realty investment fund http://t.co/GHazng5Bbi","RT @NatGeo: Photo of the Day: Yukon Night http://t.co/Hhal5h81q8 #pod #photography","RT @Allisomething: She is a woman. Her passport agrees. She should not be in men\u0027s prison. Not a difficult concept. http://t.co/aVF9VTu211 …","RT @NatGeo: Photo of the Day: Yukon Night http://t.co/Hhal5h81q8 #pod #photography","RT @markmcmorris: CANADA \nI missed you","Inuit Women Are Being Trafficked Through Dating Sites | VICE Canada http://t.co/q5EJx6biKT via @VICECANADA","RT @Molson_Canadian: Spotted! The beer fridge in Canada Olympic House in #Sochi #wearewinter http://t.co/E3hMUTtQRt","RT @BSEC2014: We took a trip down to Canada Heights on Saturday (Feb 8th) to meet up with the Sidcup Club to start planning for... http://t…","RT @NatGeo: Photo of the Day: Yukon Night http://t.co/Hhal5h81q8 #pod #photography","RT @BobColeBaby: It\u0027s gonna be a break. It\u0027s Joooooe Saaaakic. Scores! Jeeeyooo. Sakic. Scores. And that makes it. 5. 2. Canada. Surely. Th…","“@myboycrush: excuse me while I go pack all my things and move to Canada 😍 http://t.co/KxOVfo5gud”","RT @wac4Taiji: #ARTURO2CANADA Lets help Arturo, the last Polar Bear in Mendosa Zoo Argentina to a sanctuary in Canada! http://t.co/P8zaThaw…","RT @NBCLA: .@kstack16 \u0026 Team USA women\u0027s hockey face off against Canada tomorrow. Tweet your support using hashtag #Go4Gold! http://t.co/fF…","If Canada\u0027s goalies play good enough they\u0027ll win gold","@temperedarmor 5S clear tempered armour. but i can\u0027t select other countries except USA/Canada/France :(","RT @katyperry: It\u0027s all happening NOW! US: http://t.co/uRfhXEvbkK. CANADA: http://t.co/xMOmTOsuDZ. More at http://t.co/Y9MwzDOpMV! #THEPRIS…","Piramal, Canada\u0027s CPPIB form $500 million realty investment fund http://t.co/GHazng5Bbi","RT @InjusticeFacts: In Canada and the U.S, Native Americans commit suicide 400% more than the rest of the population, due to poverty and so…"],"id":18,"autoSummary":"New to #PetBizUK \u0027The Pet Business\u0027 niche pet supplies for the UK. Sourced mainly from USA \u0026 Canada. Trade welcome! http://t.co/piRBApVCmQ"}}