{"32":{"topic":"angie brown","tweets":["@Jayson_Davies Kinda wanna go out after Angie Brown, don\u0027t you 😉","#TheVoiceUK Essex barbie who can\u0027t even hold a note is deemed good enough yet you let Angie Brown walk away.#mindboggling","Lets talk, Angie Brown compares to this off key individual who gets through #thevoiceuk","Damn love her voice - why didn\u0027t she sing a different song? Angie Brown- Im gonna get you http://t.co/z6JrWfRgV3 via @youtube #thevoice","Watching The Voice. I know. I thought Angie Brown (Bizarre Inc) had a fabulous voice. Guess they thought it sounded too like the original?","Angie brown #thevoiceuk why didn\u0027t they turn around?!","RT @MarvinHumes: Angie Brown!!!","@iamwill u need to use that voice of Angie Brown.","RT @dougiebrimson: Hope @tonyblackburn will play a bit of Angie Brown for me tomorrow on @BBCLondon949 That\u0027s a tune and a half. #TheVoiceUK","Angie Brown on #TheVoiceUK she chose the wrong song, she shouldn\u0027t have done her hit","Love Angie Brown! What a legend #AngieBrown #TheVoiceUK #TheVoice","Angie Brown kills it #TheVoice  http://t.co/sDZOS7cUAU","Watching TheVoice and just got totes emoshe at Angie Brown\u0027s reaction from the audience #angiebrown","RT @TheQueerGuy: Can\u0027t believe no one turned for Angie Brown. #TheVoiceUK","@voiceUKbbc What were you guys thinking not turning around for Angie Brown? #Stupid","RT @dougiebrimson: Hope @tonyblackburn will play a bit of Angie Brown for me tomorrow on @BBCLondon949 That\u0027s a tune and a half. #TheVoiceUK","Angie Brown on #thevoice how cool is that #lovethattune","Angie Brown doesn\u0027t get through.\n\nBad Paloma Faith tribute act does.\n\nThis show is a nonsense sometimes #TheVoiceUK","Angie Brown singing one of my fave songs! Can\u0027t wait to see her @ The Lounge #ImGonnaGetYouBaby #YouKnowYourGonnaBeMine #ExcitedMuch","Told ya!! I find that decision shocking!! 🙀 Angie Brown you keep going girl!! #TheVoiceUK","Is anyone watching the voice? Angie Brown should totally re release that song - I\u0027m gonna get you!","#thevoiceuk why didn\u0027t you put Angie Brown through????","Angie Brown was awesome!!!! @BBCTheVoiceUK","RT @whatacharlie_: Well that\u0027s probably secured Angie Brown bookings for all the big Prides in \u002714. Y\u0027know; Dundee, Dudley and Newport.","@Stecrawford74 Angie brown!! #TheVoiceUK !!!","RT @Emma_Willis: Angie brown. I\u0027m a teenager again...! @BBCTheVoiceUK","RT @LeeMull3: Angie Brown getting knocked back from The Voice is a complete farce!","Time for a re-release? Angie Brown http://t.co/daPSzCxsya #TheVoiceUK","RT @IAmJordanJ: Angie Brown I\u0027ve Seen!! #TheVoice","I hope Bizarre Inc and Angie Brown\u0027s \"I\u0027m Gonna Get You\" returns to the Singles Chart after that. Still sounds good 22 years on. #TheVoiceUK","RT @Aleks_the_kiwi: Watching the voice, wish someone had turned for Angie Brown, she was incredible, one of the most powerful voices I\u0027ve h…","RT @mart1nwalker: \"The Voice\" ?? Don\u0027t make me laugh\n\nAngie Brown is ripping it and those fools don\u0027t turn around!?\n\nIt\u0027s not about... http…","Angie Brown @BBCTheVoiceUK - WOW what a legend! #epic #respect","I liked a @YouTube video http://t.co/7Slg0JAjvx Angie Brown performs \u0027I\u0027m Gonna Get You\u0027 - The Voice UK 2014: Blind Auditions 7 - BBC","RT @WhoJulia: @DJstewartwho  @lucfloreani Angie Brown is on The Voice ! #amazing","RT @funusual: Love Angie Brown #whywasteyourtime #thevoiceuk","WOW. Angie Brown on #TheVoiceUK A.Mazing. Cannot believe that song is 20 years old though #feelingold","Oh my days Angie Brown so proud. .The Legend...still love ya never forgotten on The Voice...","RT @kf180382_karen: Angie Brown just seen you on the voice, had had to tweet you! Wow girl! You were bloody amazing. You have a hell of a t…","So Angie Brown gets turned down with that AMAZING voice \u0026 yet I wonder if they\u0027ll turn around 4 this girl who\u0027s obvs on helium!! #thevoiceuk","@iamwill #the voice please sign Angie brown...loving the retro \u0027I\u0027m gonna get you\u0027","Hold on why did Angie Brown just try to get through with her 1992 hit. Why waste your time!! Didn\u0027t you write no other songs?? #TheVoiceUK","RT @DukuNDubz_xx: That moment when you search for Angie Brown\u0027s Twitter and find out you\u0027re following each other already 🙀 So happy ahaha @…","@shotbyshaun #TheVoiceUK No one turned for Angie Brown??????","Big mistake! Angie Brown rocked #TheVoiceUK","\"I don\u0027t want to be known as a one hit wonder\" says Angie Brown before going on the #VoiceUK and singing her one hit","Angie Brown alll nighttt","Embarrassing that Angie brown didn\u0027t get through #thevoice 🙈","Here ya\u0027 go... Angie Brown http://t.co/5xzWvR6ORV #theVoice #music ;)","Hope @tonyblackburn will play a bit of Angie Brown for me tomorrow on @BBCLondon949 That\u0027s a tune and a half. #TheVoiceUK","Angie brown my she!","Well that\u0027s probably secured Angie Brown bookings for all the big Prides in \u002714. Y\u0027know; Dundee, Dudley and Newport.","RT @ManOnThe81a: Unlucky Angie Brown on The Voice. I had the pleasure of meeting her at Pride last year. An absolute joy. http://t.co/sdWpO…","Angie Brown getting knocked back from The Voice is a complete farce!","Angie Brown I\u0027ve Seen!! #TheVoice","@martyrogers angie brown?? X","\"The Voice\" ?? Don\u0027t make me laugh\n\nAngie Brown is ripping it and those fools don\u0027t turn around!?\n\nIt\u0027s not about... http://t.co/eI1USgpLXF","@DJstewartwho  @lucfloreani Angie Brown is on The Voice ! #amazing","Love Angie Brown #whywasteyourtime #thevoiceuk","RT @Dwfmedia: INTERVIEW EXCLUSIVE :: @RealAngieBrown http://t.co/MtmkNcUYQW if you\u0027re a fan of #TheVoice you\u0027ll love this. Be sure to tune …","RT @Emma_Willis: Angie brown. I\u0027m a teenager again...! @BBCTheVoiceUK","Angie Brown just seen you on the voice, had had to tweet you! Wow girl! You were bloody amazing. You have a hell of a talent. Don\u0027t give up!","That moment when you search for Angie Brown\u0027s Twitter and find out you\u0027re following each other already 🙀 So happy ahaha @RealAngieBrown ❤️","RT @OK_Magazine: It\u0027s only Angie Brown! We\u0027re dancing in our seats - are you? #TheVoiceUK","@TheVoice_TF1 Angie Brown has an awsome voice.shes the one that got away.","RT @Ffyncwraig: Angie Brown shot herself in the foot singing her own song \u0027I\u0027m gonna get you\" on #thevoiceuk","Angie Brown just tore up The Voice  !! What a great Voice .","Reading twitter and hearing that Angie Brown is on #TheVoiceUK but they didn\u0027t deem her voice special. I consider this program #FullOfShit","RT @nurse_nimmer: Poor Angie Brown, wrong song choice? #thevoice","RT @JayPeri: Angie Brown isn\u0027t even tryna get through, just promoting her song from 20 years back. #TheVoiceUK","#thevoiceUK you\u0027re all nuts. Angie Brown doesn\u0027t get thru! http://t.co/e48PnMCMn9 u should so something with her","@iamwill Will you should have Angie Brown on one of your tracks #TheVoiceUK #TheVoice","Angie brown blasting it out old school #thevoice","OMG Angie Brown - what a voice!!!!","Angie Brown doesn\u0027t get through The Voice, I\u0027m not amused\n\"Why waste your time, you know youre gonna be mine.Angie was awesum!","Tune Angie Brown ! #memories","Watching the voice, wish someone had turned for Angie Brown, she was incredible, one of the most powerful voices I\u0027ve heard #TheVoiceUK","So they didn\u0027t pick Angie Brown!!! Jeeeeeeeze... #TheVoiceUK","RT @Emma_Willis: Angie brown. I\u0027m a teenager again...! @BBCTheVoiceUK","#TheVoiceUK Angie Brown - I\u0027m gonna get ya. Was dancing to that last night. Love, love, LOVE that song!","@BBCTheVoiceUK Angie brown!!","I am just thinking if #thevoiceuk is about \"the voice\" then what is point if they don\u0027t turn for performances like Angie Brown\u0027s. #deflated","RT @BBCTheVoiceUK: That’s right, people: it’s THAT Angie Brown from THAT actual classic! #thevoiceuk #WHYWASTEYOURTIME","Angie Brown Wowsa!!! Lady u were insane tonight!! Can\u0027t wait to hear what\u0027s next from you x","RT @ADZtbh: Ooh Angie Brown! #TheVoiceUK","Angie Brown, hi, its the producers of the #BigReunion2014  just seen you on #TheVoiceUK and just wow","Angie brown # the voice...you can sing and should have sung something new..:))","Angie brown on #TheVoiceUK she just killed it. Seen it sung live loads. She\u0027s amazing. I think they\u0027ve dropped a boo boo there","People saying Angie Brown is a legend.... Really? - Nahhh!!!!\n\n#TheVoiceUK","RT @Emma_Willis: Angie brown. I\u0027m a teenager again...! @BBCTheVoiceUK","I\u0027m surprised Sir Tom hasn\u0027t sang with Angie Brown before!! #TheVoiceUK","Angie Brown, 1992, what a tune that was!","Angie Brown\u0027s gran is Bono?! #TheVoiceUK http://t.co/zUVghw9rxE","Imma go and buy Angie Brown\u0027s song on Itunes ya know #whywasteyourtime","RT @Pure_NXK: Angie Brown should get a reissue sorted. That song could be massive again... #TheVoiceUK","Angie brown singing her own track on the voice but doesn\u0027t want to be known as a one hit wonder hmm how does that work then","Angie Brown #LoveThatSong","RT @Miss_K_Vang: Angie Brown I\u0027m gonna get you can be remixed into a banging house tune.... if it hasn\u0027t already #TheVoiceUK","OMG Angie Brown on the voice. Pure class !!!!!! She doesn\u0027t need them to turn already an old Skool legend","RT @OK_Magazine: It\u0027s only Angie Brown! We\u0027re dancing in our seats - are you? #TheVoiceUK","So lucky to have had a little sing song backstage with Angie Brown @BBCTheVoiceUK @tallybookbinder #legend #90sdance","Angie Brown! Killing it 20 years later! Re-release that song! #theVoice","RT @JoostBoers: Great. Angie Brown totally fooled the #thevoiceuk jury! And Sir Tom may have produced that song","Angie Brown still sounds amazing after all this time :) #TheVoiceUK","RT @SairJanePope: Angie Brown, 50!??! She looks awesome! #TheVoiceUK 👍","Can\u0027t believe nobody turned for Angie Brown love that tune #amazing #TheVoiceUK  #imgonnagetubaby","Was it a one hit wonder for Angie Brown. I only remember that song #TheVoiceUK","I would have turned around instantly for Angie Brown! What a voice! #thevoice","RT @Emma_Willis: Angie brown. I\u0027m a teenager again...! @BBCTheVoiceUK","Love that Angie Brown song #TheVoice","I guess Angie Brown fulfilled her mission, now all the young kids know who sang that POWER house tune #TheVoiceUK","RT @BBCTheVoiceUK: That’s right, people: it’s THAT Angie Brown from THAT actual classic! #thevoiceuk #WHYWASTEYOURTIME","Angie brown #amazing","Angie Brown is amazing! She was brilliant when she played at pride!","Nobody pushed.. FOR ANGIE BROWN!!😲","RT @TheTennisTalker: Love Angie Brown. Have that single! one of my all time favourite records #thevoiceUK","#angie brown- amazing #thevoice","Angie Brown\u0027s kids are adorable! @BBCTheVoiceUK","Angie Brown hopefully getting a share of the upcoming surge in royalties for that song #TheVoiceUK","cannot believe they didn\u0027t pick Angie Brown. she was mint!!!! #thevoiceuk","Angie brown #amazeballs #TheVoiceUK","For anyone who doesn\u0027t know Angie Brown absolute legend http://t.co/WuuCw0TyEg","That woman Angie brown on the voice could not have been 50?? Looked about 30 #weird","Angie Brown you were amazing! Goosebumps! You don\u0027t need the coaches the audience wanted you! Release a single soon :-)","“@Emma_Willis: Angie brown. I\u0027m a teenager again...! @BBCTheVoiceUK” it\u0027s gonna fly on iTunes tonight!","Not 2 weeks ago I was cutting shapes to that Angie Brown tune. What a belter","Angie Brown should get a reissue sorted. That song could be massive again... #TheVoiceUK","We won\u0027t forget you Angie Brown!! ❤ #TheVoiceUK","GET ANGIE BROWN A RECORD DEAL #thevoice #voiceuk #thevoiceuk","RT @MarvinHumes: Angie Brown!!!","Wtf... Angie Brown should have got through. Amazing performance #thevoiceUK","RT @MarvinHumes: Angie Brown!!!","#TheVoice You didn’t pick Angie Brown? I mean, really?!!!!!","Wow Angie Brown on The Voice. Fantastic.","Angie Brown........YOU STILL GOT IT GIRRRRRL! #TheVoiceUK @BBCTheVoiceUK","Unlucky Angie Brown on The Voice. I had the pleasure of meeting her at Pride last year. An absolute joy. http://t.co/sdWpOM7sEd","RT @JayPeri: Angie Brown isn\u0027t even tryna get through, just promoting her song from 20 years back. #TheVoiceUK","Angie Brown was amazing. What a song. 🙌 #TheVoiceUK","Angie Brown Oooh shame! She sounded fab #thevoiceuk","#TheVoiceUK why did Angie brown sing her own song? Fail","They\u0027ve all met Angie Brown before of course! #TheVoiceUK","Angie brown👌","#TheVoiceUK Angie Brown what can I say. Still got it","RT @TheQueerGuy: Can\u0027t believe no one turned for Angie Brown. #TheVoiceUK","Angie Brown shot herself in the foot singing her own song \u0027I\u0027m gonna get you\" on #thevoiceuk","Cant believe no one turned for Angie Brown #thevoice what the hell!!!!!!","Watchin @BBCTheVoiceUK So Updet They Didnt Turn For Angie Brown Xx","Angie brown, \u0027I\u0027m gona get you\u0027 definitely gettin released Monday morning #tune #thevoice","I\u0027d have turned for Angie Brown #TheVoiceUK 😔","RT @platinummind: Angie Brown... Classic tune! #TheVoiceUK","#TheVoiceUK Angie Brown\u0027s still got it","Angie Brown..coming to a nightclub near you soon...singing that one song she knows! #thevoice","RT @BBCTheVoiceUK: That’s right, people: it’s THAT Angie Brown from THAT actual classic! #thevoiceuk #WHYWASTEYOURTIME","RT @Emma_Willis: Angie brown. I\u0027m a teenager again...! @BBCTheVoiceUK","Should have turned around for Angie Brown people","Angie Brown... LEGEND THEM WERE THE DAYS #TheVoiceUK","@NBCTheVoice Angie Brown winner #voice","#TheVoice Angie Brown doesn\u0027t want to be known as a one-hit wonder so comes out and sings the one hit.","Should of put Angie brown through fat dog","Killer killer voice Angie Brown. Wish you all the best. @BBCTheVoiceUK","RT @Emma_Willis: Angie brown. I\u0027m a teenager again...! @BBCTheVoiceUK","Angie Brown looks amazing!! #TheVoiceUK","#thevoiceuk angie brown...you still got it!","oh Angie Brown is amazing. #TheVoiceUK","Angie brown you go girl #TheVoiceUK","The voice missed a great one with Angie Brown.shes the one that got away.her voice is awsome","I cannot bear to watch \"The Voice\",they turned down Angie Brown ? Pardon my French,but..WTF ?!?","#thevoice they missed a trick with angie brown","Angie Brown 👌👌 #TheVoiceUK","That was one cringe worthy performance by Angie Brown doing her own song and the record scratches on #TheVoiceUk","Angie Brown \"I don\u0027t want to be a one hit wonder!\" So why audition on #theVoice with your one hit ?","I’m Gonna Get You isn’t enough to win Angie Brown a place on The Voice UK! http://t.co/mFDjCQOyNi","I think http://t.co/D7Y1cRYyX2 just confused Angie Brown with Jocelyn Brown. #awkward","@BBCTheVoiceUK  #thevoiceuk Angie Brown - You just killed it! Best vocal performance we have seen on the Voice - Ever","Love that song Angie brown mad not to press !!!\u0027 🎤🎤🎤","@BBCTheVoiceUK Angie Brown \u003d Different Class!!! #1992","Poor Angie Brown, wrong song choice? #thevoice","#thevoiceuk,judges should have turned for ms Angie brown.After hearing that song again it was like I was a kid again.","Wow, Angie brown #TheVoiceUK","Why didn\u0027t ANY of them turn around for Angie Brown?! She was AMAZING. #thevoiceuk","RT @OK_Magazine: It\u0027s only Angie Brown! We\u0027re dancing in our seats - are you? #TheVoiceUK","Whoa Angie Brown had a hit with her song and sang it in front of mentors on #TheVoice and no one turned around #whoa","canny believe NOT one of those judges turned round for Angie Brown she\u0027s a ledge! #TheVoiceUK","#thevoiceuk Angie Brown did an Adele mashup at Penn festival that was fantastic. You Rock Angie.","Angie Brown on #thevoiceuk reminds me of a misspent youth out clubbing in the mid 90s!","#TheVoiceUK what!  Angie brown was awsome!!!!!","@BBCTheVoiceUK Angie Brown#Rocking Ricky,Ricky,Ricky,Ricky..why didn\u0027t you do it do it do it@Rickontour","RT @Emma_Willis: Angie brown. I\u0027m a teenager again...! @BBCTheVoiceUK","Angie Brown what a pair of lungs #TheVoiceUK","How could no one turn for Angie Brown?! #thevoiceuk","Why is Angie Brown on the voice and why didn\u0027t they turn around? It\u0027s a madness!","RT @Emma_Willis: Angie brown. I\u0027m a teenager again...! @BBCTheVoiceUK","RT @SiphiweAnderson: The Voice UK is so crap. They wouldn\u0027t even turn for Angie Brown. Disgrace to the format.","If Angie brown re-released that song and remixed it up with more of a club/house style that would be a hit #thevoiceuk","I would\u0027ve turned for Angie Brown. That song was a great summer dance tune. Think everyone smashed the dance floor to that #TheVoiceUK","Angie Brown. I still think you\u0027re great even if no one turned around for you on #thevoice","Angie Brown wow! #thevoiceuk amazing!","Angie Brown rocking it Old Skool on #TheVoiceUK","The judges are crazy on #thevoice.  They should have definitely turned for Angie Brown!","RT @lisashaw9: Angie Brown.......\"why waste your time........"],"id":32,"autoSummary":"“@MarvinHumes: Angie Brown!!!” She does not look 50!!"}}