{"38":{"topic":"london","tweets":["@iSkate8 Help save Southbank Skatepark London UK. X http://t.co/DnYNjnjQoI","@WillBlackWriter @Lars9596 if they want to kill each other, leave em to it. I don\u0027t like Cameron, but I aint gonna burn London down.","Ellen\u0027s singing had hit an all time high!","BAFTA Awards: Brad Pitt, Angelina Jolie and Oprah Winfrey Hit the Red Carpet in London: Amy Adams, Cate Blanch... http://t.co/CwMAbtcFYE","RT @LFCExpose: So Tottenham have lost to Dnipro 1-0 tonight. If you don\u0027t know who they are, they\u0027re a small team from North London.","Watching Series 3 of Sherlock and I really miss London... #bakerstreet","Officially book a trip to visit the one and only @ashnoonan! @KBEEE @Rickballweg #London #Dublin #europe2014 🇬🇧🍀🍺","😘 stop gassing me baby  RT @iAMLovely31: @L0NNA my bitch looking like Lauren London 😍 #myfriendsbadderthenyours","@NICKIMINAJ please follow me  http://t.co/BbPSSJBvQz","Nice to meet Lady Fleming! Look for the new acquaintances in the streets of London! http://t.co/yzSRvBl3mw #iPad #iPadGames ...","@arunblair that week is perfect for me too :) just auditioning and working etc loving London life tho ;) keep in touch for a catch up anyway","RT @TheBlue_IsBacc: Why is it always the ugly bitches, with high self esteem?","London comes back tomorrow 😁","\"@YengPLUGGEDin LONDON on April 11, 2014!!! http://t.co/kXnTAxQVqT\"  @imdanielpadilla http://t.co/8U4trjt6iP","#RT #ConfessYourUnpopularOpinion From London on Simons 10Q Interviews with #author Robert Joseph Ahola http://t.co/739iAVvyLe","#ImpactManchester Kurt Angle inducted into the Hall of Fame in London next week.","Obsessed w Theophilus London","A girl in my data class asked me if London was a actually a city when her friend said it\u0027s a city she wants to visit, I\u0027m still laughing","RT @EdwardAshton30: WORDS OUT CHARLOTTE CHURCH PERFORMING LONDON MARCH 5, AND AGAIN IN CARDIFF ON MARCH 7, *TIME TO ROCK THE HOUSE AGAIN* h…","@TenaciousLB man, stay in the US. We don\u0027t want you here in London :(","@SuzanEraslan I also miss @onsomuchfire and @thomasls, even though London and Atlanta respectively.","RT @teamant11: @bamtho @WanWomack @shann_london @darealcj3 Steve","RT @Obeywesli: RT if this emoji is always in your recents http://t.co/lBTSzioQBr","RT @bamtho: “@teamant11: @bamtho @WanWomack @shann_london @darealcj3 oh yea member Greg and Steve was fighting”who won 😂😂","|SKS Bespoke global e-campaigns now available. #marketing #advertising http://t.co/rL7zCiqee0 /|/ @sksmediasoton","So mad I\u0027m not in London rn","King Balouch wrote on London Car Boot Sale\u0027s wall: Mercedes-Benz C Class C220 CDI AVANTGARDE SE - £6200\n\nSILVE... http://t.co/acykGwIJQ5","TBT : 1970 ~ MISS BLACK \u0026 BEAUTIFUL | 1960\u0027s\n\nWest Indian Beauty Pageant. London, 1960’s http://t.co/azJufOWxGP","RT @goPeeWeeAvs: Tomorrow\u0027s headlines may be about Team Canada\u0027s women but today it\u0027s all Avs! #London #Champs #doitagain http://t.co/LtUI9…","RT @bamtho: @shann_london @teamant11 @WanWomack @darealcj3 coach steve got in tha pool with and a.i jersey 😂😂","Gotta have a medical all the way in london, gotta get up so early too fml save me","@Product_London Quickest way to lose weight, burn fat! http://t.co/mWRcrS8f11","RT @axnzietxy: I\u0027m so passive aggressive I\u0027m basically a labour MP","RT @scarednarry: \"im homesick\" harry whispers while in london as he grabs his ticket to go back to LA","RT @bamtho: @WanWomack @teamant11 @shann_london @darealcj3 naw nigga when we had braids and shit 😂😂","RT @ShaLeesha_: im sooooooo sleepy","Shout out to my Aunty Ann and cousins in London. ❤️ my love for scarves and African print, know me well 🙈","RT @teamant11: @bamtho @WanWomack @shann_london @darealcj3 oh yea member Greg and Steve was fighting","RT @FOXSoccer: HIGHLIGHTS: Tottenham head back to London down on aggregate against Ukranian side Dnipro. http://t.co/zv5vvP5fNa #EuropaOnFOX","I liked a @YouTube video http://t.co/FoGdZBanya 3 MILLION DOPE FRESH PEEPS DANCE!!!","Hi @katyperry 02/18/14 at 6:00 PM\nKaty Perry at Elle Style Awards 2014 in London, United Kingdom retweet http://t.co/sYZNFC1uIB","Planning trips for Spring \u0026 Summer. San Fran, Mexico, London, Vegas and Miami on the list for now.","RT @bamtho: @teamant11 @WanWomack @shann_london @darealcj3 y\u0027all niggas through me as uprise bday party down florida","Dream pic... the ultimate country kitchen. (Source: http://t.co/dZAS70CKk9) http://t.co/3oOZIi7UBY","@iisuperwomanii.  What time is is it Canada; in london its 3:00am","Meera loves black guys yano","going London soooonnnn😏","Remembering #london2014 #lovemylife @ Mandarin Oriental Hyde Park, London http://t.co/wKKrULIjcL","Nice to meet Mrs. Thompson! Look for the new acquaintances in the streets of London! http://t.co/YlB6yN1TnA #iPad #iPadGames...","RT @ComputerTweety: I do believe I have made up a new word LAPLET -- https://t.co/kVphtpZ65D @ComputerAmerica","RT @_ProBarb: @NICKIMINAJ Nicki please follow me","RT @Johntherhino: http://t.co/bdm9kYZB9z. Congratulations Breitbart news! Andrew is smiling. God bless those that continue to fight as he t…","@TheProBeest I\u0027ve watched it like five times this month. Namastey London is simply that good. OMG.","RT @bamtho: “@WanWomack: @bamtho @teamant11 @shann_london @darealcj3 Bam always came in last😳😂😂😂”fuck it😎😂😂","Cannot sleep for shittt!!! Errhhh long day to london tomorrow aswell 😪","Go drop me a comment on my blog. It makes me happy \u003c3 #bbloggers #london","RT @unitedarmy_BDG: NEXT MATCH | Crystal Palace v Manchester United | BPL | Selhurst Park, London | Sun, Feb 23rd | KO 00:30 WIB | LIVE on …","RT @JackShipNews: TWO American bankers working in London commit suicide in two days http://t.co/xfADleF0CX via MailOnline\n\nruled non-suspic…","RT @Khaiizar_: I want this 😍😍 http://t.co/kYJIhTG0Dy","RT @MunroeChristine: Great question @K8Tilton! There are KWL Managers in London and Paris, and we have a team of KWL members at our HQ in T…","RT @zayngotstyles: GO HOME NOBODY WANTS YOU HERE I LOVE YOU IM SORRY BUT PLEASE STAY IN LONDON http://t.co/MVLvndWQ6G","IceJJFish got the London look","Edwardian Twitter had a stricter restriction on number of characters than we suffer under today. http://t.co/iB1VNOeVgO HT @evewrites","The singer in London grammar looks like Billie piper and the girl in the ting tings lovechild, just throwing it out there","@iLL4MAT only just sin this bro, bin don\u0027t flop in london ennit","I WANNA MOVE TO LONDON","Tomorrow\u0027s headlines may be about Team Canada\u0027s women but today it\u0027s all Avs! #London #Champs #doitagain http://t.co/LtUI9cPf2S","@bamtho @WanWomack @shann_london @darealcj3 Steve","someone tell me can i get a 16-18 oyster card if i don\u0027t live in london","Go check out http://t.co/rZ8bPaFpxc for a late night/early morning (depending on where you are!) beauty read!!! \u003c3 #bbloggers #london","Nice to meet Cheshire Jr.! Look for the new acquaintances in the streets of London! http://t.co/yzSRvBl3mw #iPad #iPadGames ...","Tonight on #10News \u0026 #CBS. Is Sherlock leaving New York and moving back to London??  #Elementary 10:01pm","@carysmckinnon thanks :) seeing him in London ;D","@ninasusdobrev my queen of london is turning 19","#VOFNUK: Watch the Official Music Video for London Grammar\u0026#39;s \u0026quot;Hey Now\u0026quot; • Highsnobiety http://t.co/R05xwMaTaT","#VOFNUK: mayoral candidate vows less red tape http://t.co/W067xHvOTK","#VOFNUK: Notes From London Fashion Week AW14 « Eclectic Society Online Fashion, Trend and Lifestyle ... http://t.co/gevWuXfyjp","RT @JaredLeto: Music store customers listen to the latest record releases in soundproof listening booths. London, 1955. - http://t.co/DqqCw…","RT @UnionJworld: Tomorrow 9:50am at @HamleysToys London the boys will be signing your dolls! You can get your dolls in store on the day! #U…","RT @NICKIMINAJ: 👍 RT @PS_minaj: @NICKIMINAJ I got the three most important women in my life Minajesty, My Girlfriend, Mum \u0026 Sister💞. http:/…","RT @themetrolondon: They\u0027re back on track now. It\u0027s another win for @LondonLightning: http://t.co/hyqJFSXEjD #LdnOnt","@JackAllTimeLow are you excited to play London on the 8th","#tbt to London, oh how I miss you 🇬🇧 #bigben http://t.co/Mjn6YpdGhX","RT @Arashi_Thailand: [Random Pic] Caster in Olympic 4 times/ Beijing-Vancouver-London-Sochi http://t.co/n4zonAxdyW","RT @sneakerwardrobe: Air Max 1 Liberty of London http://t.co/XgY1it3JDY","“@teamant11: @bamtho @WanWomack @shann_london @darealcj3 oh yea member Greg and Steve was fighting”who won 😂😂","@NICKIMINAJ please follow me please","RT @beyonce_posts: Bey flew to London from her rehearsal in Glasgow to sing one song to her fans and some of you still find something to co…","@Khaiizar_ looooool that says property of abdullah","RT @NormanJamesCTV: Tanner (Taylor) Ferreira and @crusaderBLUE go off on MTS, win Catholic league hockey title. Watch: http://t.co/DGsLTL08…","New Video: Kyle Drake - CoinPunk - Live - Coinscrum - Alternative Stage - London: http://t.co/26mtofT7dq","RT @unitedarmy_BDG: NEXT MATCH | Crystal Palace v Manchester United | BPL | Selhurst Park, London | Sun, Feb 23rd | KO 00:30 WIB | LIVE on …","New Video: Kyle Drake - CoinPunk - Live - Coinscrum - Alternative Stage - London: http://t.co/6wCQnmdArA","It\u0027s halftime in Charles Lorber gym at New London.  The Tigers trail IMS 34-21.","RT @dbeltwrites: Pretty sure I left my favorite leather jacket in Argentina. This sucks. Had it since my first trip to London. :(","RT @YengPLUGGEDin: LONDON on April 11, 2014!!! http://t.co/4PPTRCFjib","RT @SheIsLexx: I wish Chicago would get warm and STAY warm, niggas not feeling all this change in weather ❄️⛄️☀️⛅️☔️","Brick Lane beer festival celebrates best brands to buy - East London Advertiser http://t.co/osHXbAcvjt #bricklane","Brick Lane beer festival celebrates best brands to buy - East London Advertiser http://t.co/LKguRpqX2v #bricklane #london","This looks like a cult gathering and it\u0027s horrifying RT @HistoryInPics A children\u0027s Christmas party in London. 1933 http://t.co/Jo2ixsa8Eg","Major announcements coming from MN strongest record label. 2 New Tours, New Videos, New Music, \u0026 New London dates http://t.co/6GguAVPYF5","Trainee Recruitment Consultant in London, United Kingdom  #Jobs http://t.co/BbP0XH6lWt","@london_BRIDGEit it\u0027s serious, I know. Pray for me 🙏","Kiefer Sutherland films pivotal scenes as Jack Bauer http://t.co/vW85W985QH via @DailyMailCeleb","lovely RT @luxury__travel: A luxury stroll through Mayfair, London \u003e\u003e\u003e   http://t.co/2fcmLoZHrb","BBC Radio 2    A taxi ride to the otherside of London ... Speaking of which, Otherside by Red Hot Chili Peppers #headbangersheaven","man.. im beginning to think ian was too good for london but his ego gets the best of him and thats why i cant decide","Only asking why","Paris is the Capitol of..... London! No England! You silly lady. You don\u0027t deserve money! 💰💸","RT @kate_ground: London Hart – A cold girl from Spunky Angels | Kate\u0027s Chix http://t.co/38Nc7orAls","Off to london🎉","Steal London Fashion Week Trends Straight Off the Runway: \nLondon Fashion Week just came to an end, and we hav... http://t.co/mC9JzpOxjO","London Fashion Week-Inspired Picks: \nLondon Fashion Week is known for its artsy and eccentric style, and we ex... http://t.co/zWv4HDn1yh","Nice to meet The Mad Hatter! Look for the new acquaintances in the streets of London! http://t.co/BEQw86QICc #iPhone #iPhone...","In \u002770 David Bowie performed @ the Roundhouse in London w/ his band Hype, in what he believes was the first British \"glam rock\" performance","RT @crzybtchdiaries: #StoryOfMyLife http://t.co/LMVH1z5d9s","@TheVampsJames Hello! ♥ Can you follow me back please? it will be amazing! Grettings from London :) xx","RT @WW1DAlerts: NEW: Niall at the BRIT Awards in London! (19/02/2014) #217 http://t.co/jLiCY391qA","RT @EdwardAshton30: WORDS OUT CHARLOTTE CHURCH PERFORMING LONDON MARCH 5, AND AGAIN IN CARDIFF ON MARCH 7, *TIME TO ROCK THE HOUSE AGAIN* h…","@NICKIMINAJ  please collier me","@Bo2Master7 Yeah man, like London or Manchester aren\u0027t bad places to visit.","Women of London. http://t.co/csi4TiGuJn","NO GO AWAY STOP HARRY GO BACK TO THE AIRPORT GET ON THE NEXT PLANE TO LONDON AND LEAVE","Have been told to take the Emirates Stadium Tour whilst in London. Game on! :D","RT @HTC_UK: Bye London, hello Milan. Our HTC Ambassadors @FiveFiveFab are off to #MFW very well-equipped with their gold HTC One. http://t.…","but i want our moment fragrance like seriously ikr it\u0027s so cheap in london xd","RT @DavidEnnett: @mrjoshmorgan a refreshing voice for London. Morgan wants to empower citizens | The London Free Press http://t.co/t9bUs816…","#London #Daddyprincess #sleepingBeauty http://t.co/ShZ8yEXZGA","\"@YengPLUGGEDin LONDON on April 11, 2014!!! http://t.co/BFkj50iPLN\"  @imdanielpadilla http://t.co/VtZO5WjHj3","@shann_london @teamant11 @WanWomack @darealcj3 coach steve got in tha pool with and a.i jersey 😂😂","jake bugg please come to London music hall they\u0027ll prolly only be like 30 people but the less the merrier","RT @HistoricalPics: Joe Strummer’s handwritten lyrics for London Calling, 1979 http://t.co/rQJ42vxPKI","RT @KeelyBottoms_: Fuggggg it I\u0027m moving to London","RT @LaDaddyJr: When London move to Indiana \u0026\u0026 Audi go to the Navy, Idk what I\u0027m going to do 😥 They are the only REAL people at East Detroit…","RT @alexalovesbooks: Auto-reads: self-discovery, travel, London, Paris, summer, music #LitLush","RT @traquir: Gordon Brown accuses London of lying over pensions. What side is he on again:)\nhttp://t.co/4O6YRcdrGM\nhttp://t.co/gflYc9CLns #…","@dscalera12 love you!! So thankful for this and you!!","RT @MsTJBrummett: Let\u0027s go to London spring \u002715! Call out meeting next Wed at 6:30 http://t.co/zb3zb6m87q","RT @TNOpenGovt: Ok, silly question, but how did ECD Comish only spend $461 on transportation on 5-day  London trip? #cheapflight http://t.c…","#London in a nutshell. http://t.co/iAuDAsWF7w","Auto-reads: self-discovery, travel, London, Paris, summer, music #LitLush","RT @bestfitmusic: We caught @AuRevoirSimone tonight in London.See the trio in action in our gallery: http://t.co/JARw7Foizq @onebeat_pr htt…","Tefl courses herein london-straight a step out all off in relation with the norm: vBQpkJo","RT @JasmineLuvUxox: niggas be like \"listen to this song real quick\"😩 http://t.co/IiGFScyOSS","You can be certain east end London has.","Nice to meet Jonathan Night! Look for the new acquaintances in the streets of London! http://t.co/HMYVPiOCGV #iPad #iPadGame...","RT @YungsexyMF: What goes around comes around♻️","CTV London: Fans cheer women\u0027s hockey gold http://t.co/W9ZjLblDAY via @CTVLondon","Nice to meet Lady Fleming! Look for the new acquaintances in the streets of London! http://t.co/HMYVPiwtsN #iPad #iPadGames ...","RT @JRONIN: Tune in now to All Elements Radio w/ @Melanin_9 from Triple Darkness. London in the Building. Go to http://t.co/iy3q95h8Sp @WuW…","@shawnwlewis @cmusician London needs a subway and a hundred miles of overpasses... every other city has them; it\u0027s their turn to pay to us!","Putting this back on this week has been a blast back in #London #coventgarden doing things properly @TGIFridaysUK http://t.co/Si0ynk62eW","@TheProofReadr in London and of April beginning of May!","RT @GazGShore: Not a bad view from bed... London!! http://t.co/GxbEGhReBo","Nice to meet Isabella Bellini! Look for the new acquaintances in the streets of London! http://t.co/HMYVPiOCGV #iPad #iPadGa...","Enjoy the Sun by Theophilus London — https://t.co/QANBksL4xD","RT @thxErroneous: @KHALIL_LONDON Look in the mirror bro, you\u0027re the inspiration x","#BeforeampAfter #England #Renovating Kitchen Before \u0026 After: A London Kitchen Goes from Garish Blue to Clean an http://t.co/d4VPGA907L","I dunno, just think we might get better bang for buck from City of London Polis if they arrested someone else than junkies \u0026 the homeless","Could #Adelaide?... Innovation districts appear in cities as disparate as Montreal and London http://t.co/HqlKEoqGWp via @guardian","RT @1000sFollowrs86: 1. RETWEET THIS ✔\n2. FOLLOW EVERYONE WHO RETWEETS ✔\n#FollowPyramid ✔  77","music video of the day: \"Hey Now\" by @londongrammar  http://t.co/UDB2PcL9vz","RT @Mesha_Latrice: “@JayGlizzy_: I wanna stick my dick in Lauren London”so explicit 😂","@ZoeAllen13 hahaha yeah my dad got back from London early","Nice to meet Jane Wright! Look for the new acquaintances in the streets of London! http://t.co/HMYVPiwtsN #iPad #iPadGames #...","@DanceyDancer where in London u off to x","Yuckkkkkk @AyoDre_MySlime","Brit-Tastic Slots Tournament at Sing Bingo: \nSing Bingo\nThe star studded Brit Awards took place in London last... http://t.co/7SjJnFylQl","RT @airfarewatchdog: JFK-London Gatwick nonstop this Oct (other dates available) $636 RT http://t.co/oIDU4QSPgn","These people got kicked out of London square last week so they\u0027re doing the car shows behind my studio....can you not?","Sorry for all the messages @DaisySykes_TW but i thought j would give you some love for London tomorrow 😘","RT @m_carroll9: I\u0027m in love with Chris Brown forever. ❤","Why hasn\u0027t it snowed in London yet? But it\u0027s been raining nonstop since December?","RT @NormanJamesCTV: Tanner (Taylor) Ferreira and @crusaderBLUE go off on MTS, win Catholic league hockey title. Watch: http://t.co/DGsLTL08…","i like mady bowmen strictly cause she\u0027s wearing a bread and I\u0027m about the bread life","#AlanRickman happy birthday :-) is tomorrow but in london is 21 first than america :-)","@JuliaNovaaa We are based in Dallas TX with our team spread in Dallas London and NYC.","@BenParkerMusic  Hey, are you guys playing around London on the week of March 24? The Canadians are coming to town! :P","RT @Scouting4Girls: @laurenaquilina was incredible tonight in London. Stunning. Judging by the size of the queue to get an autograph I expe…","I want to go to London","Criminal is under arrest! Fight the gangs in the streets of London! http://t.co/5zgP9cZ1PJ #Android #AndroidGames #GameInsight","RT @AbuKhadeejahSP: Recently I heard a foolish youth from London going to extremes in praise of #Hajooree like he was \"the Ka\u0027bah\" \u0026 the pe…","Nice to meet Jane Wright! Look for the new acquaintances in the streets of London! http://t.co/5zgP9cZ1PJ #Android #AndroidGames","Milliner Stephen Jones Ties the Knot in London http://t.co/MZInNyjtE1","Just set off on our 5 and a half journey to london, @KingslandRd see you at soccer six🎉🎉🎉","RT @weather_london: #London Feb 21 02:00 Temperature 4C Wind SW 11 km/h  Humidity 87% weather UK .. http://t.co/mXVrzM9aXS","RT @YengPLUGGEDin: LONDON on April 11, 2014!!! http://t.co/4PPTRCFjib","@halfjazmyn mmmh. You did good cuzzo LOL","“@JayGlizzy_: I wanna stick my dick in Lauren London”so explicit 😂","RT @EdwardAshton30: WORDS OUT CHARLOTTE CHURCH PERFORMING LONDON MARCH 5, AND AGAIN IN CARDIFF ON MARCH 7, *TIME TO ROCK THE HOUSE AGAIN* h…","RT @AlLUWAA: These pictures illustrate the suffering of the people of #Bahrain\n@ffenniche\n@UNrightswire\n#London \n#uk\n@gloriahere http://t.c…","well in London","why is harry at LA AGAIN? ITS NOT EVEN A MONTH WHEN HE GOT BACK TO LONDON!!!!","REQUEST: Fortune Said: A Valentine Haberdashers Tale (Haber... by Sue London - http://t.co/quzL26Zo9w","come on they did not go from london to italy in a day\u003e http://t.co/9IKmeIHHlD","Oops. My fault... 😢","@bamtho @teamant11 @WanWomack @darealcj3 was rolling","#London Feb 21 02:00 Temperature 4C Wind SW 11 km/h  Humidity 87% weather UK .. http://t.co/mXVrzM9aXS","Picking up Hunter and Jamie… Home from London!  @rankine911 @Boomer_Gooner (@ Tulsa International Airport (TUL)) http://t.co/GS8SpT3Z4n","I remember you looked out for me when I went to London . #KindHearted #RIP"],"id":38}}