{"4":{"topic":"russian","tweets":["RT @justinwippo: Just found out my Russian physics professor rock climbs. Fucking. Awesome.","RT @AntonAstrey: My crewmate @AstroTerry on his sisth day of Russian food tasting. http://t.co/pvE0SquekE","@GraceAndSeb never, your order book will be full, put on a sexy Russian accent and voila, commission rich.  :-) x","RT @Patwill2: @AresMarsFlack But is she a relation to Russian luger Semen Pavlichenko?","@Breeedawn_ andi is actullly prosecuting a high profile case right now a russian mobster is on trail for murdering a famous rapper lil phat","marcusgilmer: RT : Bob Costas before downing sip of Russian vodka: \"My eyes can\u0027t get any redder!\" http://t.co/HSlgYsuOF2","RT @jalousied: [SWJ OFM] Taemin had the highest luck during their palm reading session but got the wasabi sushi on 1st try in the sushi rus…","RT @DosEquis: .@JohnnyQuinnUSA Apparently, life\u0027s greatest obstacle isn’t a wolverine, it’s Russian doors. http://t.co/SWvEFKINVD https://t…","RT @PoromEmilio: In a Russian Navy Submarine... http://t.co/ahYR0CWpHc","RT @PoromEmilio: In a Russian Navy Submarine... http://t.co/ahYR0CWpHc","RT @CdnPress_Sports: \"Injured Datsyuk practises, says he\u0027ll play in Russia\u0027s opener vs. Slovenia\" by Stephen Whyno (@SWhyno) http://t.co/3Z…","4 Stars ~\"Is there a Russian word for men who bully women?\"...\"We call them Americans.\" #WWII #mystery #artwork F http://t.co/yK1phHHqHZ","@AresMarsFlack But is she a relation to Russian luger Semen Pavlichenko?","Then there\u0027s snowboarder Vic Wild, born in White Salmon, now #TeamRussia - in 2011 he married Russian snowboarder Alena Zavarzina.m...","@sunbunny254 Mayday! / What the heck is that? / Why, that\u0027s the Russian New Year. We can have a parade and serve hot hors d\u0027oeuvres...","RT @BinduRai: @Mr_Zii My account was hacked... nothing as dramatic as a hot Russian spy","the russian women\u0027s curling team tho","Sochi toilets.. Just need abit ov Russian TLC.... http://t.co/KVokzBGbH0","RT @FOXSportsLive: The Russian hockey team\u0027s top line: Alex Ovechkin. Evgeni Malkin. Alexander Semin. \n\nYeah. They\u0027re good. #Sochi2014","RT @Laurion_: Misha means little bear in Russian *w* my life is complete now!","@santos_ldn yes off today, I\u0027m never going to Russia or buying Russian vodka","The Moscow Exchange  -  The Heart of the Russian capital markets  -  http://t.co/mXCQiMWFoY","Russian Processor Brings Customs Payments to the Web http://t.co/aL73O0XIsv  #news outside sources","ArtsBeat: Russian Ballerina’s Concussion Prevents Performance http://t.co/QzEHagLXIo #arts","Well that cute Russian girl won haha\n#Curling","RT @RedmondMarc: Berlin Then and Now - Russian Soldiers and knocked out Tiger Tank at the Brandenburg Gate 1945 - 2012 http://t.co/0eDBJ5XW…","Russian women\u0027s curling team is way hot #Olympics2014","RT @ShuttleAlmanac: New Pic 2 - Russian #Proton rocket goes for fuelling at Baikonur, on Feb. 14 will launch #Turksat4A http://t.co/CPFQzWg…","Russian hockey star Alexandre Ovechkin answers questions from the world press. http://t.co/IemQ1L8Nss","What?! I got russian rolled?","RT @PoromEmilio: In a Russian Navy Submarine... http://t.co/ahYR0CWpHc","RT @ShuttleAlmanac: New Pic 1 - Russian #Proton rocket goes for fuelling at Baikonur, on Feb. 14 will launch #Turksat4A http://t.co/lgF2Amu…","The HimalayanTimes: Russia says draft U.N. resolution on Syria aid \u0027one-sided\u0027: MOSCOW: Russian Foreign Minist... http://t.co/IlloAfvGf9","#security Corkow – the lesser-known Bitcoin-curious cousin of the Russian banking Trojan family http://t.co/KX8OtLj913 #infosec","RT @richarddeitsch: Cultural difference: The Russians in the audience (not all press but some) clapped at the end of the Russian men\u0027s hock…","I\u0027m all in on Russian womens Curling now","Russian billionaire saves stay dogs in #Sochi http://t.co/3pNE0NEm94 via @MailOnline @STOPANIMALABUS5 @OpFunKill @Annie_m0use @Foxewise","@BinduRai I saw you losing your shit over flappy bird at Saravna. That looked very classy Russian to me.","Russian natural resources ministry suggests tax deductions to stimulate exploration http://t.co/2LpaSCsqQT","RT @Chris_Gaudy_: So we got @muksbeats @BabylonBeats and myself on the production of #InLivingMemory as well as this Russian dude named Van…","RT @brandonbetkolia: Cover of Daft Punk\u0027s Get Lucky: http://t.co/YS3vRGydoM This is actually pretty impressive for hardened Russian police …","These Russian curling girls are so hot.","Smoking hot Russian curler taught USA a damn lesson.","These Russian curlers... 😍😍😍 http://t.co/tMzJkFQdx2","Russia: Olympics official warns reporter he\u0027ll release secret toiletcam video if Sochi hotel complaints continue http://t.co/HK3wzel0sK","@richarddeitsch Pressure in Russian. (And yes, I know it was a mostly rhetorical question, but I\u0027m bored!) ... http://t.co/Grc4wmdLjl","Authorities to spend RUB 16bn on Smaller Moscow Belt Railway in 2014: Russian Railways (RZD) has committed RUB... http://t.co/W3dM8IUr6n","15-year-old Olympic Sensation - First Russian gold in Sochi http://t.co/V8uSwCUs0o","Crazy russian adrenaline junkies - http://t.co/zBosa4XEKE #russia #Miscellaneous http://t.co/tELM5DzqW4","RT @RedmondMarc: Berlin Then and Now - Russian Troops take victory snapshots at the Brandenburg Gate Berlin 1945-2013  http://t.co/2jvFEUq5…","met with Al Lindrum a french leopard, russian bear and a bulgarian monkey in Cologne. So they made some music and... http://t.co/xgzSKGyBqQ","RT @MB_italia: Winter\u0027s Tale review:\"Denied their shot at the American Dream, the Russian couple decided to leave their baby behind http://…","RT @MailOnline: More than 2000 stray dogs in Sochi saved from death by a Russian billionaire http://t.co/8wwCPKWwWm","@almashishani pshh, nigga you love my Russian jokes! Haha","@Kasparov63 Hi, can you tell me the name of that Russian newssite? Or a link?","The Russian womens curling team got some dimes! #Sochi2014 @GarthDmyterko","RT @Breadery: The Winter Olympics isn\u0027t going to have the effect on Russian people Putin desires. \n\nI only watched 5 minutes \u0026 I\u0027ve never f…","(AP) - Captain Pavel Datsyuk says he is healthy for the Olympics after joining the Russian hockey team for its second full practice.","@Airwaysfoodie I had to use my broken (at that time) russian to try and explain. Was tough with a limited vocabulary #TTOT","[voice of russia] Russian Smyshlyaev makes history by winning country’s first ever medal in mogul: February 10... http://t.co/1ueI4sqHuS","Why is the Russian women\u0027s curling team so hot?","RT @RNFutureTense: It really is weird. \u0027Wonderfully weird 1961 Russian kids book about space flight\u0027. http://t.co/SisiG6n6gP (Andrew)","RT @PerezHilton: These 10 States Have Anti-Gay Laws That Are Almost Identical To Russia’s Horrible Policies!! http://t.co/cgLc2D1u7M","Nice dreams last night. I was being hunted by everyone. Ex Girlfriends, Our government, Russian Gov\u0027 you name it, they were trying 2 kill me","RT @scooterbraun: \"Sochi 2014 Olympic Ceremony Get Lucky Russian\" google that. then smile. one of the best things ive seen in a while","My father gets up at five, does weights listening to russian radio and then bikes into the centre of London to work","Russia says draft U.N. resolution on Syria aid \u0027one-sided\u0027\nFebruary 11, 2014 11:32 AM\n\nMOSCOW: Russian Foreign... http://t.co/AFM8JhJD3e","10 crazy ‘Olympic’ foods from Sochi: RUSSIAN food is a little bit different - like these naughty pickles. Here... http://t.co/fHsHC3lN1n","★RETWEET★ 10 crazy ‘Olympic’ foods from Sochi: RUSSIAN food is a little bit different - like these naughty pic... http://t.co/XwmnshxGxh","@j_sonier they were going to reschedule halfpipe but have decided against it.  I think it\u0027ll be the \"walk it off\" Russian cure","RT @IamChrisBowen: This course is not safe! Nobody can land a run. Russian snow is shit. #SochiProblems","@pers0na1 It has changed now; just watched Lang\u0027s METROPOLIS. Next A MAN ESCAPED [then possibly RUSSIAN ARK (Sokurov)] \u0026 THE MASTER last.","RT @steveaoki: Russian Dancing in front St. Basil. #redsquare #aokifyrussia http://t.co/qXlbNvcGKN","@BinduRai for a moment I was so happy that I know a hot Russian spy :p","@BinduRai Must be your well wisher. Or your alternate ego? Split personality? Hacker also tweeted links to Russian news no?","My Daily Russian-calendar is currently  winter sport-themes. Sure it will come in very hand to know Russian for ski and sled...","@harrysfcuk great :-) I\u0027ve just had a test on Russian fml :-)","Veteran nationalist MP blames street protests on too many political parties http://t.co/QbzslWkaOA","Berlin Then and Now - Russian Soldiers and knocked out Tiger Tank at the Brandenburg Gate 1945 - 2012 http://t.co/0eDBJ5XWaS @I_love_Berlin","RT @steveaoki: #aokijump #521. The Aoki x wakaflockabsm #ragethenightaway russian jump. St. Basil\u0027s Cathedral. Red… http://t.co/GMAftyfFy1","#googlesearch Russian Who Lit Sochi Cauldron Apologizes for Racist Obama Tweet: #searchengines ... http://t.co/1RKb0vTEmN #searchengines","Veteran nationalist MP blames street protests on too many political parties: Vladimir Zhirinovsky holds that the... http://t.co/PRhZLUnW5h","ESET Blog Corkow – the lesser-known Bitcoin-curious cousin of the Russian banking Troja... http://t.co/LqlD9PYPbd http://t.co/NTjPDwLl8t","ESET | Corkow – the lesser-known Bitcoin-curious cousin of the Russian banking Trojan family http://t.co/dGE4aVHpRU","This course is not safe! Nobody can land a run. Russian snow is shit. #SochiProblems","Ilya needs to take a proper profile picture that gives his Russian beauty justice","The Russian ladies curling team are talking tactics. It\u0027s giving me the horn.","Russian President Vladimir Putin Rebukes U.S. for Abandoning God and Christian Values by... http://t.co/Bl8TpqbkBu","#sochi hilarious that 2 journalists would ask Russian hockey players about playing US. All of Russia wants to play Canada for gold medal!","RT @Shelby_Pasqua: My body\u0027s starting to get used to Russian time. The Olympics are well worth it !  #upallnight #sleepallday #SochiProblems","Veteran nationalist MP blames street protests on too many political parties http://t.co/WmgafVecmh","RT @visitlondon: NEXT MONTH! Celebrate the arrival of spring at Trafalgar Square’s free Maslenitsa Russian Festival: http://t.co/s2ueJwSoQ5…","@ultimatealeague Russian owner has to sell this club and like that close the mouth up of Sydney fans","Russian women\u0027s curling team defeats USA to run its record to 2-0. Sochi sleeper? http://t.co/SoE0dWsRXk","Some decent sorts in the Russian team tbf","RT @mfa_russia: Of course, the Russian diplomatic traditions date back to more distant times https://t.co/yPVRhZ0gWU @mfa_russia http://t.c…","Veteran nationalist MP blames street protests on too many political parties http://t.co/XEGa1cxa2E - http://t.co/BznI5XB2En","RT @jalousied: [SWJ OFM] Taemin had the highest luck during their palm reading session but got the wasabi sushi on 1st try in the sushi rus…","RT @IIHFHockey: Media follows first Russian practice with NHL players at Bolshoy Ice Dome. #Sochi2014 http://t.co/TydSiSLxYD","RT @MooseAllain: Russian doll sex is ok between concentric adults.","@legsidelizzy @jbcommentator Bradders got to be,he watches 6 Russian footy games a day.He cant have enough time to be inside cricket.","Nyet / How to Say “No” in Russian\nhttp://t.co/eaJhL15v3S","RT @washingtonpost: Russian Olympian apologizes for racist Obama tweet, says account was hacked http://t.co/ZJS1bNBsmC","RT @RedmondMarc: Berlin Then and Now - Russian Troops take victory snapshots at the Brandenburg Gate Berlin 1945-2013  http://t.co/2jvFEUq5…","Northern (Arctic) Federal University and Russian International Affairs Council consolidate cooperation http://t.co/X9Pamrlqfz","Awkward Russian #wedding Photos Are A Whole New Level Of WTF (NSFW) -  When you open up a wedding album, you are... http://t.co/icJMqFe57F","RT @JRekka: 4 Stars \"Is there a Russian word for men who bully women?\"...\"We call them Americans.\" #WWII #mystery #artwork CZ http://t.co…","Russian Hour 4 : Putin On A Ritz  Costarring Kim Jong-un #OlympicMovies @midnight http://t.co/A9dkO2vMR9","“@russian_market: Nice... Very Nice...\nCentral Bank Of Kazakhstan announces devaluation. Kazakh Stock Exchange +7.7% http://t.co/r2p7vNdBUc”","2012 it was the Women\u0027s Brazilian Volleyball team....now in 2014 I\u0027m digging the Women\u0027s Russian Curling Team","Bisexual Dutch Olympic gold medalist Ireen Wust gets hug from Putin Russian President Vladimir Putin has... http://t.co/3ElrMVnPt2","#Russian Toys http://t.co/DASSlEqUGA","RT @BBCWorldTonight: #Russia Ambassador to the UN Vitaliy Churkin tells the World Tonight: \"We are not glued to Assad\" https://t.co/xQrZD10…","RT @mfa_russia: Russia\u0027s permanent representative to #UN Borodavkin: Russia laments Syrian opposition\u0027s line-up in Geneva unchanged http://…","RT @PoromEmilio: In a Russian Navy Submarine... http://t.co/ahYR0CWpHc","Sochi Olympic Games 2014 - Opening Ceremony \nDaft Punk - Get Lucky (Cover by Russian Police) http://t.co/ErL9iUold0","RT @mfa_russia: Comment on terrorist activities in #Iraq from06/02 http://t.co/dffjoyydCe Moscow decisively denounces these criminal action…","RT @peta: URGENT: \n\nRT \u0026 urge Russian officials to STOP THE DOG MASSACRE in #Sochi! http://t.co/7ajFzFF4Vb\n\n#Olympics http://t.co/Gj9fmqVWS6","RT @ForeignPolicy: The Other Sochi: A look at the intimate Russian resort town. Photos by Mikhail Mordasov http://t.co/oQwqO5ieqn http://t.…","RT @JosetteJ1: Oleg Zhivetin (born 18 March 1964) is a Russian painter #art #painting http://t.co/xtJQKpdqeJ RT @AndreaNiloc","RT @AntonAstrey: My crewmate @AstroTerry on his sisth day of Russian food tasting. http://t.co/pvE0SquekE","#Bing Despite Russian Trade Ties, Lithuania Looks to Europe for Bitcoin Regulation Lead Following a string of si... http://t.co/x5ePfZEjDq","13K USD folio for a Russian Model. Soon!!","Seriously. Models. RT“@TuckonSports: I\u0027m as patriotic as the next guy, but I can\u0027t help but cheer for the Russian curling team #ohmyyy”","I have come to the conclusion that. I would f*** the stuffiin out of the Russian female curling team.","Russian women\u0027s curling team is pretty hot. The USA women look like elementary teachers","@Mr_Zii My account was hacked... nothing as dramatic as a hot Russian spy","@Russian___Red be glad when he make it to you ! Lol","Veteran nationalist MP blames street protests on too many political parties http://t.co/esKy2RYJIm via Russia Today #RT #follow #follo...","Assimilate to a certain number reputable toward white russian russian passage software.: jJkKDSS","The Russian Bobsleigh at #Sochi2014 is sponsored by Lada. It will overheat, have cracked rails, and will break down.. cc @ClairevanZuylen","Omg, Anna Sidorova is so flawless. Lord have mercy. Sexiest Russian I\u0027ve ever seen.","RT @ForeignPolicy: The Other Sochi: A look at the intimate Russian resort town. Photos by Mikhail Mordasov http://t.co/oQwqO5ieqn http://t.…","RT @ShantelEDACS: @ELCW_UoB and @Eng_Lang_UoB - can we promise to keep our discussions over poetry or prose civil?! http://t.co/5jsROw7bXY","RT @BinduRai: Guys, my #twitter account has been hacked with #Russian gibberish. Plz bear with me.","RT @JRehling: Tonight, the Russian Revolution is sponsored by Coke.","RT @BluesChronicle: Mourinho sheds light on Abramovich\u0027s shared vision: Chelsea boss claims Russian has stepped back... http://t.co/sHUfQoR…","Olympic Museum’s Russian images promoting sport http://t.co/8kucYmwFDg","RT @KunalBilakhia: I think @BinduRai is an undercover Russian poser for the day. Trying to get stories from the Russian working class in Du…","RT @ShantelEDACS: @ELCW_UoB and @Eng_Lang_UoB - can we promise to keep our discussions over poetry or prose civil?! http://t.co/5jsROw7bXY","Russian state #TV covered up Sochi ring failure -  Modal Trigger View Thumbnails... http://t.co/cL4YUOhukX\n #FishtOlympicStadium #SochiGames","#Sochi2014 Russian team we are! Good luck in future competitions! Defeat all!","RT @BreitbartNews: Sochi Residents Thrown Out of Homes for 2014 Winter Olympics: Russian President Vladimir Putin has another pro... http:/…","RT @Ethnobotanica: Russian dandelions to counter threat of global rubber shortage (not words I expected to see combined) http://t.co/3bRQKB…","I liked a @YouTube video http://t.co/CcNqSZPjhG Het VerZet - Russian Roulette (OFFICIAL MUSIC VIDEO 2014)","@nbcnewscrew Russian Standard vodka! The platinum is delicious!","Wow, the Russian curling team has some #HotHoneys","RT @fast_ua: #Ukraine:  Doubts emerge over Russian aid to Ukraine - euronews http://t.co/AZke6Cnz7G","#Sochi2014 Sports minister satisfied with performance of Russian athletes at Olympics http://t.co/pVq0Y44hQY","RT @FinePickUpLine: I\u0027m not Russian, but I\u0027ll definitely be Putin out tonight. #OlympicPickupLines","I wouldn\u0027t kick this Russian curler out of bed for eating crackers.","How do you say pressure in Russian? http://t.co/f7oUranaXM","The Russian women\u0027s curling team is not ugly #Sochi2014 #curling","RT @jalousied: [SWJ OFM] Taemin had the highest luck during their palm reading session but got the wasabi sushi on 1st try in the sushi rus…","Passed my German course (gee I wonder why lol) level 8 french, think after that I\u0027ll try for Russian :) 🇺🇸🇩🇪🇫🇷🇷🇺","The Russian UFC Fans Daily is out! http://t.co/rTtIXpdD3O Stories via @ryanbader @tarecfighter","3 tweeps unfollowed (goodbye!) me in the past day. Thank you http://t.co/1f9UfjiGXc.","RT @AlArabiya_Eng: #BreakingNews: Russian Foreign Minister Lavrov says draft UN resolution on #Syria aid access is one-sided, detached from…","apparently there is no Russian word for \"sweep\"  this is what i\u0027ve learned this morning...  #Sochi2014 #GoTeamUSA #curling","Veteran nationalist MP blames street protests on too many political parties http://t.co/ZzXDGLJOJF","“@pentimento_: @wlodar85 @przeglad everything bigger in Texas, 22 rims stolen from car lot http://t.co/OFne3ls2Gj cc @russian_market”","@b4_zod I love when my Russian friends do that","RT @rickygervais: Me, \u0026 my evil Russian frog friend, Constantine. @TheMuppets @MuppetsMovie2 http://t.co/3PVV4NDQIA","Icy Hot: Russian curler Anna Sidorova turns heads http://t.co/9mEGFTLjRQ via @FoxSports","My word, I\u0027d forgotten how good looking the whole Russian Womens Curling Team was #iceicebaby #Sochi2014","RT: Veteran nationalist MP blames street protests on too many political parties http://t.co/BUftBhNsVE","HAHAHAAAAHA COK EĞLENDİİM😂✌️ Get Lucky by Russian Police Choir performs Opening Ceremony http://t.co/CF3Oz06JzG","Again, sorry everyone. I am no some covert Russian KGB agent. My account was hacked. Plz hit me up if you still see this gibberish from me.","RT @WTFLifeFacts: A 17 year old Russian girl has a doll-like face but physique of a body builder. She is a powerlifter. http://t.co/fm7qBKX…","RT @KennedyMLB: Have you met  #Russian curler Anna Sidorova, If you needed another reason to watch Curling  #Olympics #Russia http://t.co/f…","RT @lithuaniatribun: Lithuanian and Russian artists were the best at Jelgava\u0027s Ice Sculpture Festival http://t.co/M8opFGzkjq","RT @BeautyofWomen_: Goodnight twitter, leave you with Russian beauty, Maria Anohina. Thanks for following! http://t.co/6voyG90qaD ◄ http://…","RT @jalousied: [SWJ OFM] Taemin had the highest luck during their palm reading session but got the wasabi sushi on 1st try in the sushi rus…","Russian apologies for racist joke. https://t.co/PLdbr0Zko5","@russian_market Nice... Very Nice... #Astana #Devaluation http://t.co/todPEgYXG3","My husband is beyond wonderful. He just emailed to say if I want to send some collars to Russian dog shelter, he\u0027s found a contact address","RT @ForeignPolicy: The Other Sochi: A look at the intimate Russian resort town. Photos by Mikhail Mordasov http://t.co/oQwqO5ieqn http://t.…","WTA Doha : 7/6 7/5 victory for Shuai Peng over the Russian Petrova in the first round. http://t.co/FQ3GtWqANI","Russian Visas And Travel. http://t.co/h5MHWC0V95","RT @AntonAstrey: My crewmate @AstroTerry on his sisth day of Russian food tasting. http://t.co/pvE0SquekE","What are they gonna do with that Russian doll after the olypmics are over? Can I have it for my yard to ward off predators? #slopestyle","@midnight karate kidnapped and sold as a Russian mail order bride #OlympicMovies","The world has a long way to go. Russian MP\u0027s Obama with banana picture sparks racism debate http://t.co/PhbFzqlPkB","In a Russian Navy Submarine... http://t.co/ahYR0CWpHc","Next BREAKING headline on @CNN and @FOXTV:\n\nFigur skaters have to dance under water since it\u0027s too warm in Sochi. http://t.co/apjXnSdrAF","RT @stephan_erich: I give to you Russian curler Anna Sidorova http://t.co/GHnlH60gOk","Get fashion advice from the postman: e-com innovation from Russia http://t.co/kbUtje1yeT","Pavel Datsyuk /  Injured Red Wings star Datsyuk takes part in practice with Russian teammates http://t.co/mcnK5W4Pge #NHL #DET","RT @SPIEF_Economy: Russia-Japan Investment Forum “Opening new areas for Russian-Japanese investment cooperation” - 19/03/14 Tokyo, Japan ht…","Hot and horny amateur video of naughty Russian couple http://t.co/wT7Jq6W7ds #video #anyporn","RT @BinduRai: Guys, my #twitter account has been hacked with #Russian gibberish. Plz bear with me.","RT @cracked: Black Widow elite Russian superspy is a smarter choice. 5 Superheroes Who Should\u0027ve Gotten Movies Before Ant-Man - http://t.co…","Russia says draft U.N. resolution on Syria aid \u0027one-sided\u0027: MOSCOW (Reuters) - Russian Foreign Minister Sergei... http://t.co/hXYs26bhxj","RT @AndrewCatalon Daily #pants update.The Russian coach clearly has #pants envy in our daily look at Norways trousers http://t.co/XLScNsP1Le","Vase - A monument to the first Russian ship \"Saint Nicholas\" - 44-gun frigate .: $390.10 (0 Bids) End Date:... http://t.co/Pc2YVWOv2V","Russian dandelions to counter threat of global rubber shortage (not words I expected to see combined) http://t.co/3bRQKBt6UY","RT @AmnestyUK: How do Russian authorities promoting anti-LGBT laws cope with the fact that Tchaikovsky was gay? @AntHolden blogs http://t.c…","Our home girl rocking our tee\u0027s at Russian Market, Phnom Penh Cambodia. #lokalah #sapotlokal… http://t.co/yjUiUQp92X","russian horror story https://t.co/hNtuJLR4GC","RT @naxosrecords: In honor of the Olympic games in Russia, here\u0027s the The Best of Russian Classical Music! http://t.co/E2LTVCR0xh #Olympics…"],"id":4,"autoSummary":"Russian women\u0027s curling team defeats USA to run its record to 2-0. Sochi sleeper? http://t.co/SoE0dWsRXk"}}