{"44":{"topic":"michael sam","tweets":["RT @JoeBuscaglia: Michael Sam\u0027s audio is posted in full, and I encourage the listen all the way through: http://t.co/gTqMaHtYCa?","RT @nfl: WATCH: Michael Sam speaks to the media at the #NFLCombine http://t.co/F2fHkStKrw","RT @nfl: WATCH: Michael Sam speaks to the media at the #NFLCombine http://t.co/F2fHkStKrw","RT @JoeBuscaglia: Michael Sam\u0027s audio is posted in full, and I encourage the listen all the way through: http://t.co/gTqMaHtYCa?","@dustinbennett76 if michael sam and Manziel landed in Houston, Texans other players can kill any thought of having a local show","Michael Sam: Giants GM Jerry Reese gives great answer to questions ... - The Star-Ledger http://t.co/lJfgM2t9WZ - #SportsTapApp","RT @jwyattsports: Missouri\u0027s Michael Sam said he wants people to see him as a football player, not a gay football player http://t.co/lX9Mso…","RT @caplannfl: This is my 14th #NFL Combine, this is the first time I\u0027ve seen reporters standing on chairs to view a press conference--Mich…","RT @BreakingNews: Michael Sam: \u0027I just wish you guys would see me as a football player, not Michael Sam, a gay football player\u0027 - @MockingT…","http://t.co/HgjZVPI3mo INDIANAPOLIS – Speaking before a media gathering larger than Notre Dame linebacker Manti Te’o  http://t.co/omDswPUCbV","\"@nfl: WATCH: Michael Sam speaks to the media at the #NFLCombine http://t.co/4qm42stuBq\" @GeorgeTakei He is just a guy who loves football","RT @cackman17: Isn\u0027t calling Michael Sam a \"tweener\" a bit riské?","RT @OmarKelly: But the outside world, not the sports world, wants to obsess about Michael Sam being homosexual.Time to move on. He\u0027s not th…","Michael Sam really seems like the perfect person to be the trailblazer...def has the personality to handle it. Id love to have him in Philly","RT @MMehtaNYDN: Michael Sam says no teams that have interviewed him have discussed his sexuality. Only football questions.","RT @JasonLaCanfora: Sam: \"I just wish you guys would see me as Michael Sam, the football player, instead of Michael Sam, the gay football p…","RT @BFeldmanCBS: Michael Sam says he wants to thank all fans especially Missouri fans ..\"M I  Z  Z O U! I\u0027m a Tiger forever.\"","RT @McClain_on_NFL: It\u0027s ridiculous that Michael Sam got to bring his agent into the interview session when others aren\u0027t allowed to.","Thought Jerry Reese had a good answer to questions on Michael Sam today #nyg | http://t.co/Lia9kSsP3b","RT @BFeldmanCBS: Michael Sam says he wants to thank all fans especially Missouri fans ..\"M I  Z  Z O U! I\u0027m a Tiger forever.\"","RT @TomPelissero: \"I just wish you guys would see me as Michael Sam the football player instead of Michael Sam the gay football player.\"","RT @WorldBreaking24: #news Michael Sam at NFL combine: \u0027I just wish you guys would see me as a football player, not Micha... http://t.co/Py…","Michael Sam ready to be known for his football ability: By Darin Gantt Now that he’s made his announcement, Mi... http://t.co/aLP4s0WH7C","Michael Sam ready to be known for his football ability: By Darin Gantt Now that he’s made his announcement, Mi... http://t.co/kmvgBJGL1F","Who cares about Michael Sam, dude wasn\u0027t even in the conversation a month ago. Fact of the matter is he\u0027s a 3rd or 4th round player","RT @billvoth: While most NFL folks have given cookie-cutter answers on Michael Sam, Ron Rivera did not, and it’s awesome http://t.co/HIoNDY…","RT @PatMcManamon: Michael Sam greets media at Combine -- http://t.co/J9jjuaF6IN","RT @NBCSports: \"I feel like I\u0027m Michael Sam.\"\n-- @MikeSamFootball on Saturday, asked whether he felt like a trailblazer.\n\nMore: http://t.co…","Very composed and confident press conference from MIchael Sam. Well done","RT @ESPN_Colin: Michael Sam that is.","RT @NESN: Michael Sam: I Want To Be Known As Football Player, Not \u0027Gay Football Player\u0027 http://t.co/4W8Pdn7jdg","RT @RapSheet: “Heck yeah, I’d like for you guys to say, ‘Michael Sam, how is football?” — Michael Sam","RT @BreakingNews: Michael Sam: \u0027I just wish you guys would see me as a football player, not Michael Sam, a gay football player\u0027 - @MockingT…","RT @ConnorHutyler: Just watched the Michael Sam media session. I don\u0027t know why you wouldn\u0027t want him on your team.","RT @Meyers2419: The cowboys needs a pass rusher. Michael Sam is arguably the best pass rusher in the draft. Jerry will draft him if he\u0027s on…","Michael Sam Discusses Fan Reactions After Coming Out -  http://t.co/YBcrCTLisj http://t.co/6eL5c0edmV","RT @nfl: WATCH: Michael Sam speaks to the media at the #NFLCombine http://t.co/F2fHkStKrw","RT @nfl: WATCH: Michael Sam speaks to the media at the #NFLCombine http://t.co/F2fHkStKrw","RT @daringantt: Michael Sam left the podium with a \"God Bless you\" causing a lot of homophobic religious types to spasm uncontrollably.","RT @NFLCharean: Michael Sam\u0027s agents and publicist were allowed into the media session by the NFL. A first.","I really hope Michael Sam becomes a great player in the league and doesn\u0027t just flame out after a couple years.","Michael Sam\u0027s audio is posted in full, and I encourage the listen all the way through: http://t.co/gTqMaHtYCa?","RT @nfl: WATCH: Michael Sam speaks to the media at the #NFLCombine http://t.co/F2fHkStKrw","Media begging for Michael Sam to be called a fag in a NFL locker room!! ... Smfh they have no clue","RT @nfl: WATCH: Michael Sam speaks to the media at the #NFLCombine http://t.co/F2fHkStKrw","RT @MikeSamFootball: Dave Kopay is a hero and set the table for me and many others. I got to meet him last week http://t.co/sV8AcpLhaO http…","Just watched the Michael Sam media session. I don\u0027t know why you wouldn\u0027t want him on your team.","RT @Big_Bad_Whit: If michael sam doesnt wanna b seen as the gay football player, y did he even need to say anything about being gay fr","RT @nfl: WATCH: Michael Sam speaks to the media at the #NFLCombine http://t.co/F2fHkStKrw","RT @McClain_on_NFL: It\u0027s ridiculous that Michael Sam got to bring his agent into the interview session when others aren\u0027t allowed to.","\"@missnatalienunn: Just watched Michael Sam press conference he better be drafted into the NFL gay or not hes a great FOOTBALL PLAYER#NOH8\"","RT @McClain_on_NFL: It\u0027s ridiculous that Michael Sam got to bring his agent into the interview session when others aren\u0027t allowed to.","michael sam looks like a black joe crabb","RT @BreakingNews: Michael Sam: \u0027I just wish you guys would see me as a football player, not Michael Sam, a gay football player\u0027 - @MockingT…","RT @JasonLaCanfora: Sam: \"I just wish you guys would see me as Michael Sam, the football player, instead of Michael Sam, the gay football p…","RT @ESPN_Colin: Michael Sam that is.","RT @McClain_on_NFL: It\u0027s ridiculous that Michael Sam got to bring his agent into the interview session when others aren\u0027t allowed to.","RT @HandsfulRN: Michael Sam..... don\u0027t care.","@_KS15 @FBall_Josh yet you pass judgement on Michael Sam, who you don\u0027t know. I love hypocrites.","RT @NFLonFOX: \"I just wish you guys would see me as Michael Sam the football player. Not Michael Sam the gay football player.\"","RT @9NEWSSports: Sam- I wish you guys would see me as Michael Sam the football player and not the Gay football player. http://t.co/rTeTl4ak…","RT @JacquesDoucet: I wish you would see me as Michael Sam the football player. Not Michael Sam the gay football player. - Michael Sam. #NFL…","RT @GabeDeArmond: Sam: \"I wish you guys would see me as Michael Sam the football player, not Michael Sam the gay football player.\"","RT @MikeSilver: Going on http://t.co/Y0VrWrNlHj, then @nflnetwork at top of the hour. Then I will write about Michael Sam\u0027s impressive pres…","RT @BigSamSFO28Left: If Michael Sam can deal with homophobia, I don\u0027t want to near that you can\u0027t deal with a gay teammate.","RT @ZavalaA: Michael Sam: \"I just wish you guys would see me as Michael Sam the football player, not Michael Sam.. the gay football player.\"","RT @nfl: Right now on @NFLNetwork RT @Redskins: Michael Sam: \"I just want to do what I love to do, and that\u0027s play football.\" http://t.co/h…","RT @nfl: WATCH: Michael Sam speaks to the media at the #NFLCombine http://t.co/F2fHkStKrw","RT @nfl: WATCH: Michael Sam speaks to the media at the #NFLCombine http://t.co/F2fHkStKrw","Thas mean \"@SergSoSavage: Michael Sam a strong, courageous young man.. As much as I wanna like the kid, I can\u0027t support Butt Piracy ..\"","RT @TDdaily: \"I\u0027m not focusing on anything else but to be on an NFL football team.\" —Michael Sam #NFLCombine","RT @VicTafur: Sam: “I just wish people would see me as Michael Sam the football player, not Michael Sam the gay football player.” http://t.…","RT @McClain_on_NFL: It\u0027s ridiculous that Michael Sam got to bring his agent into the interview session when others aren\u0027t allowed to.","RT @NFLonFOX: \"I just wish you guys would see me as Michael Sam the football player. Not Michael Sam the gay football player.\"","Michael Sam handled media mob like a pro today @NFLCombine. One piece of advice. Cease with speaking of self in third person.","RT @McClain_on_NFL: It\u0027s ridiculous that Michael Sam got to bring his agent into the interview session when others aren\u0027t allowed to.","RT @nfl: WATCH: Michael Sam speaks to the media at the #NFLCombine http://t.co/F2fHkStKrw","“@Jeff_McLane: Missouri DE Michael Sam could become the first openly gay man to play in the NFL\" where did u hear this? Breaking news!!!","#Michael Sam ready to be known for his football ability - http://t.co/DYYHaGLDON http://t.co/hbY6fs8Aup","RT @BreakingNews: Michael Sam: \u0027I just wish you guys would see me as a football player, not Michael Sam, a gay football player\u0027 - @MockingT…","RT @YahooSports: RT @YahooSchwab Michael Sam very comfortable, relaxed. Confident. Does seem very prepared to handle all this attention. Im…","Clouds had all the light skin niggas drake\u0027n it up and the Africans tribe dancing mixed with a little bit of Michael Sam 😂","More to come, but Michael Sam\u0027s press conference was very definitive. He could\u0027ve been swallowed by the moment and ate it up. #NFLCombine","RT @ESPN_Colin: Michael Sam that is.","I\u0027m sick of all; the questions to Michael sam its 2014 people hes gay.. So what.. its 2014","RT @nfl: WATCH: Michael Sam speaks to the media at the #NFLCombine http://t.co/F2fHkStKrw","RT @BreakingNews: Michael Sam: \u0027I just wish you guys would see me as a football player, not Michael Sam, a gay football player\u0027 - @MockingT…","RT @nfl: WATCH: Michael Sam speaks to the media at the #NFLCombine http://t.co/F2fHkStKrw","RT @patrickfinley: Halfway through Michael Sam press conference, an announcement said DTs from Colorado State-Pueblo \u0026 Arkansas St were ava…","RT @Thelonius_Mark: “@ProFootballTalk: Michael Sam is ready to be known as a football player, rather than a pioneer http://t.co/15rANozb2h”…","“@CockyHarbs: Michael Sam is my favorite player in this draft. Quite the inspirational figure. Hope he becomes a Raven”Noooooooooooooooooooo","RT @ProFootballTalk: Michael Sam is ready to be known as a football player, rather than a pioneer http://t.co/rDVYoy2Fdl","RT @ESPN_Colin: Michael Sam that is.","RT @nfl: WATCH: Michael Sam speaks to the media at the #NFLCombine http://t.co/F2fHkStKrw","RT @OmarKelly: Michael Sam came out to the world (he wasn\u0027t hiding it) to do it on HIS TERMS. I can respect that. But it is time for us to …","Michael Sam is 10 months older than Olivier Vernon","RT @VicTafur: Sam: “I just wish people would see me as Michael Sam the football player, not Michael Sam the gay football player.” http://t.…","Isn\u0027t it illegal? RT @adamjahns: Michael Sam says no teams have asked him about his sexual orientation.","RT @missnatalienunn: Just watched Michael Sam press conference he better be drafted into the NFL gay or not hes a great FOOTBALL PLAYER #eq…","It\u0027s ridiculous that Michael Sam got to bring his agent into the interview session when others aren\u0027t allowed to.","@nfl: WATCH: @MikeSamFootball speaks to the media at the #NFLCombine on @nflnetwork http://t.co/dQEqjR12aZ #StandWithSam #mizzounation","RT @nfl: WATCH: Michael Sam speaks to the media at the #NFLCombine http://t.co/F2fHkStKrw","Michael Sam has the biggest guts ever props to him for coming out like that @MichaelSam52","RT @BlkSportsOnline: No need, nothing to hide, which was point RT @ChronBrianSmith: Michael Sam said no #NFL teams have asked him about his…","RT @patrickfinley: If I wrote down every glowing thing Michael Sam said about Mizzou, we\u0027d be here all night. \"MIZ-ZOU,\" he said. \"I\u0027m a Ti…","Michael Sam ready to be known for his football ability http://t.co/Att6IlaMct http://t.co/ZV4bdak5cc","RT @BreakingNews: Michael Sam: \u0027I just wish you guys would see me as a football player, not Michael Sam, a gay football player\u0027 - @MockingT…","JAC Times-Union: T-U at the NFL Combine: Michael Sam meets the media http://t.co/45QW3LcNsZ","RT @NFLonFOX: \"I just wish you guys would see me as Michael Sam the football player. Not Michael Sam the gay football player.\"","RT @davebirkett: Sam \"I just wish you guys would see me as Michael Sam the football player instead of Michael Sam the gay football player\"","RT @nfldraftscout: You don\u0027t handle a press conference better than Michael Sam did.","Hmm... RT @NFLCharean: Michael Sam\u0027s agents and publicist were allowed into the media session by the NFL. A first.","RT @9NEWSSports: Sam- I wish you guys would see me as Michael Sam the football player and not the Gay football player. http://t.co/rTeTl4ak…","RT @NFLCharean: Michael Sam\u0027s agents and publicist were allowed into the media session by the NFL. A first.","RT @RavensInsider: Michael sam did meet with the ravens according to a league source last night","if michael sam wanted to be known as just a football player then he shouldnt have made an interview on espn to announce hes gay to the world","RT @KegsnEggs: Michael Sam is so calm, so cool with this frenzy. Remarkable job.","RT @ESPN_Colin: Michael Sam that is.","Will be interested to see how Michael Sam sparks thinking on gender expression and the tenability or lack thereof of masculinity/femininity.","RT @nfl: WATCH: Michael Sam speaks to the media at the #NFLCombine http://t.co/F2fHkStKrw","Thought this Michael Sam story had an expiration date smh","RT @BFeldmanCBS: Michael Sam: I\u0027m not focusing on anything else other than earning my spot on an NFL team.","All I hope for is that Dallas doesn\u0027t draft Michael Sam","RT @ESPN_Colin: Michael Sam that is.","RT @missnatalienunn: Just watched Michael Sam press conference he better be drafted into the NFL gay or not hes a great FOOTBALL PLAYER #eq…","RT @MartyCaswell: Michael Sam \"I just wish you guys would see me as Michael Sam the football player instead of Michael Sam the gay football…","RT @DarioJukic_: Almost every question these people ask Michael Sam is something to do with him being gay. He\u0027s a football player. Ask him …","RT @NFL_CFB: Sam: I hope people see me as Michael Sam the football player, not Michael Sam the gay football player.\"","RT @9NEWSSports: Sam- I wish you guys would see me as Michael Sam the football player and not the Gay football player. http://t.co/rTeTl4ak…","RT @MMehtaNYDN: Michael Sam says no teams that have interviewed him have discussed his sexuality. Only football questions.","RT @nfl: WATCH: Michael Sam speaks to the media at the #NFLCombine http://t.co/F2fHkStKrw","RT @nflnetwork: The scene at Michael Sam\u0027s press conference. #NFLCombine http://t.co/qaHltKHV87","RT @Redskins: Michael Sam: \"I just want to do what I love to do, and that\u0027s play football.\" http://t.co/ZdvMDELH3T","Something is weird that the SEC DPOY and 1st TM AA is a 3rd rd projection. Send him to Nashville pls RT @ESPN_Colin: Michael Sam that is.","RT @nfl: WATCH: Michael Sam speaks to the media at the #NFLCombine http://t.co/F2fHkStKrw","RT @ESPN_Colin: Michael Sam that is.","RT @ESPN_Colin: Michael Sam that is.","RT @AndrewMoore84: Michael Sam did great in his interview today, real classy yet funny. If you are against his journey to the NFL, I\u0027m not …","RT @nfl: WATCH: Michael Sam speaks to the media at the #NFLCombine http://t.co/F2fHkStKrw","RT \"@jeffphowe: Michael Sam: \"I’m a pass rusher, so if you put me in a situation to get the quarterback, I’m going to get the quarterback.\"”","RT @adbrandt: Michael Sam: \"If Miami Dolphins drafted me I\u0027d be excited\" Translation: \"Richie won\u0027t be there.\"","RT @nfl: WATCH: Michael Sam speaks to the media at the #NFLCombine http://t.co/F2fHkStKrw","Halfway through Michael Sam press conference, an announcement said DTs from Colorado State-Pueblo \u0026 Arkansas St were available. #Goodluck","#NFL Michael Sam ready to be known for his football ability - Now that he\u0027s made his announcement, Michael Sam wan... http://t.co/8lX2aOmyOi","#PFT Michael Sam ready to be known for his football ability - Now that he\u0027s made his announcement, Michael Sam wan... http://t.co/yoY6CmYwpc","RT @MotionVideoChi: Michael Sam, coming \" out\" before the NFL draft gets you lots of attention #NFLCombine http://t.co/II4febjQ4K","Michael Sam is a football player....nuff said. #focusonfootball","RT @BreakingNews: Michael Sam: \u0027I just wish you guys would see me as a football player, not Michael Sam, a gay football player\u0027 - @MockingT…","RT @MotionVideoChi: Michael Sam, first openly gay football player, faces media at #NFLCombine http://t.co/FSIsb1xYjb","Michael Sam a strong, courageous young man.. As much as I wanna like the kid, I can\u0027t support Butt Piracy ..","RT @nfl: WATCH: Michael Sam speaks to the media at the #NFLCombine http://t.co/F2fHkStKrw","RT @nflnetwork: Michael Sam: \"I haven\u0027t been paying attention to the media at all.\"","Michael Sam ready to be known for his football ability - http://t.co/x5D4jGbI1H http://t.co/94JHtgq0lF","#Sports: Michael Sam ready to be known for his football ability - http://t.co/VA4p6OvCed http://t.co/a7Ku4wfes2 #MixAlotDjz","RT @ZavalaA: Michael Sam: \"I just wish you guys would see me as Michael Sam the football player, not Michael Sam.. the gay football player.\"","Video: A view of the Michael Sam press conference .. http://t.co/mLu9IO7spn #Seahawks #NFL","He made it clear before combine, no? RT @ChronBrianSmith: Michael Sam said no #NFL teams have asked him about his sexual orientation.","RT @nfl: WATCH: Michael Sam speaks to the media at the #NFLCombine http://t.co/F2fHkStKrw","RT @Christian7_A: \"I just wish you guys would see me as Michael Sam, the football player rather than Michael Sam, the gay football player.\"…","“@NFLCharean: Michael Sam\u0027s agents and publicist were allowed into the media session by the NFL. A first.”","This is why Michael Sam\u0027s stock dropped when he came out. \n\nhttps://t.co/xV0NRJpq0O","RT @9NEWSSports: Sam- I wish you guys would see me as Michael Sam the football player and not the Gay football player. http://t.co/rTeTl4ak…","RT @ESPN_Colin: Michael Sam that is.","He owned the media @nfl: WATCH: Michael Sam speaks to the media at the #NFLCombine http://t.co/LPKPlhmbA7","RT @coreydu: \"I just wish you guys saw me as Michael Sam the football player, not Michael Sam the gay football player\" +1 @MikeSamFootball …","RT @TonyGrossi: #Browns HC Mike Pettine: Can Michael Sam help the Browns win? If he can then there’s a good chance he’ll be a part of our f…","RT @Jenny49_KC: The only thing NFL teams really need to know about Michael Sam is that he\u0027s an amazing Defensive Lineman.","RT @nfl: WATCH: Michael Sam speaks to the media at the #NFLCombine http://t.co/F2fHkStKrw","I wouldn’t be mad at all if the 49ers drafted Michael Sam. Mizzou pass rush for daaaaays.","Michael Sam would be such a good pick. Definite rover skillset, should be able to expand that to other positions.","RT @nfl: WATCH: Michael Sam speaks to the media at the #NFLCombine http://t.co/F2fHkStKrw","Why is someone still running fake account on Michael Sam? Either way @MikeSamFootball is meeting with media at the combine today","Michael Sam ready to be known for his football ability http://t.co/LTEkCCFxic","RT @ESPN_Colin: Michael Sam that is.","People coming into the nfl with battery, cocaine, sexual assault charges, but Michael Sam is labelled a \"red flag\" because he is gay. Smh","Michael Sam doesn\u0027t seem interested in fighting gender norms, which is his right I guess.","RT @JasonLaCanfora: Sam: \"I just wish you guys would see me as Michael Sam, the football player, instead of Michael Sam, the gay football p…","RT @MikeSamFootball: Dave Kopay is a hero and set the table for me and many others. I got to meet him last week http://t.co/sV8AcpLhaO http…","Video: A view of the Michael Sam press conference http://t.co/5Bs34lNuyt","RT @ESPN_Colin: Michael Sam that is.","RT @nfl: WATCH: Michael Sam speaks to the media at the #NFLCombine http://t.co/F2fHkStKrw","RT @ESPN_Colin: Michael Sam that is.","RT @9NEWSSports: Sam- I wish you guys would see me as Michael Sam the football player and not the Gay football player. http://t.co/rTeTl4ak…","RT @JasonLaCanfora: Sam: \"I just wish you guys would see me as Michael Sam, the football player, instead of Michael Sam, the gay football p…","RT @ChronBrianSmith: Michael Sam said no #NFL teams have asked him about his sexual orientation.","RT @MMehtaNYDN: Michael Sam says no teams that have interviewed him have discussed his sexuality. Only football questions.","RT @nfldraftscout: The crowd for Michael Sam\u0027s press conference is unlike anything I\u0027ve ever seen here. More than Tebow or Te\u0027o.","RT @NFLonFOX: \"I just wish you guys would see me as Michael Sam the football player. Not Michael Sam the gay football player.\"","RT @jeffphowe: Sam: \"I just wish you all would see me as Michael Sam the football player rather than Michael Sam the gay football player.\"","RT @ChronBrianSmith: Michael Sam on being labeled inconsistent: \"Winning is hard, buddy.\" #NFL","RT @BreakingNews: Michael Sam: \u0027I just wish you guys would see me as a football player, not Michael Sam, a gay football player\u0027 - @MockingT…","RT @missnatalienunn: Just watched Michael Sam press conference he better be drafted into the NFL gay or not hes a great FOOTBALL PLAYER #eq…","RT @NFLSTROUD: Michael Sam: \"I just wish you guys would see me as Michael Sam the football player instead of Michael Sam the gay football p…","Missouri DE/OLB Michael Sam: \"I’m a pass rusher. So if you put me in a situation to get the quarterback, I’m going to get the quarterback.\"","RT @JasonLaCanfora: Sam: \"I just wish you guys would see me as Michael Sam, the football player, instead of Michael Sam, the gay football p…","Michael Sam gonna go to the steelers @jholla1992","RT @CSNChicago: Michael Sam had a few interested eyes on him today at #NFLCombine and made it clear this week is all about football http://…","Michael Sam that is.","RT @IThrowChairz: I want to watch the NFL COMBINE. Not Michael Sam\u0027s full interview! I don\u0027t give a damn if he\u0027s gay or not, it\u0027s about foo…","RT @RapSheet: Michael Sam steps to the podium \u0026 is asked about #Dolphins locker room. “I’m not afraid about that environment. I know how to…"],"id":44,"autoSummary":"RT @BreakingNews: Michael Sam: \u0027I just wish you guys would see me as a football player, not Michael Sam, a gay football player\u0027 - @MockingT…"}}