{"51":{"topic":"fins","tweets":["Just had to step in on a conversation where a girl can\u0027t fins her ref# for next bus change and the guy next to her is all doom and gloom...","Great to see the Fins win bronze #Sochi2014","Lol...\u0027merica lost to the Fins. Good job. ✌️ #youarentwinter","Hahahaha USA got pumped by the fins","Sweden looked good against Finland. Great penalty killing, smart possession, and they just pushed the Fins off the puck.","RT @caigueral: \"@AgendaCultura:\nRecorda!!! Fins al 23/2:\nFesta dels #Traginers a #Balsareny http://t.co/PMOA0A4ULZ #Bages","Aha you Americans fucked up hard this morning getting slapped by the fins watch the guys in red tomorrow to see how real hockey\u0027s played","“@TSNBobMcKenzie: Selanne and Kimmo Timonen are the two FINs who have played in all 5 NHL OLYs.”@TMVillage there\u0027s your answer.","RT @iSwimSwimSwim: Some fins that don\u0027t murder my feet would be nice","The Americans really caught it today against the Fins. Better luck next time \u0026 congrats to the Fins on getting bronze #Sochi2014","5-0 for the fins ?! Ouch. Poor USA 😂","aww the fins look so happy in their picture","RT @EdwardOReilly1: @marylmcaffry @WINDSONG58 @NDCP777 @gariepyg544 Selanne was amazing for Fins;1st NHL season was 1991-92! He\u0027s 43! And s…","Piranha loves sinking boats with killing fill with, promotion your fins otherwise: .ftd","@marylmcaffry @WINDSONG58 @NDCP777 @gariepyg544 Selanne was amazing for Fins;1st NHL season was 1991-92! He\u0027s 43! And scored 2 goals-","We lost in the finals for brain brawl on BS and America got creamed by the Fins or the bronze medal this day blows","RT @EnjoyingBC: I was trying to figure out why #NBC is showing European soccer, till I learned the Fins took #Olympic hockey bronze from US…","I guess Russia wasn\u0027t that bad considering we just lost to the Fins also. Weak USA just weak","@glitrnglobetrtr @JudeDon93 today was 10am for USA/fins. Canada plays tomorrow at 7","RT @EnjoyingBC: I was trying to figure out why #NBC is showing European soccer, till I learned the Fins took #Olympic hockey bronze from US…","RT @TSNBobMcKenzie: Selanne and Kimmo Timonen are the two FINs who have played in all 5 NHL OLYs.","RT @Smittygun: Damn the Fins really impressed me thus tourney. But no team more than Latvia #WhoTheHellIsLatvia #Unexpected #Gudlevskis","I was trying to figure out why #NBC is showing European soccer, till I learned the Fins took #Olympic hockey bronze from USA 5-0. Got it ;-)","So the us got raped in hockey today by the.fins","RT @THEstanhope_: Gotta give it up for Teemu Selanne and the fins. Awesome way for Teemu to wrap up his Olympic career.","@_HockeyPrincess the fins were wearing white today ...","New fins \u0026 traction pad for my board😻😻💚","@uncagedmonster Hmm, Fins can\u0027t take a joke.","@HeatZombie @AbramsonPBP was it a local guy that asked the fins question?","@SeaWorld you guys spit out lies. Saying that 30% of make fins collapse in the wild when that is FALSE. Fuck you fucking fucks","RT @TSNBobMcKenzie: Selanne and Kimmo Timonen are the two FINs who have played in all 5 NHL OLYs.","Pile of Fins http://t.co/lb3moXnadr","RT @IcewindDaleRP: Wow, Fins beating the US 5-0! #Olympics2014 #USAvsFIN #CanadavsSweden","RT @Haoshea87: Congrats to my Fins 💙 http://t.co/hpZfbNbPg6","RT @hockeynight: GOAL: Teemu Selanne nets his 2nd of the game giving the Fins a 4-0 lead. #FINvsUSA #cbcolympics","RT @Barrieshepley: I think hockey people really are appreciating how great the Swedes \u0026 Fins are in ice hockey (men \u0026 women). Cdn Men have …","I think hockey people really are appreciating how great the Swedes \u0026 Fins are in ice hockey (men \u0026 women). Cdn Men have a big challenge Sun!","waking up to the fins shutting out the americans for bronze #twowordsforya #suckit","Damn the Fins really impressed me thus tourney. But no team more than Latvia #WhoTheHellIsLatvia #Unexpected #Gudlevskis","RT @jayhutfloetz: well deserved bronze medal for the fins, way to bring it #Sochi2014 #USAvsFIN #bronzemedal","already have the ac on in my car #heatwave #notreally","After the Fins\u0027 first two goals, I kind of expecting as much as a 5-0 win for them, and woke up, seeing just that much.","@Fins_up1 first follower!!  #mustbebored","“@guccibelt_: How the hell do the fins beat us 5-0 kinda shit is that”","RT @NatureNews: Wings and fins operate according to some of the same principles. http://t.co/KYXgRUN6GE","Trying to convince myself that the multiple fins I see close to shore at Onslow Beach are just dolphins, not sharks 😳😁","@lkrocak_ @megan_kouri @paige_fossland opposable fins gurl","@ryantannehill1 I hope u see this your my hero + I am your #1 fan! I believe in u and + Fins! A repsonse would make me the happiest kid ever","RT @obscureathletes: @MikeWellsNFL @bomani_jones I feel bad for anyone drafted by the Fins, Michael Sam or not.","fins with kay http://t.co/2U7NQhsBur","RT @spaikin: the fins are on fire! #finland 2, #usa 0 in the 2nd. selanne \u0026 jokinen with goals 11 seconds apart in the bronze medal game. #…","Fins and wings alike share design features: http://t.co/uT7WMzBAxF http://t.co/YjC9k5msXC","Am I the only one who love that fact that fact that Finland won against USA with a 5-0 lol yaaaa you go fins!!!","RT @MFuckYoOpinion: YOU A BITCH NIGGER FINS TRASH\"@DolphinsHaiku: Fuck The Jets:\n\nFuck their stupid chant \nFuck Rex Ryan and their fans\nFuc…","Brilliant result with the Fins thrashing the USA in Ice Hockey earlier! #Sochi2014","YOU A BITCH NIGGER FINS TRASH\"@DolphinsHaiku: Fuck The Jets:\n\nFuck their stupid chant \nFuck Rex Ryan and their fans\nFuck the New York Jets.","RT @patcaputo98: Too bad  #TeamUSA mailed it into against the Fins, but tomorrow will be bright when Sweden beats Canada #ABC (Anybody But …","S.F. vendor busted for 2,000 lbs. of shark fins http://t.co/CkgLkmSw3U","Great to see the yanks get beaten 5-nil by the fins at ice hockey #landofthebrave","Wow didn\u0027t realise the Fins gave the yanks such a spanking in the Ice hockey!","Quite funny seeing the Fins smash the yanks in the ice hockey! #sochi","LOL, \u0027Muricans destroyed 5-0 by the Fins. Talk about rubbing salt into the wounds.","@Cellblock303 @frontrowjon new draft/trade strategy - more Fins.","Fantastic Fins flash five past US. Good luck Canada tomorrow!","RT @TSNBobMcKenzie: Selanne and Kimmo Timonen are the two FINs who have played in all 5 NHL OLYs.","\"@AgendaCultura:\nRecorda!!! Fins al 23/2:\nFesta dels #Traginers a #Balsareny http://t.co/PMOA0A4ULZ #Bages","RT @Society4Science: Fins and wings alike share design features: http://t.co/zsejqqx3P7 http://t.co/Kzskto3bXY","@mjmills23 @riley42276 @GoRdirty30JD some uninspired hockey today, fins beat us up badly","RT @FinsandFluke: Hilton has confirmed it will stop serving #shark fins at all its hotels in the Asia Pacific region.\n\nEffective 1... http:…","“There’s no reason we show up and not piss a drop.” Jonathan Quick on TeamUSA\u0027s loss to the Fins. #AmenBrother","The Fins finishes the US #OlympicHockey team\u0027a wishes to #medal at #Sochi2014 @jondarveau","RT @pewenvironment: Humans kill ~100 million #sharks/yr—reason to applaud @HiltonWorldwide\u0027s fin-sales ban in Asia Pacific http://t.co/iPdX…","MT “@AbramsonPBP: Sam on Fins bulllying: \"If Fins draft me I\u0027d be excited to be a part of that organization...\"” Fins would never draft him","Hilton will stop serving shark fins at all its hotels in the Asia Pacific region: The hotel company will impos... http://t.co/ALg2Rm0MiY","“@NickLenz: Just saw the score of the Men\u0027s USA vs Finland bronze medal game.....whoa. Didn\u0027t expect that.... 5-0 win for the Fins.” 😭😩","fins is poppin","@DamoSpin ask the Russians if they liked the Fins in the quarters.","I\u0027d be lying if I said I didn\u0027t enjoy watching the Fins Beat the hell out of the US, and knocking em out of medal contention lol","@EddieDempsey1 FUQ YESSS 💁 go play for the Fins!!! hahahah","RT @TSNBobMcKenzie: Selanne and Kimmo Timonen are the two FINs who have played in all 5 NHL OLYs.","Woke up and found out USA got shut down by the Fins. Wow.","RT @TSNBobMcKenzie: Selanne and Kimmo Timonen are the two FINs who have played in all 5 NHL OLYs.","Fins sweaters today are so dirty. I want, I want!","@CellyHockey IYO do you think they would have played different infront of Miller? Bronze is a tough one emotionally to play. #fins wanted it","RT @SuSmithJosephy: I wish Fins wasn\u0027t trending because it shows that people don\u0027t know it should be Finns. #FINvsUSA","RT @ComedianTrixx: The Americans are gettin ass punched by the Fins right now","@daisylynchX omg fins comment😂👊","Do fish fins grow back 😐?","@MikeWellsNFL @bomani_jones I feel bad for anyone drafted by the Fins, Michael Sam or not.","RT @josh_native: Fins are making the Americans their bitches","@DanWeissPBP don\u0027t presume all nhlers don\u0027t give a crap like the USA.fins. Swedes, Canadians just as excited as usa was disinterested","@swimswamnews He has fins on!","@RaeEarl Great white shark couldn\u0027t open bag of @walkers_crisps Worcester sauce with it\u0027s fins and just said to hell with it!","Michael Sam on the Fins locker room: \"I\u0027m not afraid about that environment. I know how to handle myself.\"","RT @Society4Science: Fins and wings alike share design features: http://t.co/zsejqqx3P7 http://t.co/Kzskto3bXY","@CitizenCandy @LhillPee61 we are glad olli is ours and the fins played a great tournament and it is safe to come out","I can\u0027t believe I missed the Fins kick Americas ass this morning...","Congrats to the hockey legend #TeemuSalanne and the Fins for winning the bronze medal. What a way to end your Olympic hockey career!","Omo fins dey rock","RT @patcaputo98: Too bad  #TeamUSA mailed it into against the Fins, but tomorrow will be bright when Sweden beats Canada #ABC (Anybody But …","@iowahawkblog Speaking of Finland, notice the terrifying \"fins\" on the tanks in Venezuela? Modelled after the Cuban auto sector.","RT @TSNBobMcKenzie: Selanne and Kimmo Timonen are the two FINs who have played in all 5 NHL OLYs.","If the yanks goalie is \"quick\", what would that make the fins? #USAvsFIN","RT @Big_rafa92: That moment you fins a new stash spot in your car \u003e\u003e\u003e","Just found out the the US got the dicks kick in by the Fins Ahhahahahaha fuck the States!!!!!! Go Canada Go","@abelicc fins a quin punt el govern te el control en les zones orientals? i a Crimea?","@cindyammons it was bad. I think it was either they wanted gold or just didn\u0027t care. Fins dominated the game big time. US penalties galore","RT @jimmybuffett: Fins up Chicago! Jimmy \u0026 the Coral Reefers are headed to the #WindyCity on 6/28! Details: http://t.co/bU1JQGVshy","RT @TSNBobMcKenzie: Selanne and Kimmo Timonen are the two FINs who have played in all 5 NHL OLYs.","Wow, the Fins friggin smoked the Americans.","Tot el meu suport president! \nJunts fins al final, vencerem!!\n@ciu","RT @FinsandFluke: Hilton has confirmed it will stop serving #shark fins at all its hotels in the Asia Pacific region.\n\nEffective 1... http:…","@NHLonNBCSports I guess losing yesterday didn\u0027t affect the Fins?","Lmao US lost 5-0 to the Fins","Still at the rink...didn\u0027t get to watch any of the game but I\u0027m so happy for the Fins! #hellOfAGoalie and love the timeless wonder #Selanne","Board, Bag, Fins, Leash and Wax starting $385.00 bucks!","That moment you fins a new stash spot in your car \u003e\u003e\u003e","Wow USA got blown out by Fins Lol","Those ungrateful yanks.. we give them a chance to actually win a medal, and they blow it big time lol good job fins! #USAvsFIN","Tuukka and the Fins will win gold in 2018.","Rask and the Fins beat team USA and capture the bronze. http://t.co/RVSFiuAmHi","They can\u0027t take what\u0027s mine, someone like me is hard to fins.","Photoset: While still at Bolog Dos, all I did was snorkeling, observe some fishes flipping their fins... http://t.co/cwYDKRoMec","RT @VisualDataPros: Hey #standwithseaworld @SeaWorldPodcast count how many collapsed dorsal fins you see in this #Blackfish vid:\nhttp://t.c…","@walz3737  @russostrib  and the Fins coaching staff. Play as a TEAM!!!","RT @Society4Science: Fins and wings alike share design features: http://t.co/zsejqqx3P7 http://t.co/Kzskto3bXY","RT @TimBenz970ESPN: You can tell by that reaction the Fins cared about winning a medal. Looks like the Americans only cared about losing ye…","RT @TSNBobMcKenzie: Selanne and Kimmo Timonen are the two FINs who have played in all 5 NHL OLYs.","RT @Al__Wilson: Fins just #dickpunched usa","How the hell do the fins beat us 5-0 kinda shit is that","Something tells me after the way the Fins beat up on the US, Sweden\u0027s got a shot at gold","RT @gregmartin119: good for the fins","Party fins...rily had madt fun 2dae http://t.co/FU5lIrFcbJ","In shock over #USAvsFIN game. Selänne had a great game for the Fins.","RT @sportsrage: congrats to teemu selanne . one of the classiest athletes in any sport ever and the fins for a great tourney","The Fins would be taking gold tomorrow if Tuukka had played vs Sweden","If the Fins won against the states 5-0, then shouldn\u0027t we be worried about Sweden vs Canada?","RT @TSNBobMcKenzie: Selanne and Kimmo Timonen are the two FINs who have played in all 5 NHL OLYs.","RT @jodyvance: Wasn\u0027t expecting this. 4-0 fins. #betkesispissed  #Sochi2014","So happy for the Fins, especially Selanne and Oli Jokininen!  Awesome job! Great job men!","RT @gwfins: Beautiful crew RT @RogersThatOne: Finally! The crew washed off the train and got fancied up! @ GW Fins http://t.co/pfGTmKrmS6","Lock him up. http://t.co/mYzQBQXc5o","Brutal says it all. RT @BradfordJohnson:  brutal by USA. Would amateur \"kids\" have given better effort vs Fins? Pro\u0027s \"checked\" out?","RT @goaliefitness: Fuckin fins","RT @TSNBobMcKenzie: Selanne and Kimmo Timonen are the two FINs who have played in all 5 NHL OLYs.","I wna be rae when fins goin down on her","@FinsUSA Wasabi Passion salad dressing - just give me a straw please. Thanks. (@ FINS TropiCali Cuisine) http://t.co/zA0WZgq8mT","RT @MikeyDuggyJr: Pesky fins with the bronze","@BendyRuler the norther you go, the worse it gets. In Iceland they eat rotten shark fins or something.","well somebody said we are bringing home the bronze a little early  maybe it was the coaching.  maybe the Fins heard that comment #USAHockey.","RT @TSNBobMcKenzie: Selanne and Kimmo Timonen are the two FINs who have played in all 5 NHL OLYs.","Follow the Fins tomorrow  on game changer at 11:30 as they take on Cecil Community College at Francis Marion","RT @toodopeBoyes: the fins are a classic example about passion for the game of hockey. youd think they won gold after how happy they acted …","Another beautiful game! Good job fins!","Nokia in MWC 2014...JUST BE READY TO CATCH FINS ON MONDAY","RT @TSNBobMcKenzie: Selanne and Kimmo Timonen are the two FINs who have played in all 5 NHL OLYs.","Even though it was against USA...congrats Jussi \u0026 Olli!! My Fins are so beastly. #gopens","Big Bronze for the Fins!","RT @FinsandFluke: Hilton has confirmed it will stop serving #shark fins at all its hotels in the Asia Pacific region.\n\nEffective 1... http:…","Mirar #MarginCall i sentir-se molt tonto. M\u0027he concentrat fins a adormir-me i res... Vaig a pillar un tros de xocolata #Xinpum","RT @SuSmithJosephy: I wish Fins wasn\u0027t trending because it shows that people don\u0027t know it should be Finns. #FINvsUSA","RT @pewenvironment: Humans kill ~100 million #sharks/yr—reason to applaud @HiltonWorldwide\u0027s fin-sales ban in Asia Pacific http://t.co/iPdX…","Finland beat USA for bronze!? That makes me SO happy, Go Fins! #USASuck #Sochi2014","Fins beat USA fin-nothing...#makessense","@Jay_Clipston oooh minx;) shouldn\u0027t you be at fins?","RT @ScrivensPads: I feel bad for team #USAHockey I wanted them to have a strong showing against the #Fins. Sorry guys #Canada loves ya!","@TMLHotStove 5-0 for the Fins.","RT @ShanuBeta: the fins raped usa... 5-0","RT @sportsrage: congrats to teemu selanne . one of the classiest athletes in any sport ever and the fins for a great tourney","RT @Crypticshock: BREAKING NEWS: Bobby Ryan texted Brian Burke with: \"Man, that was an intense game, filled with intensity... SO INTENSE!\" …","RT @Crypticshock: BREAKING NEWS: Bobby Ryan texted Brian Burke with: \"Man, that was an intense game, filled with intensity... SO INTENSE!\" …","@rthomas_22 Getting a medal was the goal. I didn\u0027t foresee the US getting gold, and once they lost to Canada, I knew the Fins would win","Poor #teamUSA. Those Fins sure did show you the ropes.","@wearegoradio hahahaha I love the Fins!!! I know its weird","@CellyHockey @usahockey cant win if you dont score.  Goal tending was NOT the problem against #Canada nor was it a problem against the fins","@_Confessor \"Fins\" is trending on Twitter in Canada. I could cry.","RT @TSNBobMcKenzie: Selanne and Kimmo Timonen are the two FINs who have played in all 5 NHL OLYs.","Proud @olemissband grandmother watching @OleMissMBB. Fins up, Rebs! #CBSSuperSocial","RT @purcell_95: Maybe the Americans should shut up about Canada considering you just got butt fucked by the fins #merica #canadasgame","http://t.co/6pPi0F3Bmb just out for a rip #fuckcanada come on US u can do better 5-0 to the fins with two penalty shots #fuckusa","U.S. mails it in against the Fins.  Pretty obvious where there focus was and who they wanted to beat \u0026 when that didn\u0027t happen they quit.","RT @Crypticshock: BREAKING NEWS: Bobby Ryan texted Brian Burke with: \"Man, that was an intense game, filled with intensity... SO INTENSE!\" …","@GlobeKPD Kudos for resisting typing \"two fine Fins\".","@Majerly_CFL Bronze medal game is a real character game.  Full credit to the Fins.  Arguably the best team over the last 5 Olympics.","@CBCOlympics so happy for the Fins but heartbroken for the US men. #menshockey","OUCH, us got OWNED and RAPED by the fins 5-0. OUCHHHHHHHH","@SandraOldfield The Fins did the same to Canada in ’98 \u0026 Russia in ’06. Only men’s hockey team to medal in each of the the last 4 Olympics.","RT @TSNBobMcKenzie: Selanne and Kimmo Timonen are the two FINs who have played in all 5 NHL OLYs.","RT @TSNBobMcKenzie: Selanne and Kimmo Timonen are the two FINs who have played in all 5 NHL OLYs.","BREAKING NEWS: Bobby Ryan texted Brian Burke with: \"Man, that was an intense game, filled with intensity... SO INTENSE!\" #Sens #USA #Fins","Awe yah! How you like them apples America! Didn\u0027t even beat the fins for the bronze! #canadaforthegold","http://t.co/cadLYHqOik marianothis: the fins say by 2/28/14 so yeah very: marianothis http://t.co/QXJS5Zg7Fl http://t.co/cadLYHqOik","http://t.co/ioejVXw2Lr marianothis: the fins say by 2/28/14 so yeah very: marianothis http://t.co/S4hvAaU1JY http://t.co/UUQeeS6eNk","marianothis: the fins say by 2/28/14 so yeah very: marianothis http://t.co/3Tr9KRmYA6","Haha I would love to see Kessel\u0027s tears after that loss!!!! Atta be fins","I wish Fins wasn\u0027t trending because it shows that people don\u0027t know it should be Finns. #FINvsUSA","5-0 to the Fins??? Smh","Congrats to the Fins on winning Bronze #USAvsFIN #USAHockey #USA","Woke up to some good news, Fins toasted USA 5-0 haha.... You cant hang USA","Awesome job by my Teemu, Jokinen and his Fins!  Love my Jets!!  Way to kick some American ass!! #FinnishFlash #sochihockey #Sochi2014"],"id":51,"autoSummary":"#Sotshi #Leijonat RT @TSNBobMcKenzie: Selanne and Kimmo Timonen are the two FINs who have played in all 5 NHL OLYs."}}