{"54":{"topic":"roman reigns","tweets":["Roman Reigns is the star of the shield. He should go single. He could be champ on his own #WWEChamber","amn, Roman Reigns looked like a million bucks for min when he took all the Wyatts out! Thank you @wwe for this classic clash! #WWEChamber","@stephencowan94 i know man!! Fucking well gutted for roman reigns!! One more spear n that was it!! Bastard! Well class cunt","RT @aubreysitterson: I want to kiss Roman Reigns and make it all better.","Roman Reigns was a freaking monster in that!","Roman Reigns is the future. What a match. #WWEChamber","Roman Reigns .. I freakin\u0027 LOVE YOU! #WWEChamber","RT @WNSource: Bray Wyatt pins Roman Reigns.\n\nWyatts Win. I Win. Everyone Wins. I May Die Happy. #WWEChamber","Roman Reigns is an actual beast though, fuck these WYATTS cunts.","Roman Reigns once again outstanding, my real winner of that match!!! #BelieveInReigns","I knew the Wyatt family would win, but damn Roman Reigns dominated in that match. #EliminationChamber","@BookerT5x But can we agree Roman Reigns is the chosen one??","RT @aubreysitterson: I want to kiss Roman Reigns and make it all better.","I smell a Roman Reigns\u0027 babyface turn right now. #WWEChamber","Roman Reigns did well but the numbers game caught up with him #WWEChamber","@Jahed_demha roman reigns is sick lol","What a match, this is where roman reigns will leave the shield. #SHIELDvsWyatts #EliminationChamber","Roman Reigns going to be the next big superstar","RT @WNSource: Bray Wyatt pins Roman Reigns.\n\nWyatts Win. I Win. Everyone Wins. I May Die Happy. #WWEChamber","RT @darccfc: Roman Reigns is a beast. #WWEChamber","RT @WNSource: Bray Wyatt pins Roman Reigns.\n\nWyatts Win. I Win. Everyone Wins. I May Die Happy. #WWEChamber","RT @WNSource: Bray Wyatt pins Roman Reigns.\n\nWyatts Win. I Win. Everyone Wins. I May Die Happy. #WWEChamber","RT @mansmithlegend: That Roman Reigns comeback was money. Crowd went crazy for those Superman Punches. #EliminationChamber","RT @NY_Wiseass: The Shield is gonna implode and Roman Reigns is a future champ","@WWEUniverse ROMAN REIGNS is the future. #WWEChamber","RT @WNSource: Bray Wyatt pins Roman Reigns.\n\nWyatts Win. I Win. Everyone Wins. I May Die Happy. #WWEChamber","RT @_NotUrFriend: Roman Reigns is still the fkin man!","What a match!! Love Roman Reigns! #BelieveInTheShield #WWEChamber","but for real..Roman Reigns will be the only one to survive when The Shield is over.","Bray Wyatt vs Roman Reigns. Wrestlemania 30-whatever main event? Yeah, I\u0027m in.","But They Lose And Roman REIGNS Leaves And Becomes The Next Big Star #BelieveInRomanReigns  #EliminationChamber","My girlfriend on Roman Reigns getting kicked in the face: \"No no! Not his face!\" DAMMIT. I guess I have to hate him now.","Roman Reigns Is That Nigga!!! But like I said the Wyatts was gone take this match","The Wyatt\u0027s beat the shield .... roman reigns almost pulled if off tho","the scream that roman reigns was like the one i did today when i went up to the toilet and a random cat was sitting at the top of my stairs","roman reigns is a god damn animal","RT @BryanIsWWE: SPEAR to Harper. Bray Wyatt takes down Roman Reigns followed by Sister Abigail for the 1..2..3... #WWEChamber","RT @WNSource: Bray Wyatt pins Roman Reigns.\n\nWyatts Win. I Win. Everyone Wins. I May Die Happy. #WWEChamber","Roman Reigns has just become one of my favorite wrestlers#excitedforthiskid","Walla wa7sh Roman Reigns, Hardluck","Roman Reigns was unlucky there though, guy\u0027s a fucking brute.","Roman reigns is going to be the champion by wrestlemania 31 as long as wwe doesn\u0027t screw it up. He is too good not to be","Roman Reigns next up","Blah blah yes yes I know my brothers I owe you a lot of money #FeelingUpset man I wanted Roman Reigns to win... grrrrr.....","RT @aubreysitterson: I want to kiss Roman Reigns and make it all better.","RT @WNSource: Bray Wyatt pins Roman Reigns.\n\nWyatts Win. I Win. Everyone Wins. I May Die Happy. #WWEChamber","#WWEChamber Roman Reigns is a beast still","RT @WNSource: Bray Wyatt pins Roman Reigns.\n\nWyatts Win. I Win. Everyone Wins. I May Die Happy. #WWEChamber","RT @WWExtraa: #WWEChamber Roman Reigns took on all three members of the #WyattFamily but then Bray come out on top and performed the sister…","#WWEChamber Noooo shield not win .. But roman reigns is amazing *-*","The Wyatt Family defeats The Shield via a Bray Wyatt \"Sister Abigail\" to Roman Reigns. #WWEChamber #T3Nlive","WOAH WOAH WOAH! Bray Wyatt just pinned ROMAN REIGNS! #SHIELDvsWyatts #WWEChamber","RT @Jagnarok: What a reception for Roman Reigns! #WWEChamber","RT @GstackGeorge: WHAT A FINISH!!! Bray Wyatt pins Roman Reigns! He is WITHOUT a doubt the BEST thing going in wrestling. @WWEBrayWyatt @ww…","Roman Reigns managed to handle the 3-on-1 like a real #wwe superstar #SHIELDvsWyatts #WWEChamber","RT @dea7rko: Superman punch!! You go Roman Reigns! #WWEChamber #SHIELDvsWyatts","RT @J4CKMULL: Roman Reigns is sickkkkkk!","@Marlon1905_ Nah Roman Reigns went Ham IDC he should have won it","RT @GulfstreamFLY: Roman Reigns bout to take over tho","Why is roman reigns always left alone ?","RT @aubreysitterson: I want to kiss Roman Reigns and make it all better.","RT @REAL_WFHD: Roman Reigns coming back http://t.co/8OqJFkYOEz #WWE #WWEChamber #EliminationChamber Follow and @verified @Wrestlin_Museum","Just a matter of time y\u0027all was gonna turn on Roman Reigns for getting a push... lol","Bray Wyatt just put Roman Reigns in the ER all that hype the shield got and they couldn\u0027t even beat the Wyatt Family😂😭 #WWEChamber","RT @J4CKMULL: Roman Reigns is sickkkkkk!","What a performance by Roman Reigns though","Fucking hate how they\u0027re making Roman Reigns look like he\u0027s the better wrestler out of The Shield because he\u0027s not.","RT @mattykirk_: Roman Reigns is the future of the WWE #WWEChamber","Roman reigns real","Roman reigns might be my favorite wrestler he juss needs to leave the shield #EliminationChamber","HOLY SHIT!!!! THAT MATCH THO!!!! THE WYATTS WIN!\n\nROMAN REIGNS STEALS THE SHOW!!!!","Mark my words we see dean ambrose vs roman reigns for us title at wrestlemania #WWEChamber","RT @WNSource: Bray Wyatt pins Roman Reigns.\n\nWyatts Win. I Win. Everyone Wins. I May Die Happy. #WWEChamber","What a amazing match with awesome spots \n\nThese 6 guys put everything on the line roman reigns and bray Wyatt future stars of the business","RT @GstackGeorge: WHAT A FINISH!!! Bray Wyatt pins Roman Reigns! He is WITHOUT a doubt the BEST thing going in wrestling. @WWEBrayWyatt @ww…","The Wyatt Family gana la pelea contra The Shield!!! Un Sister Abigail sobre Roman Reigns #WWEChamber #FollowTheBuzzards","RT @DerekSabato: Say what you will but the booking of Roman Reigns is probably the best thing WWE has done in 8 years. #WWEChamber","The Shield is gonna split up so Roman Reigns can become a heavyweight champ. Heard it here first people","Yeaaaa bby fuk Roman reigns wyats","NOOOO!!! Roman Reigns was doing SO GOOD!!HE WAS THE ONLY 1 LEFT!! Bray Wyatt just had to do the Sister Abigail!!! :( SHIT!! #WWEChamber","Roman Reigns made it. He has next.","Ya have to let Roman Reigns fly solo after this @WWE","apparently I live in a house full of people who think roman reigns is cool and beards are gross...#the daughters have spoken they are a","HELL of a match, man... Ready for the Roman Reigns face turn now RT @BlkSportsOnline: Well that was a quite a match","No fucking doubt. Absolutely special. RT @ExtremeGamer: Roman dominated the Rumble as well. Future of #WWE is Bray Wyatt and Roman Reigns","RT @KeepItFiveStar: Seth Rollins is dead. Roman Reigns is dead. Dean Ambrose is hiding behind Renee Young.","@marqmanner Holy crap that match just stole the Show!! Roman Reigns is a beast!!!!","Roman Reigns is so decent","Roman Reigns is the man! #SuperManPunch","Great match roman reigns is a freaking beast that was awesome #WWEChamber","Roman Reigns just gets more and more impressive.","Such bs roman reigns basically is #theshield no doubt in my mind roman reigns could take anyone 1v1","Oh my god what a freaking match. Roman Reigns is the man","Roman Reigns is the best #WWE Star right now better than Ortan and Cena ..... Bray Wyatt is up there #WWEChamber","Roman Reigns u were awesome!! #WWEChamber","@matt_hamzah Roman Reigns put up a great fight but 3 on 1 was too much! Wyatt menang! Reigns is the future of WWE!","What a fucking match. Roman Reigns is god.","Roman Reigns showing that he\u0027s the POWER for the Shield. As much as I love Dean. #WWEChamber","RT @mattykirk_: Roman Reigns is the future of the WWE #WWEChamber","Roman reigns is a beast but the numbers caught up with him, that\u0027s a shame #believeinreigns","The Wyatt Family beats The Shield omg that match was insane. That boy Roman Reigns what a beast #WWEChamber","@TAllen0919 It\u0027s a great feud I\u0027m just not a huge Roman Reigns fan.","I believe this is the second time Roman Reigns was pinned. #WWEChamber","Roman Reigns is a godamn star man. What a great natch. Props to #WWE for giving it the time it deserved. #WWEChamber","RT @aubreysitterson: I want to kiss Roman Reigns and make it all better.","Roman reigns murdered fuck the wyatts tho lol","Poor Roman Reigns he took all the licks @TheShieldWWE Congrats Wyatts #WWEChamber","Roman Reigns is out of rate!!! #WWEChamber","Roman Reigns is all the money. #WWEChamber","Roman Reigns and the recycled spear","@wnwdotcom.\n\nBut Roman Reigns and Bray Wyatt have good bloodlines though.\n\n#WWEChamber.\n\n#FansMarkingOut.","RT @WNSource: Bray Wyatt pins Roman Reigns.\n\nWyatts Win. I Win. Everyone Wins. I May Die Happy. #WWEChamber","That match was fucking quality roman reigns is a machine and bray Wyatt","RT @WNSource: Bray Wyatt pins Roman Reigns.\n\nWyatts Win. I Win. Everyone Wins. I May Die Happy. #WWEChamber","I said it over a year ago when people were talking about Rollins and Ambrose,  Roman Reigns is the STAR!","The Wyatt Family defeat The Shield after a Sister Abigail to Roman Reigns! #WWE #EliminationChamber","Roman Reigns needs a title run! #WWEChamber","Roman Reigns is going to be the next John Cena and then we will all hate him. #WWEChamber #EliminationChamber","RT @KeepItFiveStar: Seth Rollins is dead. Roman Reigns is dead. Dean Ambrose is hiding behind Renee Young.","they made it seem like Roman Reigns could take everybody, but eventually the numbers game won. Bravo. #WWE #WWEChamber","Damn the shield lost. Roman reigns is still that nigga though","I will buy any amount of Roman Reigns merchandise #WWEChamber #SHIELDvsWyatts","RT @WNSource: Bray Wyatt pins Roman Reigns.\n\nWyatts Win. I Win. Everyone Wins. I May Die Happy. #WWEChamber","#WWEChamber wotta match wyatts vs the shield great heart roman reigns u r a champion in the making","ROMAN REIGNS IS A G...","That\u0027s the first time that I\u0027ve seen Roman Reigns being pinned #WWEChamber","RT @twilliford05: What a match. Roman Reigns is a monster. #WWEChamber","After an AMAZING 6-man tag, Bray Wyatt delivers the Sister Abigale to Roman Reigns for the victory.\n#WWE #WWEChamber","Roman Reigns is that nigga","An AMAZING MATCH! But the Wyatt\u0027s picked them apart!:( a very game Shield and Roman Reigns did great! Rollins was game, Ambrose vanished","RT @Shane184: Roman Reigns is the man. Dude oozes star power","also...i would totally have Roman Reigns babies. #GroupieTweet","RT @WNSource: Bray Wyatt pins Roman Reigns.\n\nWyatts Win. I Win. Everyone Wins. I May Die Happy. #WWEChamber","RT @TsunamiJaysuke: Roman Reigns wins this, his a legend. Future WWE Hall Of Famer. #WWEChamber","this is was silly 3 on 1 where\u0027s the referee #SHIELDvsWyatts 3 against Roman Reigns #WWEChamber","RT @WNSource: Bray Wyatt pins Roman Reigns.\n\nWyatts Win. I Win. Everyone Wins. I May Die Happy. #WWEChamber","RT @CultOfDuality: Bray Wyatt hits Sister Abigail on Roman Reigns, and The Wyatts defeat The Shield. Awesome match! #wwe #WWEChamber #Elimi…","Best 3 on 3 ever! Wyatts win tho.. Unlucky roman reigns   #SHIELDvsWYATTS","The Shield should\u0027ve won that match....they had it !! Roman Reigns could\u0027ve done it too by himself #WWEChamber","RT @Rawr_simba: Roman reigns have super man punches and spear everyone #WWEChamber","RT @SourceRyan: Heyyyyyyyyyyy Roman Reigns. #WWEChamber","RT @CultOfDuality: Bray Wyatt hits Sister Abigail on Roman Reigns, and The Wyatts defeat The Shield. Awesome match! #wwe #WWEChamber #Elimi…","RT @WNSource: Bray Wyatt pins Roman Reigns.\n\nWyatts Win. I Win. Everyone Wins. I May Die Happy. #WWEChamber","Roman Reigns is a beast. #WWEChamber","RT @WNSource: Bray Wyatt pins Roman Reigns.\n\nWyatts Win. I Win. Everyone Wins. I May Die Happy. #WWEChamber","RT @BryanIsWWE: Roman Reigns is cleaning house. #BelieveInReignsRollins #WWEChamber","what a heap of bollocks, Roman Reigns is far superior to fatty wyatt","Roman Reigns really only has 4 moves: Superman Punch, Spear, Samoan Drop and... I think one other? #WWE","Can\u0027t believe the wyatts won. I can see this match happen again at wrestlemania 30 I am now a Roman reigns fan #WWEChamber epic match","RT @Callum_SR: When I grow up I wanna be Roman Reigns #WWEChamber","Roman Reigns is too good, but not good enough. The Shield have been put in their place by the mighty Wyatt Family. #WWEChamber","RT @WNSource: Bray Wyatt pins Roman Reigns.\n\nWyatts Win. I Win. Everyone Wins. I May Die Happy. #WWEChamber","Roman Reigns is unbelievably bad ass #WWEChamber","I\u0027m 4/5 tonight as Bray Wyatt hit Sister Abigail\u0027s Kiss on Roman Reigns to pick up the win for the Wyatt Family.... http://t.co/VocuBcRI7a","RT @WNSource: Bray Wyatt pins Roman Reigns.\n\nWyatts Win. I Win. Everyone Wins. I May Die Happy. #WWEChamber","Roman Reigns is the man. You can tell they\u0027re going to give him a big push","RT @msAmandaZOUK: Roman Reigns is on all the 3 members!! #WWEChamber #BigMan","Roman Reigns gets pinned for the first time by Bray Wyatt #WWEChamber","Roman reigns will get his moment! Keep working brother! #SHIELDvsWyatts Reigns is a BEAST!!","#WWEChamber #EliminationChamber I knew the wyatt family would win my gut feeling was right what a great match big props to roman reigns tho","RT @VonnyQuest: yo Roman Reigns is that nigga man","RT @Navaid_K: You can tell Roman Reigns is @TheRock cousin!... Looks bang on like him!","RT @WNSource: Bray Wyatt pins Roman Reigns.\n\nWyatts Win. I Win. Everyone Wins. I May Die Happy. #WWEChamber","JEEZ that match was nasty. Roman Reigns is a BEAST","RT @zuzzasherif: Dean Ambrose disappeared, Seth Rollins is knocked out \u0026 Roman Reigns is alone. #WWEChamber","RT @WNSource: Bray Wyatt pins Roman Reigns.\n\nWyatts Win. I Win. Everyone Wins. I May Die Happy. #WWEChamber","The Wyatt Family proves to be too much for Roman Reigns, the last Shield member standing. Fantastic match though.","The Shield is gonna implode and Roman Reigns is a future champ","Wyatts beat The Shield. Bray hits his finisher on Roman Reigns for the 1-2-3. Not great. #WWEChamber #WWE","RT @WNSource: Bray Wyatt pins Roman Reigns.\n\nWyatts Win. I Win. Everyone Wins. I May Die Happy. #WWEChamber","WHAT A FINISH!!! Bray Wyatt pins Roman Reigns! He is WITHOUT a doubt the BEST thing going in wrestling. @WWEBrayWyatt @wwe #WWE #WWEChamber",":: I\u0027ll kiss you better Roman Reigns :) #wwe #elimationchamber","RT @WNSource: Bray Wyatt pins Roman Reigns.\n\nWyatts Win. I Win. Everyone Wins. I May Die Happy. #WWEChamber","RT @Callum_SR: When I grow up I wanna be Roman Reigns #WWEChamber","Fucking hell that match was incredible! There is no topping that! Roman Reigns and Bray Wyatt are going to be big players soon!","ROMAN REIGNS IS GOD","Wow they fooled me! I thought Roman Reigns was gonna win!! #WWEChamber","RT @WNSource: Bray Wyatt pins Roman Reigns.\n\nWyatts Win. I Win. Everyone Wins. I May Die Happy. #WWEChamber","Roman Reigns is AWESOME! #WWEChamber","Roman reigns has a bright future. Gr8 match. #WWEChamber #WWE","@jonastheprince starting to like roman reigns a lot","but roman reigns ago be the biggest ting in wwe soon enuff man nearly take out the wyatt family on him own","At least roman reigns put up a fight","Roman Reigns has to go solo..","Roman reigns has to get a push for the title","RT @WNSource: Bray Wyatt pins Roman Reigns.\n\nWyatts Win. I Win. Everyone Wins. I May Die Happy. #WWEChamber","RT @KeepItFiveStar: Seth Rollins is dead. Roman Reigns is dead. Dean Ambrose is hiding behind Renee Young.","Bray Wyatt pins Roman Reigns with sister abigail ! What a fucking match man ! Hats off to both teams and all... http://t.co/enbHynoCUI","#WWEChamber Roman Reigns took on all three members of the #WyattFamily but then Bray come out on top and performed the sister Abigail \u0026 wins","RT @BryanIsWWE: Roman Reigns is cleaning house. #BelieveInReignsRollins #WWEChamber","Roman Reigns, you badass m*therfucker #WWEChamber","Roman Reigns is what\u0027s best for bussiness #WWEChamber #SHIELDvsWyatts","Roman Reigns gets his superpowers from watching too many John Cena/Randy Orton Matches. #WWEChamber","Don\u0027t Disrespect Roman Reigns Like That Lol - - -\u003e “@Segunomics: Roman Cena lol #EliminationChamber”","RT @punk_lakersx: roman reigns! #WWEChamber","Roman Reigns was brilliant, he needs to go his own way, carring the shield aint going to get him nowhere","RT @WNSource: Bray Wyatt pins Roman Reigns.\n\nWyatts Win. I Win. Everyone Wins. I May Die Happy. #WWEChamber","RT @WWE: Trending Worldwide for #WWEChamber: Roman Reigns (@WWERomanReigns)","The Wyatt Family won. What a match! I liked how Roman Reigns taking them all before Bray ended it! It\u0027s really awesome #WWEChamber #WWE","RT @slaymbrose: ROMAN REIGNS MORE LIKE ROMAN SLAYS"],"id":54,"autoSummary":"RT @WNSource: Bray Wyatt pins Roman Reigns.\n\nWyatts Win. I Win. Everyone Wins. I May Die Happy. #WWEChamber"}}