{"59":{"topic":"carl","tweets":["ok starting walking dead. can we talk abut how carl\u0027s a grown man now? hah","RT @WalkingDeadPrbs: The Walking Dead spoiler:\nTonight, Rick will say to Carl.....\n\n\"Cooooorallllllll\"","@ChandlerRiggs no but #michonne has spray cheese. how could carl say no to spray cheese?","I hope Carl dies in the walking dead he sucks and i hate him","RT @insanityreport: Michonne has already been a better mother to Carl Jr. in 21 mins than Lori Grimes was in 3 1/2 seasons #TheWalkingDead","RT @MidoriKeehl: THIS IS SO PAINFUL TO WATCH BECAUSE ITS LIKE \"NO CARL YOUR BABY SISTER ISN\u0027T WITH ANDRE SHE\u0027S WITH CAROL MEMBER HER\" #twd","RT @TheWalkingHumor: I love the bond Carl and Michonne have #TheWalkingDead","So Carl felt like a parent to Judith. I get it. I understand his feelings 100%. Believe me.","RT @TWDthoughts: Carl and Michonne are bff\u0027s","RT @StephenR369: Michonne is already a better parent to Carl than Lori. #TheWalkingDead","RT @TWDFamilyy: The fact that Carl doesn\u0027t know Judith\u0027s alive and we know.. I think we should tell him guys. SHOUT AT THE TV!!!!!!!! #TheW…","the moment carl dies theres gonna be like 100000 project x parties everywhere","RT @RickFucknGrimes: Carl, Michonne and I are throwing a house party! Bring Your Own Pudding. #BYOP #TheWalkingDead","RT @tbhwalkingdead: I hope Carl is better at keeping secrets than I am…\n\n#TheWalkingDead #TWD","RT @m1key11: No one cares about Carl and Michone get back to Rick and the mother fuckers in the house #WalkingDead","RT @WalkingDeadPrbs: Carl\u0027s going through puberty all he wants is some munchies and porno mags lets give the kid a break","Carl and Michonne bonding is the cutest thing ever #thewalkingdead","BUT JUDITH IS ALIVE. Them not knowing is killing me. I just want Rick and Carl to know she\u0027s okay 😞","RT @sultryzephyr: This is definitely the Carl and Michonne, Dr. Phil episode. #TheWalkingDead #TWD","Get away from Carl, Kevin","RT @Mattribute: carl you fuckstick some people dont wanna talk about loved ones they\u0027ve lost","RT @TheOrangeCone: I love the facial expressions Carl makes when he bites into that @subway sandwich. I smell a Cleo!!!","RT @baddwolfgirl: IT MAKES ME CRY JUST THINKING ABOUT HOW CARL AND RICK WILL BE WHEN THEY SEE JUDITH ALIVE","RT @lorixgrimes__: Of course Rick let Carl name the baby Judith. Rick is the one who named Carl. This is the ZA, not the 1950\u0027s....#TheWalk…","Compare Carl to Walt Jr. bitch ass NOT Jessie...I will react!","THIS EPISODE HAS ME ON THE EDGE OF MY SEAT! I can\u0027t wait for Carl and Rick to find out that Judith is still alive! #sogood @WalkingDead_AMC","RT @ChesyaBurke: Not buying the idea that Michonne is that endured to this boy. Maybe if her son had been older or Carl was less of a pain …","RT @TWDFamilyy: CRAZY CHEESE, THE WALKING DEAD, AND MICHONNE AND CARL ARE TRENDING! NICE.","Damn Michonne is trying too hard to make carl laugh","Let\u0027s not forget how big of an ass Carl was two episodes ago.","RT @baddwolfgirl: IT MAKES ME CRY JUST THINKING ABOUT HOW CARL AND RICK WILL BE WHEN THEY SEE JUDITH ALIVE","RT @insanityreport: Michonne has already been a better mother to Carl Jr. in 21 mins than Lori Grimes was in 3 1/2 seasons #TheWalkingDead","RT @SKISTG: Every episode without Carl is a good episode so this week ehhhhh","RT @TheWalkingNews: Michonnes already a better mother than Lori towards Carl.","RT @TheWalkingNews: Michonnes already a better mother than Lori towards Carl.","@figletynewton yeah, Walking Dead. The one where it was just Rick, Carl and Michone.","RT @tbhwalkingdead: I hope Carl is better at keeping secrets than I am…\n\n#TheWalkingDead #TWD","Carl your sooo sweeet @ChandlerRiggs #TWD","Carl why do you do this to me","RT @TheRickGrimes_: Carl downing a tub of pudding and Michonne a can of cheese, hope they find some fucking insulin. Shit.","Maybe Carl isnt that much of a shithead after all.","RT @DarylsArms_: YES CARL AND MICHONNE, JUST TAKE YOUR SWEET LITTLE TIME. #TheWalkingDead","Someone tell Michonne and Carl don\u0027t go back... @TheWalkingDead @WalkingDead_AMC  . What about Rick??? OMG","RT @i_like_food001: A game of 20 questions with Carl and Michonne while Rick plays hide and go seek #TheWalkingDead","RT @darkheadlights: Wtf are people in the house?? Of course this would happen when Rick\u0027s injured and Michonne and Carl are gone. #twd","I just love Carl #twd","RT @TWDthoughts: I\u0027m liking Rick, Carl, and Michonne together","Carl is like a sour patch kid. He\u0027s sour then sweet. #TheWalkingDead","It\u0027s killing me inside that we know Judith is alive, and Carl thinks she is dead! I just want to grab him and tell him!😭 @WalkingDead_AMC","omgggg rick 😞 Carl \u0026 michonne are gunna be soo close after this though..","RT @KathyG8705: First he\u0027s hungry now he\u0027s tired. What a BABY #carl # walkingdead","RT @WalkingDeadPrbs: Carl\u0027s going through puberty all he wants is some munchies and porno mags lets give the kid a break","RT @TheWalkingNews: Michonnes already a better mother than Lori towards Carl.","RT @WalkingDeadPrbs: The Walking Dead spoiler:\nTonight, Rick will say to Carl.....\n\n\"Cooooorallllllll\"","RT @WalkingDeadPrbs: The Walking Dead spoiler:\nTonight, Rick will say to Carl.....\n\n\"Cooooorallllllll\"","#TheWalkingDead Carl don\u0027t even put Michonne thru that pain by asking her that stuff.","How did Carl go from 40th to 4th? That\u0027s one heck of a pit stop. @FastenalRacing","RT @TheWalkingNews: You\u0027re a buzzkill Carl","Carl done gave up on Judith! Damn! She better disown him when she grows up! Lol #TheWalkingDead","Michonne is totally gonna end up deflowering Carl isn\u0027t she?","RT @TWDthoughts: I\u0027m liking Rick, Carl, and Michonne together","RT @TheWalkingHumor: I love the bond Carl and Michonne have #TheWalkingDead","Michone and Carl gonna come home to some robbers..  #blackmanmentalitt","Wow, Carl, that scene was deeper than your voice.","RT @TheWalkingNews: Damn Carl being all nosy and shit","RT @TWDFamilyy: The fact that Carl doesn\u0027t know Judith\u0027s alive and we know.. I think we should tell him guys. SHOUT AT THE TV!!!!!!!! #TheW…","Rick has more problems then to worry about Carl","RT @KylieexDyrdek: Carl and michones relationship\u003e\u003e","RT @MeetRickGrimes: Probably wasn\u0027t the smartest move to give Carl my gun. #TheWalkingDead","Carl and Lizzie are disliked, sure, but they are frickin survivors and they don\u0027t take crap from noboday","I love the dynamic in Michonne and Carl\u0027s relationship. Not pushed to fulfill the lost child/mother. More delicate, yet fulfilling.","RT @NewGenXMan: Really loving this relationship between Michonne and Carl. Very well developed up to this point. #TheWalkingDead","RT @MeetRickGrimes: Probably wasn\u0027t the smartest move to give Carl my gun. #TheWalkingDead","Carl is still a douche #WalkingDead","RT @haire_jake: Plot twist: michonne and carl walks in on a house party of black people because the zombies are racist like off of key \u0026 pe…","I find myself saying thank you more often than necessary, but then again I find myself being more grateful more often. #enjoygratitude :)","RT @TheWalkingHumor: WHAT THE FUCK. WHO\u0027S IN THE HOUSE CAUSE WE ALL KNOW IT\u0027S NOT CARL. #TheWalkingDead","This whole fucking episode is Misha and Carl talking like no one fucking cares about Mishas life, lets see some god damn action","RT @Rocketqueen418: Carl and Michonne are playing freaking twenty questions while Rick seems to be up a creek without a paddle. @TheWalking…","RT @RayTheDreamer__: Carl, you one nosy MF. #TheWalkingDead","RT @TheRickGrimes_: Carl downing a tub of pudding and Michonne a can of cheese, hope they find some fucking insulin. Shit.","Nice Guy Carl, pretending he believes in an afterlife. #TheWalkingDead","RT @TheWalkingNews: Michonnes already a better mother than Lori towards Carl.","RT @MFuckinMichonne: Come on Carl that was my best Kristy Alley impression.","RT @TheWalkingNews: Michonnes already a better mother than Lori towards Carl.","Michone has baby issues, Carl has baby issues. MY GOSH!","RT @CarolP_TWD: I think this is the first time we can say: \"Carl, stay out of the house!\"","\"ITS NOT EVERYDAY MICHONNE CRACKS A JOKE SO YOU BETTER APPRECIATE IT CARL\" WORDDDDD #TheWalkingDead","RT @J_BiebsFan: Carl is rocking that Frodo flow http://t.co/aDyJ5zmgzV","Much as I love Michonne I\u0027m disappointed in having whole episodes with just her Rick and Carl. Liked last week much more. #TheWalkingDead","RT @KRockCarsen: Carl, you sister has suffered a fate worse than walkers: Lizzie. #WalkingDead","RT @FrontinoAnthony: *Finds Carl trying on dresses*","Carl can\u0027t keep a secret...  He told on Carol. #WalkingDead","RT @CarolP_TWD: I think this is the first time we can say: \"Carl, stay out of the house!\"","RT @YeahMyMother: RT for @Chaosxsilencer. Fav for Carl.","#TheWalkingDead the Carl and Micchione scenes are brutal","RT @El_duderino25: @grimmdrew Carl, I want to hear you say it, \"I am a scumbag.\"","What a sweet moment btwn Carl and a Mishon #TheWalkingDead","RT @RickFucknGrimes: Remind me why I gave Carl my gun?","@Gmseons haha Carl go can handle that.","RT @tbhwalkingdead: Michonne and Carl make a good team because Michonne keeps him from being a little bitch. \n\n#TheWalkingDead #TWD","RT @TheWalkingHumor: I love the bond Carl and Michonne have #TheWalkingDead","@teddy_geardino I hate Carl so","\"@_gc13: “@TheWalkingNews: Damn Carl being all nosy and shit”\"","RT @WalkingDeadLife: Can Carl even handle that gun","RT @DarylsArms_: YES CARL AND MICHONNE, JUST TAKE YOUR SWEET LITTLE TIME. #TheWalkingDead","@MrMeowzers will be thrilled lol RT @TheMockingDead: I just realized... Carl will prob be back tonight. Sigh. #TheWalkingDead","Michonne is the mom Carl should have always had. #TheWalkingDead","RT @ImmortalDixon: Carl is going through puberty like any other teenage girl","RT @MeetRickGrimes: Hey look, everyone\u0027s having a good time! \nAnd then Carl happened. #TheWalkingDead","RT @WhosErtany: Carl be like http://t.co/OBV6MRhFwh","Shameless product plug on #TheWalkingDead! Michonne should have grabbed that issue of Super Dinosaur for Carl, @RobertKirkman.","RT @evan_contento: Carl is a little bitch. Why doesn\u0027t he try and have a good time.. If that was me I\u0027d be the funnest to be with during a …","RT @Sasha_The_Black: As Rick handed Carl the magnum, \u0027I\u0027m a big boy now\u0027 started playing.","Poor Carl doesn\u0027t know his sister is alive","Michonne + Carl \u003d Cichonne. #TheWalkingDead","I think Carl ends a therapist","RT @TheWalkingNews: Michonnes already a better mother than Lori towards Carl.","“@RealAbrahamFord: So it turns out that houses are actually the creepiest places in a zombie apocalypse.” Why Carl was never in them","RT @TheWalkingNews: Michonnes already a better mother than Lori towards Carl.","RT @TheWalkingNews: Michonnes already a better mother than Lori towards Carl.","@D00NBU66Y this times a million. holy shit I don\u0027t care about Carl/Rick","RT @CarlCrew: @ChandlerRiggs Can we have more Carl and Michonne bonding moments? Because they\u0027re amazing! 💕","I love when Michone and Carl bond! #TheWalkingDead","Carl didnt do the baddest bitch of them all","@WalkingDead_AMCThat was a helluva thing for Michonne to find considering what she was just talking to Carl about. Needed a commercial break","Carl needs to be removed from \"the walking dead\" immediately -- tired of this bitch","RT @WalkingDeadPrbs: Carl\u0027s going through puberty all he wants is some munchies and porno mags lets give the kid a break","RT @WalkingDeadPrbs: The Walking Dead spoiler:\nTonight, Rick will say to Carl.....\n\n\"Cooooorallllllll\"","Carl Baxter always makes me smile!  Thanks for a great pic Oliver Cole. http://t.co/vfSUEuL7WB","RT @jonbar123: \"Maybe she and André are together somewhere.\" -Carl\n\nJust rip my heart out why don\u0027t you? #TheWalkingDead","RT @CarolP_TWD: I think this is the first time we can say: \"Carl, stay out of the house!\"","I\u0027m sorry I don\u0027t think I\u0027ll ever like Carl he\u0027s always gonna be that annoying lil brat that never stays in the house #twd #TheWalkingDead","RT @RobbinTheGreat: Shit RT @insanityreport: Michonne has already been a better mother to Carl in 21 mins than Lori Grimes was in 3 1/2 sea…","@MeetRickGrimes you wanna go?!","Carl\u0027s grown. He just comforted Michonne in a way he couldn\u0027t a while back for Carol.","RT @TinaShon: Thank you Carl for clearing Michonne\u0027s son\u0027s name for me. So glad it\u0027s Andre and not Laundry #TheWalkingDead","Carl Grimes- The only character you can want dead one moment and feel bad for the other. #TheWalkingDead","Carl needs to crawl up a tree and die","Wait till Carl sees the baby is still alive he\u0027s gonna shit","RT @IWalkTheDead: Michonne: \"It\u0027s not really a secret.\" Carl: \"It\u0027s still safe with me.\" #TheWalkingDead","RT @SinbadBrookie: \"@Carl_Jones_: Someone just sent me the #TIL trailer. Never felt so happy to be a wool haha\"","RT @RebeccaRotzell: Carl its okay, she\u0027s alive!! ( Just keep her away from Lizzie)\n#TheWalkingDead","I just want Carl and Rick.to know Judith is alive!!!! Is that too much to ask?! #TheWalkingDead","RT @TheWalkingNews: Damn Carl being all nosy and shit","RT @TheWalkingHumor: WHAT THE FUCK. WHO\u0027S IN THE HOUSE CAUSE WE ALL KNOW IT\u0027S NOT CARL. #TheWalkingDead","RT @murrgenCreek: This best friend relationship is the shit #Carl #Mashone","RT @The_GovernorTWD: Carl making up stories about him having friends and shit 😂","RT @RealAbrahamFord: Michonne: \"I never told anyone, until just now.\"\nCarl: \"Your secret’s safe with me.\"\n\nSomeone just punch me in face.  …","RT @DanGheesling: Carl does not deserve to walk around with Rick\u0027s silver peacemaker. #TheWalkingDead","I still can\u0027t believe Carl named his sister after his third grade teacher. That is so sad, his mom \u0026 friend died and he choose his teacher","So is Carl gonna get a taste of that dark chocolate, or what\u0027s being set up here?","RT @The_GovernorTWD: Carl making up stories about him having friends and shit 😂","RT @RealAbrahamFord: Michonne: \"I never told anyone, until just now.\"\nCarl: \"Your secret’s safe with me.\"\n\nSomeone just punch me in face.  …","If Michonne turns Killa Carl back into a person, I\u0027m here for wherever this is going. #TheWalkingDead","@WalkingDead_AMC I find it funny that rick gave Carl is huge python","RT @DLynae: I keep forgetting Carl thinks his sister is dead. As annoying as he is, he\u0027s still just a kid #TheWalkingDead","I love Carl!","Carl\u0027s tryna be pharrell with that hat","@sarapatt LOL agreed Carl is growing pains are giving me a headache","RT @georjielew22: Carl is a lil brat","RT @The_GovernorTWD: Carl making up stories about him having friends and shit 😂","RT @RealAbrahamFord: Michonne: \"I never told anyone, until just now.\"\nCarl: \"Your secret’s safe with me.\"\n\nSomeone just punch me in face.  …","@nerdist @AMCTalkingDead  I wonder who wears the pants in the rick michone and Carl family ?#TheWalkingDead","Like damn, Michonne is cool and everything but nobody want to see grandpa Rick and Carl trying to act cool. Lets be real","RT @Jonafinrox: Carl has been wearing the same shirt since he was like 8 years old. Don\u0027t you think it\u0027s time to change Carl?? #TheWalkingD…","RT @Kevin__Reilly: Carl is such a bitch","I cant wait for the moment Carl and Rick reunite with Judith cause Carl still think his sister dead and shes not #thewalkingdead","TWD is so drawn out nowadays. SOMETHING HAPPEN ALREADY. Idgaf about Carl either. #bitecarl","Carl and Michonne need to quit Nancy Drewing their butts all over the place and get back to Rick #TheWalkingDead","RT @TeamEmilyKinney: Carl.. SHE\u0027S NOT DEAD UGH PLEASE FIND HER THIS HURTS MY FEELS","I do not understand why Carl and Rick are to stupid to realize walkers can\u0027t undo car seat buckles. Use your heads! #TheWalkingDead","RT @ImmortalDixon: If Rick won\u0027t slap the fuck out of Carl, I will.","@twdfamily @thewalkingdead why does Carl wanna believe in heaven for Judith but told carol she was an idiot? @talkingdead","RT @TheWalkingHumor: Carl said \"literally\". what are you a teenage white girl? #TheWalkingDead","RT @TheWalkingNews: Michonnes already a better mother than Lori towards Carl.","Holy fudge Rick why you give Carl your python. Ya idiot.  #TheWalkingDead","“@JamelleMyBelle: RT @insanityreport: Michonne has already been a better mother to Carl in 21 mins than Lori Grimes was in 3 1/2 seasons","RT @Rocketqueen418: Carl and Michonne are playing freaking twenty questions while Rick seems to be up a creek without a paddle. @TheWalking…","RT @FrontinoAnthony: Look Carl I found a picture of your mom","RT @Devarigrande: I still hate Carl with a passion.","I still can\u0027t get over the fact that Carl rather dead baby formula than soy milk!!! Bahahaha soy milk it nasty though 😐","I don\u0027t understand why everyone hates Carl","Carl is actually THE worst 👎👦","@Donevan_38 Carl is nowhere near a man. And I think the audience are going to be the ones who don\u0027t like it.","RT @TWD_Obsessed: Michonne is already a better mother to Carl than Lori ever was.","RT @LollyDaskal: RT @leadershipheart: Nothing happens unless there is first a dream – Carl Sandburg","Michonne + Carl \u003d BFF\u0027s! 😄❤️\n#TheWalkingDead","Way to fuck up a nice moment Carl!! #thewalkingdead","Carl did get his shoe back! #twd #TheWalkingDead","Really loving this relationship between Michonne and Carl. Very well developed up to this point. #TheWalkingDead","Man the Michonne Carl storyline","RT @StephenR369: Michonne is already a better parent to Carl than Lori. #TheWalkingDead","RT @mnmtwinz: \"I\u0027d rather have mom\u0027s breast milk.\"\n-Carl #TheWalkingDead","No one cares about Carl and Michone get back to Rick and the mother fuckers in the house #WalkingDead","RT @WalkingDeadPrbs: The Walking Dead spoiler:\nTonight, Rick will say to Carl.....\n\n\"Cooooorallllllll\"","RT @realsteveng: Carl just knows how to make people feel like shit","RT @hanginwitcoop: Why Carl sound like her future man tho lol damn \"why you askin all dem questions\" 😂 #TheWalkingDead","RT @WalkingDeadPrbs: The Walking Dead spoiler:\nTonight, Rick will say to Carl.....\n\n\"Cooooorallllllll\"","IM GOING NUTS IF RICK MICHONNE OR CARL DIES ILL KILL MYSELF"],"id":59,"autoSummary":"RT @arielle_leal: “@TheWalkingNews: Michonnes already a better mother than Lori towards Carl.” Bc she\u0027s a queen who can deal with peasants"}}