{"63":{"topic":"spurs","tweets":["Why cant Adebayor do this every game? Proves we should play 2 up front every week. Spurs dont do my heart any favours!!","I just want spurs fans to sing \u0027Are you watching Arsenal\u0027.. That will make my day !","OH WHEN THE SPURS","Zozulya May want head to the airport now. #Spurs go ahead with the man advantage starting to show. #UEL","RT @mattiecrook1: Here come the hypercritical spurs fans...","RT @PeersMoron1: spurs are out lmao, no chance of getting 2 more","How many goals had Adebayor scored since he came back in? Seems like a lot. Basically every single one spurs have got #AVB #Genius","I do love being a Spurs fan sometimes! #twonildown #threetwoup","Barney leading MVG and Spurs have comeback from 1-0 down, a cert sending off as well","surely spurs can\u0027t let this slip against ten men","I promise I will do the \"Sherwood Shuffle\" during the next #spurs match @chathamtap #SherwoodShuffle","This Spurs game yeah","@NeilCohen Anything that messes up their league position even more is a good thing. Go spurs!","Leave the pub spurs 1 down.. Back 15 mins later, 3-1 up! #Standard","RT @lukeD___: No way spurs have come back against Dnipro fuck me that is a real achievement","“@aaliyahh_xx: this is why i support spurs” to watch Europa league?","COME ON YOU SPURS!!! 2nd fav team if anyone was wondering!","The longer that \"big club\" spurs stay in the Europa League the better!!!","RT @Squawka: White Hart Lane erupts with noise as Emmanuel Adebayor fires Spurs 3-2 ahead on aggregate. - http://t.co/mHbbchneLx","RT @SpursVines: What a goal. Dnipro 1-3 Spurs, Adebayor. #Vine https://t.co/9IEDoS4XGu","RT @LO1886: The sad thing is, there\u0027s going to be genuine young spurs fans who think winning against a nobody team in the pointless cup is …","Go on spurs keep ruining your season.","RT @owenrankin_: \u0027Come on you spurs\u0027 must be the only thing they cunts shout","Like, I hate spurs as much as I hate Real Madrid. And more so than I hate Chelsea. That says a lot really.","Such a handful Adebayor when he fancies it too good for spurs in afraid","Sorry @BBCSport never a headbutt in a million years - Vertonghen sold it and is going to win #spurs the game.  Guess he should get a raise!","Spurs winning, against 10 men, I believe. \n\nSaints snotting Salford!!!!!","Wow Spurs cheat and score 2 goals and Tim Sherwood thinks he has won the champions league #bodywarmertwat #cantcallyourtheyword","Lol i remember when Spurs fans were ripping us for celebrating when we won the Europa league.. 👀","I hate spurs","RT @GoonerGordo: SPURS COME FROM BEHIND AGAINST A TEAM OF PART TIMERS DOWN TO 10 MEN AT HOME. LEGENDARY.","I\u0027m so full up after a huge dinner.. Oh and being made to eat my words. #spurs","Put a fiver on Spurs at 2/1 five minutes ago. #CashOut","“@Tdixon97: Spurs are wank” #TweetsThatPeopleNowRegret","When did gilets become a thing, Tim? #Spurs","Adebayor has scored an absolute screamer! Still hate spurs #justsaying","AWWWWWWWWWWWWWWWW COME ON U MIGHTY SPURS","RT @Squawka: White Hart Lane erupts with noise as Emmanuel Adebayor fires Spurs 3-2 ahead on aggregate. - http://t.co/mHbbchneLx","“@calumkinnear11: Typical spurs, cheating cunts” cheating?? Explain😳","Can\u0027t help but cheer when spurs scored haha Adebayor is a monster lol on 🔥🔥🔥","We won\u0027t make it, so I hope Spurs get 4th and get themselves in the Champions League next season. Always liked them, always hated Liverpool","RT @pn_neil_allen: Good on Defoe saying farewell to Spurs fans. A nasty cold stopped him waving bye to #Pompey fans. Kept him from being FA…","@_catsaraiva me too honey, me too.\nKeep the faith my friend:-)","Hear hear \"@Andrew_Heaton Don\u0027t care if Spurs staying in the competition suits us, can\u0027t stand the arrogant, entitled little shits.","spurs were 7/1 to qualify. coulda made thousands tonight for fuck sake.","Chico Vertonghen might just have blown this. Spurs might actually get through now.","Ah shite, hate spurs, adebayor in dream team though, every cloud has its sliver lining.","This result for spurs may give them a boost but they were awful 11v 11 too predictable","RT @LeGrove: Oh damn, so annoyed Spurs have Benfica the Thursday before they play us.","When Spurs play well they\u0027re amongst the best in Europe. 3 fantastic goals!","Ahh Spurs ! Adebayor ! Well Soldado is a flop","Tottenham - cheating b*stards! #spurs","Great night for the Spurs by the looks of it. How a red card can change a game... #THFC #UEL","Englund pride restored. Barcelona? Bayern? Uh, Olympiakos? Spurs are beating FC Dnipro. Balance is restored, hyperbole of autopsy nullified.","Spurs showing what Newcastle don\u0027t have in cup competitions. Fire in the belly. #NUFC","Spurs staying in the Europa League can only be a good thing, may Tim waste most of his teams energy on it!","Well how the fuck do did spurs do that loosing 2-0 on aggregate after 47 minutes now winning 3-2 69 minutes gone #WOW 3 goals in 22 mins","RT @PowerBarros96: This doesn\u0027t make spurs good uno lol","@jordanEFCthomas Oh lad don\u0027t start, you reckon you know everything because you put bets on, turn it in, Spurs are shite.","Fuck sake, hate spurs","RT @LeGrove: Oh damn, so annoyed Spurs have Benfica the Thursday before they play us.","It\u0027s really cute seeing how much the Europa league means to Tim Sherwood and Spurs! Nawwh Bless #EuropaLeagueNotChampionsLeague","@thfcaaron fucking hell are you actually comparing Bayern to Dnipro! You really are a deluded spurs fan","Wow spurs turn it round.. At least one London club will stay in Europe for another round","Bloody hell Spurs, you don\u0027t make it easy for us do you?!","RT @MattMorrallllll: Spurs tearing it apart","RT @GoonerGordo: Spurs will make a DVD of this comeback.","Fair okay Spurs great turn around... #europaleague","Find it funny how spurs fans are going mental over winning a two-legged tie against a club called Dnipro.","I need one more Spurs come on!","oh \u0027ello spurs! #cheeky #COYS","now spurs is killing someone! !!!!","Well Spurs have turned that around, since the red card it\u0027s been a completely different game #COYS","RT @PMansonAFC: Spurs going through is good for us. Their QF game is 3 days before the derby. #positives","YES SPURS","RT @DrogsBallacks: if spurs fans were smart they\u0027d be chearing on dnipro","RT @Arsenal4life_: PEOPLE DO YOU NOT REALISE THAT SPURS WOULD HAVE A EUROPA LEAGUE GAME 3 DAYS BEFORE THE NORTH LONDON DERBY IF THEY GO THR…","RT @samCFCrearden: Spurs fans will be able to get this game on DVD next week they\u0027ll be queuing outside HMV\n\nor not","Decent turn around from spurs, but still it\u0027s Dnipro.. They shouldn\u0027t have been in that position to start with","wtf is going on in that spurs game lol","Fucking hell spurs","RT @Lord_Sugar: Adebayor again 3-1 Spurs unbelievable","RT @LifeOfBaha: Spurs don\u0027t deserve Champions League football. Can\u0027t even do shit in the Europa.","Need spurs to score one more for me to win my bet.. Don\u0027t let me down now..","Fair play to spurs!","Spurs fans singing to 300 Dnipro fans your not singing anymore when u couldn\u0027t hear the Spurs fans for 60 minutes","wonder if @djshaunlever is watching #Spurs @Emmaroooo cant wind him up about this one....#unbelievable","Yesss come on Spurs!!","I wish I wish I was at spurs tonight sounds amazing love you #TottenhamHotspur I do","credit far credits due, well played spurs","Spurs will win the Europa league and the premiership they are unstoppable","Go on spurs! Dnipro have totally deserved this #DirtyCunts","If Spurs are eliminated, they just have the Lge to concentrate on, but a win here could galvanise them for the Lge also, I\u0027m confused 😩","Everyone went from saying we had no chance to going insane...gotta love them Spurs","Spurs have done it some how hahahah","Come on spurs! Put it out of reach. My little cousin is at his first game at the lane. Give him a massive win to remember! !","Get in spurs !!","I actually want Spurs to win...what\u0027s wrong with me!?","RT @StanCollymore: Come on Spurs!!","@27scottmilligan you have spurs on at 7/1? Kicking myself now so close to sticking a 5er on","RT @LeGrove: Oh damn, so annoyed Spurs have Benfica the Thursday before they play us.","I feel like being a Spurs fan has better equipped me for understanding people with mental illnesses.","RT @MjHegarty_: Wat a comeback from spurs :D","fair play to spurs for getting two in concession but look at the team you are against, there shouldn\u0027t even be a chance of you going out","It\u0027s a nice turn around Spurs but it was a shameful dive to get the red. Embarrassing.","RT @LO1886: The sad thing is, there\u0027s going to be genuine young spurs fans who think winning against a nobody team in the pointless cup is …","im speechless cone on you spurs","AS IT STANDS SPURS ARE GOING THROUGH! :D :D :D \n\nFUCK YEAH!\n\n-SQ.","This Spurs comeback is unbelievable Jeff!","RT @AlexHoneyball: Spurs are smashing it","#adeybayo couldn\u0027t score with a whore, apparently not the case! #spurs #eurocup","Be mad to think where Spurs would be if you take away Adebayor\u0027s goals since Sherwood came in.","All that money spurs wasted on shite when the best was right under there noses #Sherwood #Adebayor","Whats a game right now. That red card has completely changed the game.\n3-1 COME ON YOU SPURS!!!","RT @Lord_Sugar: Adebayor again 3-1 Spurs unbelievable","Adebaysnore is a goal machine! Great turn around by Spurs! ⚽️ Great game ⚽️","can\u0027t believe im missing the spurs game. The mrs got some shit on :/","RT @stefdcfc89: Finally a British side showing some fight in Europe #spurs #thfc","RT @LeGrove: Oh damn, so annoyed Spurs have Benfica the Thursday before they play us.","RT @BlastSykx__: GOALLLLLL !! Adebayor score again !! Complete come back from Spurs !","But I want Spurs to win so I aint mad","#muchlatergram #picstitch Fun times with @claudiazapata and danieldmorrison at Spurs v Bulls! Xo http://t.co/34VxWgyDdG","Did someone just say spurs are shit? Fat lady singing and all that 😂","I know this sounds crazy but we need Spurs to go through .... they would have to face Sevilla AWAY just days before the NLD.","RT @Sbravery: How can @Damo1176  say watching Spurs is like watching paint dry? 4 goals and a red (cont) http://t.co/d36L6EPEBu","What a come back #spurs","4 days old and first #Spurs match. Just gone 3-1 up #COYS http://t.co/IY75dxw0t1","Spurs fans should rather take the Europa League than a 4th place. Trophies are memories.","That\u0027s funny. Didn\u0027t spurs fans want adebayor dead this time last year?","Come on u spurs we can do this just defend boys","Spurs would be nowhere without Adebayor","RT @AddictedtoSpurs: First goal and last goal for @IAmJermainDefoe at Spurs. #THFC #UnlessHeReturns http://t.co/LmvE745sQv","20 minutes spurs, please!!!","Spurs have caused me so many nearly heart attacks these last few years","3-1!!!!! Adebayor with a second. Great goal. if Spurs don\u0027t concede...","Forty years of supporting spurs how the fuck I\u0027m not six foot under I\u0027ll never know","More Thursday nights \u0026 Sunday games for Spurs, works for me :-)","Nice comeback spurs, adebayor is a fookin TANK","the more you watch Adebayor play for Spurs the more you wonder what he did to piss off AVB... Looking like a world beater under Sherwood!","Yes then Spurs!","RT @cammytaylor1996: Spurs have this! Adebayor is under rated by many! Especially avb!","What a match! COME ON YOU SPURS!!!! #COYS","Thanks 3! If I had signal I would be winning money from the spurs match","If I ever made It pro and played Vs Spurs. I woudv went absolutely berserk if  I scored against them","@Lord_Sugar relax Spurs are plying against a crap team...","This is the best spurs game I\u0027ve seen since 4-4 against arsenal","Spurs fans going crazy because they\u0027re beating Dnipro by cheating...","Get in there you Spurs, dont mess it up now.","@GoingJuanLoco LOL to be fair they always give it a right go, plenty of passion and grit and bile and chunder and yuck fuck off spurs 5-0","Spurs fans singing \"you\u0027re not singing anymore\" at non English speaking fans","What a finish by Adebayor to put spurs 3-1 up #totvsdni #EuropaLeague","Don\u0027t mess up spurs, keep pushing! #coys","RT @likeavillasboas: Haven\u0027t cheered as loud all season. Please please please see this through now Spurs!","\"You\u0027re not singing anymore\" chant the Spurs fans ... like squeaking through against Dnipro is something to be proud of.","Spurs 3rd goal vs Dnipro https://t.co/KytYQqSPPI","Oh how I hate Spurs so much","Spurs have so much luck fucking hell","RT @paddypower: OOF! A lovely little free kick routine ends in Dnipro hitting the post. Proper game on our hands here now. Spurs 4/1 to qua…","@LocoBurritoMan well its Spurs... cheating twats!","Come on you Spurs!!!!!!l!!!!!!!!!","RT @GoonerGordo: SPURS COME FROM BEHIND AGAINST A TEAM OF PART TIMERS DOWN TO 10 MEN AT HOME. LEGENDARY.","Spurs shouldn\u0027t really be getting into that position in the first place though","This is a \"comeback\" DVD in the making #Spurs","@DaltonJerryd @Rockybobby88  butt he didn\u0027t the spurs player should have got sent off  rubbish sport I will stick to tennis golf and curling","Go on spurs 😏","Spurs fans need to shut up, it\u0027s dnipro ffs","Plenty of passion among the spurs team, good to see #spurs","Spurs fans going mad for a trophy that we won last year when they were saying it was a shit competition?? #ironic","RT @BreakfastPercy: a. Dnipro\u0027s owner can go fuck himself b. More games for Spurs #COYS","@Lord_Sugar who cares use are brutal anyway who is the team use are playing like spurs are a joke!all that money and struggling already!#💩","THIS!!! \"@BreakfastPercy: a. Dnipro\u0027s owner can go fuck himself b. More games for Spurs #COYS\"","Hate spurs so much. Fuck off Adebaybayor!","I am not I repeat NOT going to mention how well #Spurs are doing now","Well done Spurs for beating a 10-man side from Ukraine which had your number for about 150 minutes over the two legs","RT @LeGrove: Oh damn, so annoyed Spurs have Benfica the Thursday before they play us.","Yesssss Spurs.","What a turnaround!! Get in Spurs!! #EuropaLeague","Yes spurs- didn\u0027t see this result happening 10 minutes ago! half decent!","Come on you spurs !!! #adebayor#ericksen","@DaleMeachen werent even that bad, vertonghen made a meal out of it..spurs winning 3 1 now","RT @Lord_Sugar: Adebayor again 3-1 Spurs unbelievable","COME ON YOU SPURS! @SpursOfficial @Lord_Sugar great goals by Adebayor.","RT @JohnBrewinESPN: Spurs comeback totally inspired by Tim Sherwood telling the referee to f###! off.","Well I now have egg on my face, earlier tweeted about spurs were out..","BIG CAJONES!! support Spurs they said......It\u0027ll be fun they said!","get in ade, come on you spurs!!","really massive well done to spurs, just about beating a team most people will never have heard of","@stoner__8 what..!!!.been for a shower and spurs 3..1..up..","You man are bitter lol let Spurs enjoy","RT @SpursVines: What a goal. Dnipro 1-3 Spurs, Adebayor. #Vine https://t.co/9IEDoS4XGu","This Spurs vs DNI game is the craziest - not sure any Spurs player can ever step foot in Ukraine #EuropaOnFOX @FOXSports1 @SpursOfficial","RT @SeaboF: What a turnaround by Spurs , Adebayor is some player !","Get in there spurs don\u0027t support them but I\u0027m so happy two more goals please spurs","I feel like as soon as I leave the room, spurs always score #badluck","Adebayor is only good when he\u0027s after a new deal, luckily for spurs that is now... #adebayor #thfc","Any Spurs fan taking pleasure from this false victory has no right to label players from other clubs \u0027cheats\u0027. #COYS","I\u0027ve took the piss tonight but on a serious note well done spurs, #THFC","And all of a sudden the spurs are killing it! #COYS","Spurs fans 😂😂😂","@Lord_Sugar well done spurs all the way now x"],"id":63,"autoSummary":"Spurs fans singing to 300 Dnipro fans your not singing anymore when u couldn\u0027t hear the Spurs fans for 60 minutes"}}