{"66":{"topic":"eriksen","tweets":["@Scott_Tattie97 been jumping about like fairies but to be fair eriksen has been class and spurs goals were all pretty class","I\u0027m joining in now, Eriksen has to start against Cardiff! #THFC #COYS","RT @eddberwin: Eriksen is different class, shouldn\u0027t be in that team","Eriksen is tottenham\u0027s best player like seriously... Should have gone to a better team though","Tottenham have really turned this tie round \n\nGOAL! Adebayor slides in after a superb cross from Eriksen. Spurs... http://t.co/LljE31Jjr4","@Ashton_Weaver Each one has been its own bit of quality. Eriksen is picking them apart and Adebayor is in top form in front of goal.","Christian Eriksen is that guy!!!","RT @SpursOfficial: 64 - More on goal - Eriksen whipped in perfect cross from left, Adebayor did rest sliding in from six yards. #COYS","If I was levy and benteleb or any player replaces eriksen in the team next game I would get on the tanoy in the stadium and sack Sherwood!!","RT @BenLewis1995: Don\u0027t know why you\u0027re all hyping. Eriksen\u0027s getting dropped for Bentaleb on Sunday.","Don\u0027t believe it a Europa league game that\u0027s actually good and entertaining! Adebayor the main man not forgetting Eriksen.","@Flocky99Jack sorry bit late pal, but yeah! Could see them doing it from the start! Fantastic stuff by Eriksen and Adebayor!","RT @SpursOfficial: 64 - More on goal - Eriksen whipped in perfect cross from left, Adebayor did rest sliding in from six yards. #COYS","eriksen and adebayor are the whole team","Dembele , eriksen, sandro, ver, and ade why would guys wasting your time at spurs man","“@FutbolSergi: Spurs level on aggregate. Tottenham need one more to advance. Eriksen made the difference. £11m.”","Ade, Sandro and eriksen. 3 crucial players that have to stay fit!","RT @GeorgeEllinas1: You watching Tim...Eriksen doing it AGAIN!","RT @Coys1979: Dont you dare to put Eriksen out of team again..#sherwood #thfc assist and goal.","Oh look Eriksen plays and we score 3 goals. Bit of a no brainer really. Glad we turned this around! COYS","RT @Sam_Teez: Goal and assist for Eriksen?? Bentalebs still better though obvs","RT @YouensBOi77: This is why Eriksen needs to play","Don\u0027t care Eriksen MOTM","@Chriswin4 I agree. Ancelotti has said he is the second most important player on the team. Eriksen certainly has the potential however,","So Timmy, tell me again why you start Bentaleb over Eriksen.......","RT @Matt_swan40: A goal and an assist. That is why you have to play Eriksen, Tim","For a while people were talking about how Man Utd need a creative mid and Eriksen was just waiting there","RT @SpursOfficial: 55 - Goal: Eriksen levels it on the night - 1-2 on aggregate.","Tottenham would be so shit without Eriksen","Always wanted eriksen to be in a Manu jersey","so I text Fran before the game saying Ade to score and Eriksen to score and or assist. I am fucking god","Eriksen is different class, shouldn\u0027t be in that team","RT @HarryVandervell: Adebayor and Eriksen have been on it tonight","RT @SpursOfficial: 55 - Goal: Eriksen levels it on the night - 1-2 on aggregate.","RT @Jackinho92: I hope Tim realises this is what happens when you play Eriksen. He makes things happen. Shits over Ozil.","I just saw someone tweet Eriksen is better than Ozil yuno.. He\u0027s amazing but not on Ozil\u0027s level, some fans are deluded.","RT @JohnWatsonSport: So Eriksen plays a part in both goals.. but didn\u0027t feature against Norwich?? Where\u0027s the sense","RT @Billy_Tubb9597: Why does Eriksen play for spurs!? Too good!","@paulrobinson33 Still not convinced of Sherwood, but Eriksen and Adebayor have won this for us. Oh, and the nutter…","Eriksen is on his fuckin job today im tellin you","In Aalborg..supporting Tottenham Hotspur and appluading a Dane Christian Eriksen..take a bow! http://Eriksen.doing","RT @Quilo: If Eriksen doesn\u0027t play this weekend…then Im gonna bundle Tim in the boot of me car and drop him off the end of Southend Pier.","jus cool nuh Ade and let Eriksen score another and bring home my money","RT @FreestyleVines: What a goal by Eriksen 1-1 https://t.co/DlAqVv1P6L","RT @H2theHardy: Eriksen. What a bargain #player","Adebayor!!! This is what Eriksen does. Simple but effective balls. What we\u0027ve missed!","RT @LeanderOnFOX: Finished my USMNT roster reaction just in time to catch this Spurs comeback. Well-timed! Also, I cry for you Christian Er…","Eriksen showing why he should be playing every game for spurs #COYS","@_Oli_Andrews TWO WORDS!!! ERIKSEN AND ADEGODDAMNBAYOR! #COYS","Eriksen and Adebayor doing the business.  Top players.","Eriksen once again, superb on the night with a great delivery. Adebayor is there.","Eriksen looks class! Out of all the players spurs bought be seems the only one worth the money?","RT @femorenuga: agh my boy Eriksen\u0027s gats this","@DrShipman01 Suarez is world class. Eriksen is unreal.","What position and in what formation best suits Eriksen","I totally dreamed that I met Marshall Eriksen last night 😍😍","Eriksen scored? Fuck my life... The Danish press will go crazy now.","Please don\u0027t drop Eriksen again Sherwood!","RT @JohnTHFC1993: Eriksen proving why he should\u0027ve played at Norwich on Saturday.","looks like Eriksen has been by far Spurs’ best player tonight. Thank goodness they left him out against Norwich! #THFC #NCFC #EuropaLeague","RT @Jackinho92: I hope Tim realises this is what happens when you play Eriksen. He makes things happen. Shits over Ozil.","Just like that three goals for Spurs! #Adebayor2 #Eriksen","@MirrorFootball \"ACTUAL GOAAAAAL: Eriksen scores from a free kick. And Spurs are sort of (not really) back in the game...\"","Props to Spurs tonight. Momentum is such a big factor in european football. Eriksen has been class","RT @Jinsella: Eriksen\u0027s running the show","Eriksen should play for a top side","Adebayor and Eriksen have been on it tonight","RT @AnthCook: How Christian Eriksen doesn\u0027t start every game possible is beyond me.","Fantastic come back from spurs, credit to Eriksen and Adebayor! Let\u0027s hold on #COYS","Well played spurs. Ade and Eriksen brilliant.","RT @TheTottenhamWay: #thfc Eriksen\u0027s back. And we\u0027re scoring.","RT @DomzMUFC: Eriksen and Adebayor are on there job","Well played to spurs to come back from that, adebayor and eriksen playing great","Only if Liverpool had got eriksen","@jackstevo1997 eriksen has more goals and the same assists in less games?","In all seriousness tho eriksen is one of the best midfielders in the prem always loved him","Imagine bumming Eriksen after having a good performance against Dnipro.","RT @SpursOfficial: 55 - Goal: Eriksen levels it on the night - 1-2 on aggregate.","Eriksen and Adebayor are fucking magic right now","Adebayor and Eriksen are both class! Hope for English teams on Europe yet #bbcfootball #THFC","@SpursOfficial HOLY SHIT!!!! Ade and Eriksen are on fire! #COYS","Eriksen has been playing so well","RT @SpursOfficial: 55 - Goal: Eriksen levels it on the night - 1-2 on aggregate.","RT @SpursOfficial: 64 - More on goal - Eriksen whipped in perfect cross from left, Adebayor did rest sliding in from six yards. #COYS","I\u0027m sorry Tim this is y play ERIKSEN!!!!!!!!!","@calumbovell @mylesmello eriksen is sick, what you saying bout ade? lol","Without eriksen and adebayor, Tottenham cannot even be described as a football team.","Well this is getting interesting! Eriksen has been in the thick of everything tonight. Will Dnipro keep time-wasting now..? #COYS","RT @wayneAwhite: Christian Eriksen, class. Why does he not start every game?","Ade and Eriksen should start every game #COYS","RT @MichaelAdamss: Adebayor and Eriksen have been class in this 2nd half!","Spurs WOW Adebayor and eriksen aren\u0027t bad are they","RT @georgebann: Eriksen\u0027s position v Cardiff this weekend.....bench. #SherwoodLogic","Eriksen is something else, the only #THFC signing that was worth it. #LFC should\u0027ve tried harder to get him.","RT @joe_all3n: Eriksen fuckkkkkk!! He\u0027s too good","What was eriksen thinking of when he joined spurs. Arsenal and united wanted him aswell","“@CalumPaine: @TomLanee the ref has saved you from embarrassment...”Emmanuel Adebayor  \u0026 Christian Eriksen have saved us from embarrassment","RT @SpursOfficial: 64 - More on goal - Eriksen whipped in perfect cross from left, Adebayor did rest sliding in from six yards. #COYS","@LeeHunt87 No worries. YESSS Ade and Eriksen FTW!!! 🙌","Eriksen has been different class, adebayor is undefendable","Eriksen is still too good for Spurs.","This game is making the decision to bench Eriksen for two games downright risible.","RT @JSincy: Why doesn\u0027t eriksen play every game? #class","Can\u0027t believe Eriksen and Vertonghen aren\u0027t at top top clubs! 👌 United should have bought them both, just what they needed!","Eriksen and Adebayor are on there job","@george_ogier yeah I agree with that as well. Would like to see Sandro Eriksen middle two","Eriksen away jersey on the way...","RT @ZacWassink: Eriksen really is quality. Hope Tim sees how better #Spurs are with him in the team. Needs to be playing more. #COYS","No actual shit, 2 minutes before the Eriksen goal I genuinely said Tottenham will come back from this and looked at SkyBet. 11 to bastard 1","RT @Quilo: If Eriksen doesn\u0027t play this weekend…then Im gonna bundle Tim in the boot of me car and drop him off the end of Southend Pier.","This is what I miss, first half showed our recent form, Eriksen, Adebayor and Lloris are amazing. What a second half! #COYS","RT @SpursOfficial: 63 - Free Kick: Eriksen curled in free-kick, Dawson met it but could only glance header wide. 1-1 on night, 1-2 on aggre…","Christian Eriksen really demonstrating his class tonight. And this recent Adebayor revival is great to see as a neutral. C\u0027mon #Spurs!","Christian Eriksen is such a beast.","RT @SILK1874: World class delivery from Christian Eriksen that. Wilshere couldn\u0027t do that if he tried.","Sherwood is an ass for not playing him in the EPL “@GB_Mendy: Eriksen MOTM already”","RT @SpursOfficial: 64 - More on goal - Eriksen whipped in perfect cross from left, Adebayor did rest sliding in from six yards. #COYS","RT @HotspurRelated: VINE! Tottenham equalise through Eriksen via @SpursVines. https://t.co/pspvdIcBds #THFC","This is unbelievable!!!! We\u0027ve scored 3 goals!!!! Eriksen and Adebayor (2). COME ON YOU SPURS!!!! LET\u0027S SCORE 5!!!!!!","Christian Eriksen, class. Why does he not start every game?","Kanezo pullin the strings for Spurs #Eriksen #Seperated@birth","@Steve_THFC Bentaleb for Adebayor Eriksen AND Townsend please ! #BentalebIsTheMan","RT @JasrajSanghera: Eriksen with a goal and an assist in 60 minutes and sat on the bench for 90 against norwich on the weekend. Explain tha…","RT @SpursOfficial: 64 - More on goal - Eriksen whipped in perfect cross from left, Adebayor did rest sliding in from six yards. #COYS","RT @JohnWatsonSport: So Eriksen plays a part in both goals.. but didn\u0027t feature against Norwich?? Where\u0027s the sense","RT @duniaSOCCER: Tottenham XI (vs Dnipro): Lloris; Naughton, Dawson, Vertonghen, Fryers; Dembele, Eriksen, Sandro, Townsend; Adebayor, Sold…","Sherwood leaving eriksen on the bench is the equivalent to barca benching messi, easily their best and most influential player","RT @TheTottenhamWay: #thfc Eriksen\u0027s back. And we\u0027re scoring.","@rochee316 Sherwood been made look silly by Eriksen tonight. Goal \u0026 assist. Timmy drops him for last 3 games???#taxifortimmy","What a turn around this is .. Adebayor and Eriksen are both quality ⚽️","@WalkerYoo going nuts. Ade and Eriksen are on fire","RT @KaylaKnappFOX: This Christian Eriksen kid is kinda special. Maybe you should play him more, Mr. Sherwood.","Verthonghen should be ashamed of himself!! Apart from that, adebayor and eriksen are unreal","@GoeJibbens you are right but adebayor and eriksen aint!","RT @SpursOfficial: 55 - Goal: Eriksen levels it on the night - 1-2 on aggregate.","RT @AlexPalmerHam: That Eriksen bloke ain\u0027t that bad #Baller","Eriksen and Adebayor are having the game of their lives !","I feel a bit sorry for Christian Eriksen. Having to play for Spurs must really suck.","RT @kirky0110: Adebayor and eriksen have being class the last 15 minutes absolutely unplayable the pair of them","RT @alitweedale: Why, and when, did Christian Eriksen ever lose his place in the first team at Spurs?","RT @JasrajSanghera: Eriksen with a goal and an assist in 60 minutes and sat on the bench for 90 against norwich on the weekend. Explain tha…","RT @Quilo: If Eriksen doesn\u0027t play this weekend…then Im gonna bundle Tim in the boot of me car and drop him off the end of Southend Pier.","Adebayor and Eriksen have been class in this 2nd half!","RT @miamibyrne: Eriksen is like a puppeteer out there now #Geppetto","RT @HotspurRelated: VINE! Tottenham equalise through Eriksen via @SpursVines. https://t.co/pspvdIcBds #THFC","RT @HotspurRelated: VINE! Tottenham equalise through Eriksen via @SpursVines. https://t.co/pspvdIcBds #THFC","Eriksen is like Mick Tolton #flair","RT @JayDoubleYou5: “@toniyates_: “@JayDoubleYou5: Eriksen\u0027s played amazing so far” OHHH ERIKSEN SEN SEN HES OUR NUMBER 23 😂😏” LOOOOOOOOOL Y…","\u0027Eriksen is class\u0027 my man don\u0027t do this week in week out, jump out of his arse","Finished my USMNT roster reaction just in time to catch this Spurs comeback. Well-timed! Also, I cry for you Christian Eriksen... #ajaxfan","Christen Eriksen is a quality player! #23","RT @kirky0110: Adebayor and eriksen have being class the last 15 minutes absolutely unplayable the pair of them","Why on Earth isn\u0027t Eriksen starting consistently in the league? With Adebayor, he\u0027s honestly our best player! #bbcfootball","RT @SpursOfficial: 64 - More on goal - Eriksen whipped in perfect cross from left, Adebayor did rest sliding in from six yards. #COYS","RT @kirky0110: Adebayor and eriksen have being class the last 15 minutes absolutely unplayable the pair of them","So Eriksen plays a part in both goals.. but didn\u0027t feature against Norwich?? Where\u0027s the sense","@ZahedRahimi @liamoneill_02 @AhmedBokzaa @Zaaaako made u said Eriksen will replace Xavi your on coke","“@toniyates_: “@JayDoubleYou5: Eriksen\u0027s played amazing so far” OHHH ERIKSEN SEN SEN HES OUR NUMBER 23 😂😏” LOOOOOOOOOL YES TONI🎉🎉😄","RT @Quilo: If Eriksen doesn\u0027t play this weekend…then Im gonna bundle Tim in the boot of me car and drop him off the end of Southend Pier.","I fucking despise Tottenham and the shower of pricks that are their players (minus Eriksen)","I think this Eriksen is a bit overrated Bentaleb!","Tha Eriksen is a talent. Wow what a goal by Adebayor.","RT @SpursOfficial: 55 - More on goal - superb free-kick from Eriksen, up and over the wall from the left corner of the box and home.","RT @JasrajSanghera: Eriksen with a goal and an assist in 60 minutes and sat on the bench for 90 against norwich on the weekend. Explain tha…","RT @SpursOfficial: 55 - Goal: Eriksen levels it on the night - 1-2 on aggregate.","Eriksen starts and gets one goal and one assist. Needs to start more games! Cheapest n best purchase of the summer","Adebayor and eriksen have being class the last 15 minutes absolutely unplayable the pair of them","RT @DannnyB99: Eriksen is quality ✌️","RT @SpursOfficial: 64 - More on goal - Eriksen whipped in perfect cross from left, Adebayor did rest sliding in from six yards. #COYS","RT @luke_payne93: Eriksen is doooooooin bits for totenham tonight, one of the few signings they made in the summer that made sence","RT @miamibyrne: Eriksen is like a puppeteer out there now #Geppetto","MUCH SCENES\r\r\r\r                   VERY SPURS\r\r \r                                   MUCH \rADEBAYOR\r\r\r                 VERY\r           ERIKSEN","Sherwood\u0027s decision to not use Eriksen at Norwich looks even worse now. What a player","RT @LegendCarver: Here\u0027s an idea Tottenham: Christian Eriksen is your best player, you should probably play him. He scores goals like that …","This Spurs game is really entertaining. Adebayor and Eriksen having great games.","Eriksen is class though","GOAL!! Straight after the sending off spurs take advantage a great ball from Christian eriksen and in the form of his life puts it in net!!!","RT @ToddBarrett24: Eriksen really does make all the difference..#differentclass","RT @Chriswin4: If you\u0027re Spurs just get the ball to Eriksen now. When against ten men just manoeuvre the ball, goal will come. Prime exampl…","Would love to see Eriksen at Liverpool. Class player.","@philipacrane @Lord_Sugar So who would you want in your side Eriksen or Modric ?","If Eriksen doesn\u0027t start every match for the rest of the season I will shoot Tim Sherwood.","Was just about to put this bet on as Eriksen scored, absolutely livid 😑 http://t.co/LUW1DjrH3A","RT @SpursOfficial: 55 - More on goal - superb free-kick from Eriksen, up and over the wall from the left corner of the box and home.","Adebayor and Eriksen got this back for the Hotspurs! #disgrace","I remember when ajax wanted 28mill for eriksen, that put a lot of teams off only for bloody spurs to buy him for 12 million.","RT @SpursOfficial: 64 - More on goal - Eriksen whipped in perfect cross from left, Adebayor did rest sliding in from six yards. #COYS","RT @SpursOfficial: 55 - Goal: Eriksen levels it on the night - 1-2 on aggregate.","What were we saying about Adebayor too RT @mylesmello: I do like Christian Eriksen as a player alot","@JT5HM Adebayor would be the perfect striker. Eriksen is so good love him so much, we gotta pull this back and win now surely.","First time I\u0027ve seen Christian Eriksen play properly and he is some player #EuropaLeague","Eriksen was such a sick signing... Without him Tottenham would be lost 👌","\"Good manners are what separates us from the elbows-on-the-table Wisconsinites\"-Marshall Eriksen.","Spurs have gone from being a one man team with bale to being a two man team with adebayor and eriksen","@clayski123 tenth European cup. Eriksen shows a lot of the same qualities.","RT @MirrorFootball: ACTUAL GOAAAAAL: Eriksen scores from a free kick. And Spurs are sort of (not really) back in the game... http://t.co/yB…","“@ChiefHonourable: I remember me and Elijah begging for United to get Eriksen. What a mess” Plus he was cheap","A goal and an assist but Bentaleb will probably still start ahead of Eriksen at the weekend.","RT @SpursOfficial: 51 - Corner: Close - Eriksen\u0027s corner flicked on by Adebayor, Dembele volleyed into the ground and onto the roof of the …","@peterwhite_1 what a lovely player Eriksen is...we\u0027d settle for Erik\u0027s daughter in villa midfield"],"id":66,"autoSummary":"“@SpursOfficial: 55 - Goal: Eriksen levels it on the night - 1-2 on aggregate.” YES ERIKSEN ILY FAVE"}}