{"67":{"topic":"tony","tweets":["RT @ArtyAbsatz: ESPN\u0027s Tony Kornheiser Compares Ariz. Bill To Nazis: \u0027Should They Wear A Yellow Star?\u0027 ~via NewsBusters #TCOT http://t.co/2…","#wearethepeople tony how about an update.","@Dark_Blue_Raven Tony nodded to this \"They are both so cool and nice people, glad you guys had fun and ohh rehearsal? going well?\"","RT @Lellane: Tony Abbott\u0027s playing a game of Good Cop/Bad Cop with his PPL scheme, pretending to want it while telling other Libs not to ba…","@MarianRakosi @billkinn @Tony_Burke My 11 year old was home (sick) yesterday and decided to watch question time, he was horrified.","#mp3faculty Tony Tetuila set to open night club in GRA, Ikeja: Former Remedies member and one-time... http://t.co/Jk3FqzLfZM @mp3faculty","@RonnayWhitney your super sexy and pretty but did anyone ever tell u ... That you look exactly like tony Montana sister","Let Me Go 117 Bpm Produced by SKYE LEVEL PRODUCTIONS by Tony Wrecks http://t.co/EtwsBCgkbq","Nicole Ray, Tony T http://t.co/tAPMmsbcOS #sexy #porn #blog","@tonycov1 No worries Tony, happy for you to post on our facebook group page if it will help..\nhttps://t.co/MldFhnL497\ncheers!","My boy even tho he doesn\u0027t  like I actually love it!😊😍💖🙊 @tony_bologna651 http://t.co/CLumgHXAqd","@J_Tinay are you even in Toledo?","RT @HedgeFundOfOne: @JaviFusco Are you guys looking at charts now? :-)\nUseful to check inverted charts occasionally for different perspecti…","I feel obliged to wish Tony Gonzalez a happy birthday. #ChiefsKingdom","RT @racerdown: After people were falling off the wagon. Tony stated saying people were cashing out in nov to get people back on wagon. #wea…","“@ltsDoge: Such music\n         Very famous\n      Many doge\n  So rap \n       Wow http://t.co/dTFKuy8U1H” @Tony_The_Doge","RT @ben_wasson5: Tony wants to drag race http://t.co/nptpaUBkVC","RT @FlawlessLesbian: I\u0027m the real tony Montana I got 50 naked bitches on a banana boat ! 👯🚤","RT @jeanninee12: Sampson: This years team is playing hard \u0026 with great chemistry. Tony Bennett\u0027s a savvy coach who brings out the best in h…","So that being justified by his grace we might become heirs according to the hope of eternal life http://t.co/iZ8BRPpKvs","@itsskarlaa wait no bc you tony Abel and cachi bully me","RT @PeterGrownXXX: @zetacensored: @Tony_OrionXXX you mean these? 🐶🐷😝 http://t.co/5zqocWBMaC","@JJSADDINGTON As a sufferer myself I can testify too their effectiveness. Expensive but worth it","#mp3faculty Tony Tetuila set to open night club in GRA, Ikeja: Former Remedies member and one-time... http://t.co/COEUkh3ET7 @mp3faculty","Eve Laurence \u0026amp; Tony T. in My Sisters Hot Friend -  Release Year:... http://t.co/t9wEUxN8sY #EnglishEve #EveLaurence #GenresBig","RT @ilikecuddles_: tony hawk underground was basically my childhood","#mp3faculty Tony Tetuila set to open night club in GRA, Ikeja: Former Remedies member and one-time... http://t.co/3GwADgDcoY @mp3faculty","Tony Pulis dreams of goals like that. Adebayor is big!","#mp3faculty Tony Tetuila set to open night club in GRA, Ikeja: Former Remedies member and one-time... http://t.co/wLXtEtZ8IT @mp3faculty","@Rob_Natty_Sharp @tonymacishere lol aye tony mac make sure u talk to obee soon, like ASAP...natty when u goin to da states?","RT @AdamSchefter: Redskins re-signed Chris Baker to a 3-yr deal worth $12 million, including $4 mil gtd as reported by his agents Tony Paig…","You niggas mad? Ooh my fault, in my grind like tony hawk bandz on me do the money walk that choppa make him do a summer sault","#mp3faculty Tony Tetuila set to open night club in GRA, Ikeja: Former Remedies member and one-time... http://t.co/t7P1n4Czr9 @mp3faculty","My name is Louie but they call me TONY, you can get poked if I aint got no money","#mp3faculty Tony Tetuila set to open night club in GRA, Ikeja: Former Remedies member and one-time... http://t.co/U1uxU6kEj0 @mp3faculty","The path to success is to take massive, determined action.\" - Tony Robbins  #quotes","@DaSituation__ fuck it, might as well.! Start closelining these 1st graders","RT @CSmigliani: ATTENTION: exactly 100 days till the Tony Awards... Proceed with your day","@Jamarcus817 cause everyone in America like Tottenham for some reason","Tony Stark aka IRON MAN stopped by to sign Ricky\u0027s book!","RT @OKC35_Mujkic14: My name is Louie but they call me Tony!","#mp3faculty Tony Tetuila set to open night club in GRA, Ikeja: Former Remedies member and one-time... http://t.co/Es8OVwkoYL @mp3faculty","#NowPlaying - Future - Tony Montana","#mp3faculty Tony Tetuila set to open night club in GRA, Ikeja: Former Remedies member and one-time... http://t.co/ysPcaW5zcN @mp3faculty","#mp3faculty Tony Tetuila set to open night club in GRA, Ikeja: Former Remedies member and one-time... http://t.co/U7tOafjNxc @mp3faculty","#mp3faculty Tony Tetuila set to open night club in GRA, Ikeja: Former Remedies member and one-time... http://t.co/jcgmlAfNFe @mp3faculty","this thanks i get","It\u0027s a 3-game package from Tony Karpinski that includes a 10* College Basketball Game of the Year for just $39.99: http://t.co/0b7gOpfFFu","#mp3faculty Tony Tetuila set to open night club in GRA, Ikeja: Former Remedies member and one-time... http://t.co/p8BneQYozD @mp3faculty","\"It is not what we get. But who we become, what we contribute... that gives meaning to our lives. - Tony Robins\"","#mp3faculty Tony Tetuila set to open night club in GRA, Ikeja: Former Remedies member and one-time... http://t.co/K9kXEfT9Up @mp3faculty","#mp3faculty Tony Tetuila set to open night club in GRA, Ikeja: Former Remedies member and one-time... http://t.co/rbitf6m9tO @mp3faculty","@OutlawPetesLass @OutlawPeteNJ you should have been Petra ??","@Tony_Ginger @OutlawPeteNJ Any news on PA in June???? And Tony, Nashville date is tornado season:(","@Drew_Supreme I\u0027m seriously still cracking up was that tony??","#tbt with the best uncle ever!! Love you uncle Tony!! http://t.co/S5yyZEcpbg","RT @UVAMensHoops: Tony Bennett, who won his 100th career game at UVa last night, is a top 10 finalist for the Henry Iba National Coach of t…","Tony is homee 😊","#mp3faculty Tony Tetuila set to open night club in GRA, Ikeja: Former Remedies member and one-time... http://t.co/QA5YLFBtF6 @mp3faculty","RT @StellarQuotes: \"Success is buried on the other side of frustration.\" \n- Tony Robbins","#mp3faculty Tony Tetuila set to open night club in GRA, Ikeja: Former Remedies member and one-time... http://t.co/3ICrYcgM8X @mp3faculty","#mp3faculty Tony Tetuila set to open night club in GRA, Ikeja: Former Remedies member and one-time... http://t.co/qaImvJjNFt @mp3faculty","After people were falling off the wagon. Tony stated saying people were cashing out in nov to get people back on wagon. #wearethepeople","God sees every time you are wronged. Leave it in His hands - He will vindicate you. - Tony Evans http://t.co/B7oDSb5o4j","@t1nichols Thank you, Tony! 😊","Tony Winner Billy Porter to Channel Barbra Streisand on New Album Billy’s Back on Broadway http://t.co/iVIqkakzUi Great Vineyard Gala host!","#mp3faculty Tony Tetuila set to open night club in GRA, Ikeja: Former Remedies member and one-time... http://t.co/9hVVODS3eP @mp3faculty","RT @AndyMacNBA: Don\u0027t act like Tony Parker didn\u0027t benefit from having one of the Best Coaches of All-Time,The Best PF and one of the best 6…","#Eli got 2 chips tho...RT @imnoWillFerrell: Why did Michael Vick, Eli Manning, and Tony Romo walk into a bar? To watch the playoffs.","Tony Abbott\u0027s signature policy the Parental Leave shd b exposed for what it is. It\u0027s taxpayer\u0027s money earmarked for his 3 daughters\u0027 future!","RT @MarianRakosi: RESIGN BISHOP RESIGN!\n\n@Tony_Burke stands up to the\nSpeaker of the House, Bronwyn Bishop. #incompetent #bias #auspol http…","@HOME_DEPOT_TONY oh she got some naked one too","RT @Gawker: Rupert Murdoch gave Tony Blair $100,000, then Blair fucked his wife http://t.co/L0IDXC7jsy","RT @ParvesKoyes: When your parents turn a joke into a lecture http://t.co/BolYxnXjPA","@OutlawPetesLass @Tony_Ginger I get that part my nono was Pietro. But how did you get away with using outlaw as a first name?","I don\u0027t feel good 😷","Tony Hawk Working on a New Skateboarding Mobile Game - Touch Arcade: Tony Hawk Working on a New Skateboarding ... http://t.co/g2fK3MRHWl","@AnthonySHead   Hi Tony ,would you please wish @illguth Happy Birthday for 28th.My lovely Norwegian friend and a big fan of you Thanks DI XX","RT @racerdown: @JanerousJane   I agree. The dinar is not a scam. The scam is tony telling people he has contacts and other. BS. #wearethepe…","Labor veteran Martin Ferguson says ALP should back modest IR changes \u0026 the ABCC. Any chance, @billshortenmp ? http://t.co/kjHTaSOeW7","@Smooth_Tony I\u0027ll go with you...not cooking tho.","Tony Blair: from New Labour hero to political embarrassment \u003e http://t.co/MfNlCVyMl9   #Bliar Th£ Killing$ of Tony Blair","tony hawk underground was basically my childhood","“@WeAllKnowA: We all know a faggot named Tony” YESSS","RT @RobbiePHannan: .@BridgetOFlynn @galekxy @Tony_Burke Keep exposing the worst speaker we\u0027ve ever had. ru-BBISH! #auspol","Why do I keep getting this whack ass notification from twitter saying people are following some random fucker?","@CarlsonLexi13 a bunch of fat blobs.","My name is Louie but they call me Tony!","“@caruana_tony: \"Throwback Thursday\" will always and forever annoy the hell out of me.” Yes! Thank you.","@64_TONY aite fuck with me stay blessed","You don\u0027t need an Enquiry with regards to any content of the Irish Peace Agreement,just ask Tony Blair \u0026 Whitehall Mandarins?","http://t.co/JvwAhdtbzU / check the new freestyle 👌","@pinesroadfinest I just went and looked at some more pics. Mannn","RT @Steph_steph27: Why y\u0027all keep threatening to get tony 😂👐","RT @AdamSchefter: Redskins re-signed Chris Baker to a 3-yr deal worth $12 million, including $4 mil gtd as reported by his agents Tony Paig…","@d1junior10 @_OmgITSMarc stay strong bruh . My condon😔","Timberlake members this is your head Golf Professional Tony Parrish. Is your golf game in need of repair? Or do... http://t.co/f4lL7PLGMr","I just wana ask myslef do thugs cry?","Genk are 💩","@BadBoyWilder Tony nodded softly then poured more champagne for them \"Yes, promise ... I know I was bad all week and even before to you\"","@TonyVCarter Very nice car \u0026 what a lovely husband too! Have a good night Tony ^MT","#LNP Tony\u0027s Vic mates lose control of BBQ, coal mine now on fire. Tony rolls up with $4B water watching planes #auspol Send him to Moron.","#wearethepeople After tough Daytona, Tony Stewart confident about Phoenix - http://t.co/qsFfNBgJcw http://t.co/icm0jubpP2","RT @PaulRobertsNHS: @tonynchambers You won\u0027t have time to Tweet Tony. #busy #frontline","How Tony Abbott\u0027s grand ideals compare with other world leaders: #auspol #mediocre #onetermtony http://t.co/qZtQEVl7Td","ESPN\u0027s Tony Kornheiser Compares Ariz. Bill To Nazis: \u0027Should They Wear A Yellow Star?\u0027 ~via NewsBusters #TCOT http://t.co/2M6BZjXnho","RT @silqyballer: #wearethepeople haha... Playing with people\u0027s emotions!!!.. That\u0027s ALL you do Tony !!!.. Wow.. Scam boy #wearethepeople","I lose about 15% of my battery everyday during my ASD. #afterschooldump","Mannnnn imma be soooo drunk Saturday oh lord . Tony just called me , oh God im not going to be able to hang. Ctfuuu","To be fair to Tony Pulis, he said the only way Tottenham are going to win is through set pieces and long ball","I have a 99% in my Anthropology Lab. 💁","Tony Gentilcore, on How to Deadlift | Men\u0027s Health: http://t.co/8n8RKjxkDP","RT @Fred_Delicious: *there\u0027s a knock at Tony Hawk\u0027s door*\n\"TRICK OR TREAT\"\n*Tony\u0027s eyes light up*\n\"a trick eh?\"\n\"sir we just want candy\"\n\"T…","RT @JimmyRMcBride: @THE_TNT_TEAM #wearethepeople, When is Tony taken the tnt site down. we need the 800 #\u0027s Let us know something please","RT @sin_day12: Tony Montana was my father","That #WakeUpNow money have people like....... http://t.co/j8Q8WFQKap","@Lotta_Clout awww Tony wony lolll","@swinging60s Did you know #MarcBolan formed his name from #bobdylan   \nhttp://t.co/IQNdmdagcb","“@tony_dolde: @EmileeNoel123 idk haha I\u0027m going over later” I have to go back to the school at 3:30. But after if you guys are still there","Best Cars and Joysticks in Flat Style by Tony Miotto - -   -    http://t.co/hMUEegJcyR #Artworks","@TonyDeSaulles thanks tony, Thanks so much for contributing, great to meet you, it was a great evening for us all.","RT @ZackMorrisTbh: On my way to steal your girl http://t.co/Qm28Vesc5F","RT @DickieV: Coach Tony Bennett said he met Tony singer-singer was asked Did u ever meet another TB ?Singer said yes stripper with i in Ton…","We can change our lives. We can do, have, and be exactly what we wish. Tony Robbins.","In vein ft The Weeknd by Rick Ross #Fire #temXO #XOTillIDie","if you don\u0027t care than i want","@ZeroToleranceCo tony?  what happened to jason, ron?","@K_Buck1026 @BrendanMDonahue @MJ2Murray pickup of @scatamooch55 expected to offset all losses, has been described as the next tony kucoc","@Em_ma_K booked the days off but no flights yet. Plenty of time! U got any plans? Going Tony\u0027s leaving do tomorrow?","We\u0027ll speak to Tony Sheldon from @TWUAus to understand  where the future lies for workers and #Qantas: #studio10 #qantascuts","I posted a new photo to Facebook http://t.co/4B6H0N5gtf","Proceed with the plan, weed in my hand, ciroc in my cup","Labor veteran backs PM\u0027s IR reform: Bill Shorten in for a shock as former minister urges Labor to back \"sensib... http://t.co/X07okdgFg6","Tony Hawk\u0027s New Game is Mobile Exclusive http://t.co/jcgEqX2COW","People try to hard to fit in.","RT @fucktyler: I THOUGHT WE WERE FRIENDS","@lazymum @PeoplesAstro Hopefully it will reappear tomorrow and we\u0027ll drive to the coastside! (Cromer?)","RT @StellarQuotes: \"Success is buried on the other side of frustration.\" \n- Tony Robbins","Labor veteran backs PM\u0027s IR reform http://t.co/r0qer5IbbW","RT @2iLL_DRE: married to music. married to marijuana.","@Tony_Ginger @OutlawPeteNJ And I love the song outlaw Pete and my dad, my grandad all uncles etc are named Pete, Peter, Pietro. Perfect fit!","Concerns mount over PM\u0027s parental scheme: Prime Minister Tony Abbott\u0027s signature paid parental leave policy is... http://t.co/nMDK6FVc3p","RT @SomeDopeName: If you real you know what I\u0027m talkin about.","@TonyStark295 *the doctor is pretty shocked that tony is half awake by now but that\u0027s a very good sign. He tells anthony if he continued-","Great Job @Tony_Lomena  T-man","RT @jdrentzjr: So much for \"free\" healthcare.... http://t.co/TIexBxeKqG","RT @JanieMarie_16: @brenda32b @Deniseephann @Tony_realist pretty sure I got caught. Lol. But if I didn\u0027t, then we should make this an every…","Concerns mount over PM\u0027s parental scheme: Prime Minister Tony Abbott\u0027s signature paid parental leave policy is... http://t.co/IlhBqttPSg","@ArcOfScars Bruce is slipping on a button down shirt. \"He\u0027s the Hulk, Tony, he\u0027s not supposed to be happy.\"","@JakeLittmann @CollinEichner @Matthew_Gorski @wrestlingfool10 @remsza_tony @rtm_94 the price should only be 65 if everyone pays","RT @deanjnorris: Had some dermatological issues, thanks for postingRT @MakingOfs: Hank from Breaking Bad was Tony in Total Recall http://t.…","@Tony_Baloney83 the Z/28 is too harsh. It\u0027s a race car. No A/C, radio and no suspension give. The SS is the way to go, but I see your point","#KoldGame RT @Gawker: Rupert Murdoch gave Tony Blair $100,000, then Blair fucked his wife http://t.co/bmoyBjUbh9","@tonyshaw Hi Tony. We experienced an intermittent issue which resulted in that message. Issue is resolved. Can our support team assist?","RT @JanieMarie_16: @brenda32b @Deniseephann @Tony_realist pretty sure I got caught. Lol. But if I didn\u0027t, then we should make this an every…","Man Charged With Hacking the Federal Reserve Faces 12 Years http://t.co/PkwX4Whlxb","Jason Collins Jerseys Are the Hottest Fashion Statement in Sports http://t.co/z4MVjHsXJR","I should be given the reigns to the Utica T\u0026F Twitter page...","@pinesroadfinest got a pic","RT @BridgetOFlynn: Well done @Tony_Burke for leaving on Hansard the differences in the Speaker\u0027s rulings. There forevermore to be judged. #…","Tony Hawk confirms that Activision is working on a smartphone and tablet version of his famous franchise #Activison \nhttp://t.co/ou0qMzEbwh","@Nate_JL_Smith I heard Tony beat you in basketball","@lazymum @PeoplesAstro Lucky you! Our view of the North is covered by houses \u0026 trees, but dark enough. However couldn\u0027t see anything. :(","@OutlawPetesLass @Tony_Ginger how did you get away using Outlaw as your first name?","RT @ThatHaleyWay: About to sleep for 6 hours.","http://t.co/3mcMpP852g Fables, issue #22. Cinderella Libertine, written by Bill Willingham, pencils by Tony Akins, cover by Jimmy Palmiotti","@HOME_DEPOT_TONY u seen bortles ol lady though","RT @TheComedyHumor: *At a restaurant* \n\nWaiter: \"Would you like a table?\" \n\nMe: \"No, not at all. I came here to eat on the floor. Carpet fo…","Like ya fookin Tony Pajamas","@Vblock_Tony dats why we gotta whoop they ass since they peoples not 😭😂😭😂","#LNP Tony went to market \u0026 came back with $4B \u0027water watcher planes\u0027 instead of water bombers. #LNP1918 Canberra More Morons than Mongolia.","RT @333_MrsPotter: @THE_TNT_TEAM #wearethepeople   Thank you Tony and friends for all u do!!!!  We love you!!!","@itzthelimit when Tony killed him...","Here you go http://t.co/NCrOlH17BC","@KrugerSam @Nathan_Sutton loooool tony lashing","Alfa Romeo 1600 Duetto Spider Coda Tronca/Fastback, model 1976,\nengine is running, original car, 60% repaint... http://t.co/bD7Fh5QRju","@brenda32b @Deniseephann @Tony_realist pretty sure I got caught. Lol. But if I didn\u0027t, then we should make this an every Thursday thing😏😁👌🙌","The Kate/Tony/McGee S2 probie slap is my fav! @TeamBishopNCIS @NCIS_CBS @EmilyWickersham @M_Weatherly @SeanHMurray http://t.co/KPgSfBtksR","@StewartHaasRcng @annetochkamade Tell Tony to get a twitter","@JackMMulligan no like the Gus Walt showdown is awesome. What do u think of the last three episodes","RT @AndrewHarding4: @Hvns3rdgate @RoyceSeabaugh @FIREICESEXX @miss_emilylee @KimmyHarvey Thanks Tony. He told me that before he had the op.…","RT @Readygov: #BeAForce: Take the Next Step. Update your Facebook cover photo for Severe Weather Preparedness Week! http://t.co/7jgqvdK4FL","Tony Stark will return #ironman4","@wweshirtguy @3rdGearAndFly @mocofit @FitnessLaura @jt151515 @2BFitLori @elizabethwhit20 TY Tony Gym soon #Deltdestruction. .","@tonyabbit more cards to come, Tony, getting meaty!","RT @j4gypsy: \"But it\u0027s too late, Tony. Trust has gone and you played a fair part in its destruction.\"  http://t.co/SJpJVecNKZ from @Gay_Alc…","S/o to my neighbors sister for the love.... man i miss that family... my neighbor and my neighborette… http://t.co/TkDkELkJzh","@Munoz_Tony where are you ?","RT @EveryWitchGlee: @ken_sanders97 MORE TONY BECAUSE I LOVE SEEING YOU AND MORE OF THE SHARKS","RT @StellarQuotes: \"Success is buried on the other side of frustration.\" \n- Tony Robbins","Tony Abbott pledges $16m to Cadbury before the election, since then rejected every company seeking assistance, including Qantas yesterday.","RT @ImTheRealGaga: Lady Gaga\u0027s new duet with Tony Bennett \"We\u0027re Doing a Sequel\" is set to be released on March 18th! #19Days http://t.co/7…","@githubtraining hi! I was looking at a page the other day and when I checked today it was gone 404. planned or accid? http://t.co/9XGtXIvyx0","@SirPaul2 listen tony Its not that difficult","RT @RealJasperAmie: @ken_sanders97 more adventures from the sharks !! And tony\u0027s magic tricks!!!","RT @basedniggers: U down to make a sex tape or nah, I mean I eat ass @ArianaGrande","RT @ikeranch: Finally @Dallas_TNT is back","@noelfielding11 Tony Reasons long lost brother? http://t.co/Y88pbjyjhN","RT @UVAMensHoops: Tony Bennett, who won his 100th career game at UVa last night, is a top 10 finalist for the Henry Iba National Coach of t…","RT @DIGLYY: @PLURBFORDAYS but youre Tony Chunti Fag in my contacts..."],"id":67,"autoSummary":"\"As a matter of law, Tony Blair can never face war crimes charges at the ICC\" says Phil Shiner http://t.co/BrxVLqoWwX"}}