{"68":{"topic":"alan joyce","tweets":["\"I\u0027ve been doing a good job *most* of the time in the past 10 years...\"-is that really good enough Alan Joyce? #Qantas","ON NOW: @QantasAirways chief Alan Joyce with @3AWNeilMitchell - STREAM LIVE: http://t.co/naqiuAwuwp","RT @Diddoms: #thedrum #Qantas could save $3.33mil with just one job lost. Alan Joyce was disaster at Anset, now applying his Midas touch to…","RT @heidimur: Qantas CEO Alan Joyce - on with @3AWNeilMitchell any second now..","Qantas CEO Alan Joyce - on with @3AWNeilMitchell any second now..","RT @Studio10au: Alan Joyce faces a showdown today with union bosses over job losses and the wage freeze across #Qantas: http://t.co/KyIMjC0…","RT @mcleetonii: Alan Joyce got paid $3 000 000 last year to make Qantas $6 000 000.\nI think I know what Qantas\u0027s problem is.\nSo can I have …","RT @SkyNewsAust: #amagenda with @Kieran_Gilbert - @SkyNewsRicho + John Hewson. After 9am aedt Qantas CEO Alan Joyce \u0026 ASPI chair Stephen Lo…","DTN Japan: Qantas boss Alan Joyce to meet unions after airline announces 5,000 job cuts: Qantas boss Alan Joyc... http://t.co/EoOfhPKIA3","#amagenda with @Kieran_Gilbert - @SkyNewsRicho + John Hewson. After 9am aedt Qantas CEO Alan Joyce \u0026 ASPI chair Stephen Loosley. ( brihonysp","#amagenda with @Kieran_Gilbert - @SkyNewsRicho + John Hewson. After 9am aedt Qantas CEO Alan Joyce \u0026 ASPI chair Stephen Loosley.@SkyNewsAust","I know \u0027bullying\u0027 is the wrongest of wrong but something about Alan Joyce makes me want to steal his lunch money behind the shed","@bajopants every time I hear Alan Joyce speak I think its Atlas from Bioshock. #wouldyoukindly","Alan Joyce faces a showdown today with union bosses over job losses and the wage freeze across #Qantas: http://t.co/KyIMjC044I #studio10","Alan Joyce and executives receive 80% pay increase, then selflessly freeze their wages. #qantas #auspol","RT @sportsbetcomau: Attention passengers, paging Alan Joyce. This is your final boarding call. We have you at $1.62 to be gone by March 1 n…","RT @ConversationEDU: Qantas is cutting 5000 jobs. Alan Joyce should be the first to go, says Sinclair Davidson. https://t.co/izhFEilF2p","Should Alan Joyce keep his job as Qantas CEO? | The New Daily: http://t.co/abTtVRO8fj","Latest news: Alan Joyce says strike action won\u0027t help Qantas - http://t.co/a5EskRAP0u http://t.co/eHgQYEi18B","These calls from some to sack Alan Joyce don\u0027t wash. Qantas is a public company. Sack anyone sack Mark Scott, we pay his wage. A Buffoon","RT @Diddoms: #thedrum #Qantas could save $3.33mil with just one job lost. Alan Joyce was disaster at Anset, now applying his Midas touch to…","Seems to difficult to run a profitable airline in a small country in the southern hemisphere, if you are Alan Joyce. http://t.co/DrMaZOn06A","Qantas boss to meet with unions over job cuts: Qantas boss Alan Joyce will begin talks with unions today after... http://t.co/MweI6YC9lx","RT @joel_cohen: Enough said! “@BernardKeane: Qantas\u0027s share price performance against the ASX 200. Alan Joyce took over in Nov 2008. http:/…","RT @fabfashionceleb: #SUN7 ALAN JOYCE SENT THE IRISH NATIONAL AIRLINE BROKE TOO #sun7","While Qantas is dying, Transport Workers Union threaten strike action. Only in Australia. http://t.co/Bg6U12It9C","@sunriseon7 disappointed with the interview with Alan Joyce. Samantha you are meant to be a professional journalist aren\u0027t you ?","@abcnewsNSW for god sake get rid of the totally incompetent Alan Joyce","Sack Alan Joyce today","RT @stevesownnacc: BREAKING NEWS: Fresh from his success at #Qantas, Alan Joyce to be named candidate for the position of next ALP Federal …","People can say all they like about Alan Joyce but I think he is a brilliant leader and a great CEO","RT @Dr_Tad: So union leaders’ priority after 5000 #Qantas job losses announced is to meet with Alan Joyce, not their members. Pathetic. #au…","#SUN7 ALAN JOYCE SENT THE IRISH NATIONAL AIRLINE BROKE TOO #sun7","If Qantas had \"mothballed\" aircraft not in use \u0026 5000 extra staff why has it taken Alan Joyce this long to realise this \u0026 act.","RT @smh: #Qantas CEO Alan Joyce is on course for another showdown with the airline\u0027s heavily unionised workers http://t.co/EKmPbRu7Qd.","#Qantas boss Alan Joyce warns against strike action as he prepares to sit down with Unions http://t.co/oiCHvrqUIz #auspol","@dileeshus Alan Joyce only understands cost, not value. Past experience was Ryanair; doesn\u0027t understand a full service model …","#news ‘Strike action won’t help Qantas’: QANTAS chief executive Alan Joyce is warning against any strike actio...  http://t.co/6Si3P3zzT5","‘Strike action won’t help Qantas’: QANTAS chief executive Alan Joyce is warning against any strike action, arg... http://t.co/FLCiUe5LMS","★RETWEET★ ‘Strike action won’t help Qantas’: QANTAS chief executive Alan Joyce is warning against any strike a... http://t.co/AO4jglELpM","‘Strike action won’t help Qantas’: QANTAS chief executive Alan Joyce is warning against any strike action, arg... http://t.co/I8CJtq5OoY","“@TheNewDaily_: Shud Joyce keep his job? Business leaders weigh in http://t.co/kufJMDtCOX http://t.co/Tqd5iY26IZ” \n\nNo he MUST GO","@BreakfastNews Alan Joyce \u003d Mr Teflon. Nothing sticks to him (bet he has huge golden handshake package) #qantas","Suspecting Alan Joyce personally hole punched the break line to maximise occupancy of the… (at @MelbFlightDeals) — https://t.co/Ii41XXNGk5","Am I the only one who watches Alan Joyce on tv and thinks Qantas is run by a bumbling fool? Not inspiring in the least. #auspol","RT @thetodayshow: Future of Qantas - \"To have a profitable, growing airline that turns the corner...\" CEO Alan Joyce #today9","RT @abcnews: Qantas boss Alan Joyce to meet with unions after airline announces 5,000 job cuts http://t.co/u7AuhPTTwU","Alan Joyce needs to step down. You can\u0027t run a company into the ground and expect to keep your job. #qantascuts #sun7","Alan Joyce....time to go. If your company isn\u0027t making a profit you shouldn\u0027t be on a  3 million dollar salary #Qantas #sun7","@LaTrioli Alan Joyce took over with Sales Act in place, this isn\u0027t a new challenge. Only 39% is foreign owned.","RT @abcnews: Qantas boss Alan Joyce to meet with unions after airline announces 5,000 job cuts http://t.co/u7AuhPTTwU","RT @abcnews: Qantas boss Alan Joyce to meet with unions after airline announces 5,000 job cuts http://t.co/u7AuhPTTwU","RT @ThePrincessDani: @mmmhotbreakfast  clown of the week Alan joyce,  qantas,  im sick of hearing what he \u0027tinks\u0027 #thinknottink","Alan Joyce @QantasAirways has done more to damage the Irish brand than decades of #IRA bombings. He is a terrible little man.","#abcnews24 Alan Joyce took over with Sales Act in place, this isn\u0027t a new challenge. Only 39% is foreign owned.","Alan Joyce you\u0027re a flipping idiot. You\u0027re selfish. From this point of view you care about protecting your own position....","I don\u0027t exactly see why people are bothering to want Alan Joyce to resign... What are they hoping is the consequence? @sunriseon7","Should Alan Joyce #QantasAirways CEO resign amid sacking 5000 workers \u0026 sending the company to the brink, yes! Every other CEO would have to","[Brisbane Times Biz] Qantas chief Alan Joyce to announce job cuts http://t.co/LLHNIlxJhq","#Australia News Qantas and unions to meet Qantas chief Alan Joyce will face union officials for crisis talks af http://t.co/9OAlYTUcMq","@ABCNews24 that woman who interviewed Alan Joyce was so so rude. I would have told her to fuck off. Cool, calm and collected Mr Joyce.","Can\u0027t believe Alan Joyce \u0026 the Board keep their positions at Qantas after some really bad business decisions leaves their profit tumbling","Is Alan Joyce the only unlikeable Irishman? He\u0027s an evil leprechaun who\u0027s bad  management is costing jobs. #Qantas","Remember how proud you felt watching Rainman - #Qantas has never crashed. That was until Alan Joyce took over","Virgin passenger numbers soar after #Qantas Alan Joyce hoax campaign: http://t.co/UQ5UkhbbFl","@mmmhotbreakfast  clown of the week Alan joyce,  qantas,  im sick of hearing what he \u0027tinks\u0027 #thinknottink","@couriermail So Alan Joyce is basically saying \"he\u0027s da man\"?","RT @TheNewDaily_: Should Alan Joyce keep his job as @QantasAirways CEO? We asked business leaders to weigh in. http://t.co/vIF4jdhGU2 http:…","So union leaders’ priority after 5000 #Qantas job losses announced is to meet with Alan Joyce, not their members. Pathetic. #ausunions","‘Strike action won’t help Qantas’ http://t.co/01RjaY8mdL","RT @sunriseon7: \u0027I\u0027m confident that the plan is the right plan and that the business can be turned around\u0027 Alan Joyce #sun7 #qantascuts @Qa…","Qantas boss to meet with unions over job cuts: Qantas boss Alan Joyce will begin talks with unions today after... http://t.co/jSCd1gAWUD","RT @pwlister: Its time to go.... Alan Joyce #qantas #qantascuts","Sack Alan Joyce first!!! He needed to go before he destroy our airline!!! SACK HIM INSTEAD OF THOSE HARD WORKERS!","5000 jobs to go at Qantas, so should CEO Alan Joyce keep his? http://t.co/XWV6N0AHnq","Qantas board is behind me: Joyce http://t.co/Y82huz8wxO @getNewsLoop","Qantas CEO Alan Joyce: “I believe I am the man, the board believes I am the man, shareholders believe I am the man.” http://t.co/3FUP0FhDFT","@SPOOKS219 @WhosFibbing @sunriseon7 Alan Joyce is not the problem! Australians who do not support Qantas are!","@Thetodayshow  Get rid of Alan Joyce and put this guy in charge","Mr Joyce\u0027s head should have been the 1st on the chopping block, why is it always the real worker not the bludger CEOs http://t.co/pq8oEFnyzt","I can\u0027t see how Alan Joyce can survive this crisis. Time 4 shareholders 2 speak loud \u0026 clear. Board has responsibility 2 take action #qantas","RT @lifeoftristan: Alan Joyce of Qantas should either stand down or give back part of this $5.01 million a year pay-packet to help those 50…","@MayneReport Time for #Qantas shareholders to sack not just Alan Joyce but the Board that has kept backing his incompetent decisions #Auspol","RT @abcnews: Qantas boss Alan Joyce to meet with unions after airline announces 5,000 job cuts http://t.co/u7AuhPTTwU","#Qantas CEO Alan Joyce will begin talks with unions after announcing 5,000 jobs will be cut over three years http://t.co/36pL1rGpFv","RT @abcnews: Qantas boss Alan Joyce to meet with unions after airline announces 5,000 job cuts http://t.co/u7AuhPTTwU","RT @theprojecttv: Remember, Alan Joyce has a long history in aviation. His job before was working for Ansett. What ever happened to them? #…","Generally i tell people in business never give up.In the case of this person I\u0027m prepared to make an exception https://t.co/Dt4OszqfWY","@profdavidflint Alan Joyce has my full support I fly Qantas always, those who don\u0027t fly Qantas should have no say!","Sacking 5000 ordinary #Qantas workers won\u0027t boost brand loyalty. Try #AlanJoyce \u0026 board members http://t.co/aAqXaM2wB5 via @ConversationEDU","http://t.co/KMpeLxzCxb Qantas and unions to meet: Qantas chief Alan Joyce will face union officials for crisis ... http://t.co/d6E5Hkbw8s","So it looks like Alan Joyce WAS the best person to run Qantas into the ground.","RT @profdavidflint: The Alan Joyce hate campaign is a distraction from the longstanding   policy of refusing Qantas a level playing field h…","How can Alan Joyce not resign. Anyone who runs a company into the ground like he has would have been sacked years ago.","By which measure is Alan Joyce doing a good job? Profitability? Share price? Customer satisfaction? Improvement of service? #Qantas","#Alan Joyce says strike action won\u0027t help Qantas - http://t.co/QziyNCDeel http://t.co/SBMjKDBMLl","Making @SENNews at 8 Alan Joyce resists fresh calls for his head, \u0026 landslide fears for Hazelwood mine","Qantas boss Alan Joyce to meet with unions after airline announces 5,000 job cuts http://t.co/u7AuhPTTwU","RT @drng: Sinclair Davidson argues why Alan Joyce should be one #Qantas employee who loses his job in @ConversationEDU \nhttps://t.co/agH1bv…","At 8 on @mixmelbourne - workers question how Alan Joyce still has a job; and cigarette butts can be properly recycled.","Yes @QantasAirways RT @sunriseon7: Should Alan Joyce resign? http://t.co/UIrU2QIF8C #qantas #qantascuts #sun7","Qantas chief vows to stay on despite losses, job cuts http://t.co/0GLx817hjt via @ABCNews","RT @Bad_Cat_: What\u0027s wrong with Qantas? Alan Joyce is what is wrong with Qantas. #qantas","‘Strike action won’t help Qantas’: QANTAS chief executive Alan Joyce is warning against any strike act... http://t.co/xJAT2PVPic #travel","RT @RNBreakfast: Our interview with Alan Joyce will be available shortly. After 7:30, we get the reaction of the unions w/ @actudave: http:…","@nanoview Alan Joyce is behind him.","RT @macuser2323: Of course Jeff Kennett with his LNP values supports Alan Joyce. #sun7","RT @smh: #Qantas CEO Alan Joyce is on course for another showdown with the airline\u0027s heavily unionised workers http://t.co/EKmPbRu7Qd.","How much of the joke should be on Joyce?  http://t.co/lDfDGEqqgX","Everyone just SHUT UP\nRT @TheNewDaily_: Should Alan Joyce keep his job as @QantasAirways CEO? We asked business leaders to weigh in.","RT @stevesownnacc: BREAKING NEWS: Fresh from his success at #Qantas, Alan Joyce to be named candidate for the position of next ALP Federal …","RT @stevesownnacc: BREAKING NEWS: Fresh from his success at #Qantas, Alan Joyce to be named candidate for the position of next ALP Federal …","QANTAS boss Alan Joyce faces union bosses today, and he\u0027s refusing to rule out further job losses @QantasAirways. More at 7","RT @sunriseon7: Should Alan Joyce resign? VOTE HERE: http://t.co/sdhamKpafC http://t.co/ycAxgA4bKo","@RossAndJohn You can say what you like about Alan Joyce, he does know how to create a small business - start with a big business. #Qantas","RT @Bad_Cat_: What\u0027s wrong with Qantas? Alan Joyce is what is wrong with Qantas. #qantas","Should Alan Joyce keep his job as Qantas CEO? RBS might need a new CEO.  http://t.co/dWjNEWZ6Jo","What\u0027s wrong with Qantas? Alan Joyce is what is wrong with Qantas. #qantas","RT @smh: #Qantas CEO Alan Joyce is on course for another showdown with the airline\u0027s heavily unionised workers http://t.co/EKmPbRu7Qd.","BREAKING NEWS: Fresh from his success at #Qantas, Alan Joyce to be named candidate for the position of next ALP Federal Treasurer. #auspol","Should Alan Joyce keep his job as @QantasAirways CEO? We asked business leaders to weigh in. http://t.co/vIF4jdhGU2 http://t.co/eonPyMFPZf","RT @tveedercom: Transcript of #Qantas CEO Alan Joyce on @SunriseOn7 this morning http://t.co/BNPMIhZSZz","The 5000 Qantas job losses should include Alan Joyce http://t.co/zvFCyX80qJ","Independent Senator NICK XENOPHON says ALAN JOYCE and the #QANTAS board should resign over their failed ASIA strategy. #2UE BREAKFAST","Sinclair Davidson argues why Alan Joyce should be one #Qantas employee who loses his job in @ConversationEDU \nhttps://t.co/agH1bvR73P","#sun7  Alan Joyce should take a dramatic paycut to ground staff wages, and  get the airline out of difficulties before resuming pay scale.","@9NewsAUS @QantasAirways @thetodayshow Alan Joyce should be sacked, not the workers","@sunriseon7 exactly. The figures are all there pointing to one responsible: Alan Joyce","Should Alan Joyce keep his job as Qantas CEO? | The New Daily: http://t.co/T0wVmhWscO  He shd never have been appointed in the first place.","RT @RNBreakfast: Our interview with Alan Joyce will be available shortly. After 7:30, we get the reaction of the unions w/ @actudave: http:…","@sunriseon7 bullying Alan Joyce out of a job when hes doing all he can to compete in a market full of government supported airlines! #qantas","@RNBreakfast @actudave Alan Joyce\u0027s mismanagement of Qantas while drawing huge salary and bonuses makes me sick. Won\u0027t be tuning in to this.","RT @smh: #Qantas CEO Alan Joyce is on course for another showdown with the airline\u0027s heavily unionised workers http://t.co/EKmPbRu7Qd.","RT @leftocentre: Alan Joyce unveils the planned addition to the QANTAS fleet....\n\n#lateline\n\n#auspol http://t.co/VvR7cvMZeR","RT @smnaustralia: SHOULD Alan Joyce QUIT? (YES! ed-op)►http://t.co/5eHmS2MUTY #Qantas #AUSpol http://t.co/XKpyQQbWcX","RT @smh: #Qantas CEO Alan Joyce is on course for another showdown with the airline\u0027s heavily unionised workers http://t.co/EKmPbRu7Qd.","I\u0027m not racist, but Alan Joyce is a bit of a dick.","RT @sunriseon7: Should Alan Joyce resign? VOTE HERE: http://t.co/sdhamKpafC http://t.co/ycAxgA4bKo","RT @sunriseon7: Should Alan Joyce resign? http://t.co/CmsxzLIv9K #qantas #qantascuts #sun7","RT @RNBreakfast: Our interview with Alan Joyce will be available shortly. After 7:30, we get the reaction of the unions w/ @actudave: http:…","RT @smh: #Qantas CEO Alan Joyce is on course for another showdown with the airline\u0027s heavily unionised workers http://t.co/EKmPbRu7Qd.","RT @thetodayshow: \"This is tough circumstances, tough environment...but I believe we can turn this around\" @QantasAirways CEO, Alan Joyce #…","Joyce and his fellow executives should be the first out the door.Should Alan Joyce keep his job as Qantas CEO? http://t.co/SU6wrm72pV","RT @smh: #Qantas CEO Alan Joyce is on course for another showdown with the airline\u0027s heavily unionised workers http://t.co/EKmPbRu7Qd.","RT @smh: #Qantas CEO Alan Joyce is on course for another showdown with the airline\u0027s heavily unionised workers http://t.co/EKmPbRu7Qd.","RT @smh: #Qantas CEO Alan Joyce is on course for another showdown with the airline\u0027s heavily unionised workers http://t.co/EKmPbRu7Qd.","#Qantas CEO Alan Joyce is on course for another showdown with the airline\u0027s heavily unionised workers http://t.co/EKmPbRu7Qd.","RT @sunriseon7: \u0027We have made significant changes but unfortunately there is a lot more that needs to be done.\u0027 Alan Joyce #sun7 #qantascuts","Transcript of #Qantas CEO Alan Joyce on @SunriseOn7 this morning http://t.co/BNPMIhZSZz","RT @Jordee66: Take a personal paycut Alan!!!! Does any one like Alan Joyce? @QantasAirways @thetodayshow","RT @OliviaIllyria: \"Qantas have delivered profit year-on-year from 1992 until Alan Joyce took over.\" http://t.co/HT0WjwkS8a","@sunriseon7 does it matter if Alan Joyce resigns? Until Australia can compete on an international market business will keep suffering","@sunriseon7 @QantasAirways I\u0027m not confident in Alan Joyce: destroyer\u003d Another Sol Trujillo","RT @mcleetonii: Alan Joyce got paid $3 000 000 last year to make Qantas $6 000 000.\nI think I know what Qantas\u0027s problem is.\nSo can I have …","RT @Wraithaz: Well, since #Qantas, under that neo-lib Alan Joyce, is betraying Aust by sending jobs offshore; don\u0027t give \u0027em a public cent.…",". @sunriseon7 Funnily enough, Sam didn\u0027t APPLY for a CEO job, Alan Joyce did.","RT @smnaustralia: SHOULD Alan Joyce QUIT? (YES! ed-op)►http://t.co/5eHmS2MUTY #Qantas #AUSpol http://t.co/XKpyQQbWcX","RT @thetodayshow: \"I don’t believe any company can guarantee a successful company all of the time\" - CEO Alan Joyce #today9","RT @sunriseon7: \u0027We need to make significant changes in order to save as many jobs as possible\u0027 Alan Joyce #sun7 #qantascuts","RT @JennaPrice: Alan Joyce should take one for the team. @QantasAirways http://t.co/ZeiVfxZWDm","Alan Joyce is on Sunrise after the 7 o\u0027clock news... \u0026 have a go at the poll stats... When I voted 94% of viewers... http://t.co/wtBJd6kjeY","RT @AlanJoyceCEO: Vote NO now! #meansnothing RT @sunriseon7: Should Alan Joyce resign? VOTE HERE: http://t.co/plAQQK64FL http://t.co/XlhV4F…","#sun7 Great point made, 5000 Qantas employees lose their job yet the people who caused financial issues stay employed! Alan Joyce - RESIGN!","Vote NO now! #meansnothing RT @sunriseon7: Should Alan Joyce resign? VOTE HERE: http://t.co/plAQQK64FL http://t.co/XlhV4FMElB","Alan Joyce says carbon tax hasn\u0027t helped but the issues @QantasAirways faces are much bigger on @SkyNewsBiz #auspol #ausbiz","@sunriseon7 @QantasAirways nobody else wants Alan Joyce now so he has to stay.","Alan Joyce\u0027s #Qantas salary is $3.3M. Surely someone on $1M could do no worse a job and we save $2.3M right there!","@jrajca Why is Alan Joyce spending the morning out in The Rocks talking to the media. Has he lost his office.....","RT @sunriseon7: LIVE now on #sun7: Alan Joyce on #qantascuts","Of course Jeff Kennett with his LNP values supports Alan Joyce. #sun7","Alan Joyce “It just adds oil to the fire\" 2/2 #Qantas","RT @MGliksmanMDPhD: #Qantas chief vows to stay on despite losses http://t.co/A1ZPDrlIvj Of course he\u0027s not going elsewhere. Who else would …","Alan Joyce \"Sensible heads out there know that the last thing you want to do is to be talking about industrial action\" 1/2 #Qantas","RT @sunriseon7: \u0027I\u0027m committed and I\u0027m passionate about this business being successful\u0027 Alan Joyce on whether he should resign  #qantascuts…","“@SkyNewsAust: I\u0027m talking to @QantasAirways CEO Alan Joyce next on  (@Kieran_Gilbert) - call for his resignation enough is enough","Watching some woeful morning TV coverage on Sunrise of the 5000 #Qantas sackings. Alan Joyce, clueless anchors now Mark Latham. Bleurgh.","RT @mcleetonii: Alan Joyce is no good at his job, so 5000 workers pay the price. Alan will be OK, he will get a bonus for cutting costs. \nT…","RT @Kieran_Gilbert: I\u0027m talking to @QantasAirways CEO Alan Joyce next on @SkyNewsAust","@sunriseon7 @QantasAirways Alan Joyce need to stay and keep the kangaroo flying all around the world! He doing bloody good!","I\u0027m talking to @QantasAirways CEO Alan Joyce next on  (@Kieran_Gilbert)","I\u0027m talking to @QantasAirways CEO Alan Joyce next on @SkyNewsAust","@sunriseon7 this decision wasn’t made by Alan Joyce alone. The whole Board + manage’t would have agreed. Don’t make him the martyr. #sun7","#auspol @sunriseon7 once again has dumb Sam stuttering \u0026 unable 2 read quests 2 Alan Joyce! Sam is destroying program \u0026 must b removed.","hands up all those who DON\u0027T think Alan Joyce has ruined Qantas ... *crickets* ... #Sun7 #QantasCuts #auspol","\u0027I\u0027m confident that the plan is the right plan and that the business can be turned around\u0027 Alan Joyce #sun7 #qantascuts @QantasAirways","The problem nt coming frm Alan Joyce! Bt the airline need a help!! It\u0027s any body out there helping him Gov in particular?@sunriseon7","Our interview with Alan Joyce will be available shortly. After 7:30, we get the reaction of the unions w/ @actudave: http://t.co/exCQaEXgLI","\u0027I\u0027m committed and I\u0027m passionate about this business being successful\u0027 Alan Joyce on whether he should resign  #qantascuts @QantasAirways","Wasn\u0027t Alan Joyce the guy in charge of ansett when it went under? #heneedstolosehisjob #sun7","@sunriseon7 @QantasAirways bullshit. Alan Joyce must quit now before he kills qantas","Alan Joyce needs to be sacked, but tbh...when avg wage of Qantas is $90k \u0026 global avg of aviation industry is $44k - there is an issue there","\u0027We\u0027ll continue to invest in our customers\u0027 Alan Joyce #sun7 #qantascuts @QantasAirways","\"I don’t believe any company can guarantee a successful company all of the time\" - CEO Alan Joyce #today9","Let\u0027s see if Alan Joyce can kiss his ass goodbye http://t.co/a6NDmp7MhP","Future of Qantas - \"To have a profitable, growing airline that turns the corner...\" CEO Alan Joyce #today9","Should Alan Joyce keep his job as Qantas CEO? | The New Daily: http://t.co/s9QnyHNOxR Most asked say NO he must go","Foreign investors want to invest in profitable, well managed companies. Would alan joyce\u0027s ask to repeal qantas sale act have any impact?","@thetodayshow I have it on good authority that Alan Joyce was driving the bus...","\"The company needs to change and we need to make these significant changes\" - @QantasAirways CEO, Alan Joyce #today9","\u0027We\u0027ve had continuous dialogue with the unions about changes and improvements that need to take place\u0027 Alan Joyce #sun7 #qantascuts"],"id":68,"autoSummary":"RT @Nick_Xenophon: Alan Joyce and Qantas board have brought a great airline and national icon to its knees and need to go #auspol #qantascu…"}}