{"70":{"topic":"mark henry","tweets":["Mark henry is the world\u0027s strongest man","@DevilMaySpy mark henry came out at end of heyman/lesnar promo to be f5\u0027ed through announce table.","WrestleMania 30 Lineups\nBatista Vs Randy Orton (WHC)\nThe Undertaker Vs Brock Lesnar\nDean Ambrose Vs Mark Henry (US)\nThe Wyatts Vs The Shield","RT @lukejamesbgn: Wow! R.I.P. to Mark Henry after taking that F-5 through the announcer\u0027s table...but the crowd still chants for CM Punk ha…","RT @RealKurtAngle: Reunion of pro, olympic and Amateur wrestlers at the Arnold. Randy Couture, Mark Henry and Myself http://t.co/qWwVwaAYMh","Mark Henry scares the shit out of me, and I can\u0027t help but wonder if I could wrap my arms around him.","Poor Mark Henry. Reduced to being Lesnar\u0027s punching bag","Fuck Raw. It\u0027s Armageddon. Starting with CHOCOLATE SALTY BALLS MARK HENRY AND TAG TEAM TEDDY","This dude Mark Henry...I just don\u0027t get it.","@BrockLesnar destroys mark henry though a table! Lol #F5 #awesome #thisshitisreal","Terrio gonna be in Mark Henry corner for Wrestlemania XXX in da N.O.","Mark Henry got F5d on the table when u gonna learn to stop messing with the Beast Incarnate BROOOCK LESNAAAAR http://t.co/Wrv487KHlc","Mark Henry gotta come back wit da pistol and shoot Brock Lesnar cuh.  Dat was disrespectful.","RT @Lord_Frank_Dark: So Mark Henry is the new Brock Lesnar\u0027s bitch? http://t.co/3CouSgykXG","@TheWWECody The BEAST IS BACK and I can\u0027t believe what he did to mark Henry this is the second time","RT @Jagnarok: Brock Lesnar and Mark Henry are going at it, while the fans chant for CM Punk! This crowd is amazing! #Raw #WWE","RT @WWE: Trending Worldwide for @WWE #RAW: F-5, Mark Henry (@TheMarkHenry)","RT @JoeyEastman: I can\u0027t wait for Lesnar to get diverticulitis again so Mark Henry can go to his hospital room and finally get revenge on L…","That\u0027s a hell of a trio Randy Couture, Mark Henry and Kurt Angle http://t.co/Qtt5DcNwdn\"","Mark Henry never learns... http://t.co/bd2iSb3xYP","RT @RealKurtAngle: Reunion of pro, olympic and Amateur wrestlers at the Arnold. Randy Couture, Mark Henry and Myself http://t.co/qWwVwaAYMh","#WWERAW when will mark henry learn","RT @khal: Tonight\u0027s best tweet. RT @DavidDTSS: Vince got Mark Henry out here in 12 Weeks a Jobber","RT @ItzTheStan: Lesner always embarrassing Mark Henry","RT @ItzTheStan: Lesner always embarrassing Mark Henry","Aaaaaaand there goes Mark Henry for another five months. #RAW","Lesner always embarrassing Mark Henry","@cagetheyanks This Raw has been awesome! Brock Lesnar destroyed Mark Henry and tossed a TV monitor in to the crowd. Maybe a lawsuit coming.","RT @WWE: Trending Worldwide for @WWE #RAW: F-5, Mark Henry (@TheMarkHenry)","“@manzoboy69: Mark Henry be like http://t.co/CrKkcqqK3x” when bae won\u0027t answer his txt","RT @WNSource: Brock Lesnar destroys the announce table. \n\nPICKS UP MARK HENRY.\n\nF5 THROUGH THE TABLE! IT\u0027S CRAZY IN CHICAGO! #WWE #Raw","RT @WNSource: Brock Lesnar goes to the back...\n\nUntil Mark Henry stops him.... #WWE #Raw","RT @WWE: Trending Worldwide for @WWE #RAW: F-5, Mark Henry (@TheMarkHenry)","Mark Henry look smack like Rick Ross! 😂","RT @KeepItFiveStar: Black History Month is OVER, Mark Henry...Welcome to March.","@WWE startin off kn a high note tonight huh. I\u0027m mad y\u0027all got Mark Henry lookin like a str8 biiiiiitch though","RT @KeepItFiveStar: Oh, NOW Big E. shows up. Where was he when Mark Henry was getting put in the Hall Of Pain...again?","Great #Raw so far. First Brock Lesnar F5  Mark Henry through a table and now the Uso\u0027s won the tag titles. #RawChicago","@wwe really needs to bring back the Spanish announce table for Brock to put Mark Henry through","They eh tired of beating mark henry wtf daman. Doing mama roftl awa e","RT @MissJaynieH: #WWE Brock Lesnar destroys the announce table. \n\nPICKS UP MARK HENRY.\n\nF5 THROUGH THE TABLE! IT\u0027S CRAZY IN CHICAGO! #WWE #…","uhhh just so with Mark Henry?? @WWEUniverse #RAW","Mark henry big n fat for nun.. He can\u0027t do shit!","RT @KeepItFiveStar: Oh, NOW Big E. shows up. Where was he when Mark Henry was getting put in the Hall Of Pain...again?","@ced_the_gr8 @Kaibutsu no I\u0027m saying Mark Henry running rough shod over the WWE like Austin. Not happening. Black rule breakers are HEELS.","Big E: \"hey where my boi Mark Henry\"","RT @MissJaynieH: #WWE Brock Lesnar destroys the announce table. \n\nPICKS UP MARK HENRY.\n\nF5 THROUGH THE TABLE! IT\u0027S CRAZY IN CHICAGO! #WWE #…","RT @KeepItFiveStar: Oh, NOW Big E. shows up. Where was he when Mark Henry was getting put in the Hall Of Pain...again?","RT @KeepItFiveStar: Oh, NOW Big E. shows up. Where was he when Mark Henry was getting put in the Hall Of Pain...again?","mark henry is one big man","RT @stillreal2us: Poor Mark Henry just got his ass whooped #wwe #raw http://t.co/4DnTBHrKsi","\"@DAsharpshooters: Welp. Looks like we are going to get another Mark Henry return in a few months. #wwe #Raw\" -- Lol!","@Sir_Grimes true, but it would work better if Mark Henry actually looked dangerous","@JCLayfield tell mark Henry to stop messing with brock or it could be an early retirement for him.#RAW #WWE","@JCLayfield @WWE  Mark Henry needs to hire the APA for protection from Brock Lesnar...#DAMN","Youd think Mark Henry would get it by now #raw","RT @WWEgames: Maybe.. Maybe Mark Henry stops showing up during @BrockLesnar\u0027s time in the ring? Just a thought. #RAW","@Derrick_Stan not much uso twins are the new tag team champions and lesnar just destroyed mark Henry","RT @NotJimRoss: Mark Henry was once intimidating.\n\nMark Henry is now about as intimidating as a microwavable hamburger. #Raw","Mark Henry has trended 5 times since #Futures Canada began - see the chart at http://t.co/6796Kzx0Wx","RT @Jagnarok: Brock Lesnar and Mark Henry are going at it, while the fans chant for CM Punk! This crowd is amazing! #Raw #WWE","@WWE Mark Henry comes out and gets his weekly beatdown.  The Nature Boy could put up a better fight than Henry!","Mark Henry jobbing to Brock Lesnar 3 times is not believable @WWE #equality","RT @yeeevs: Mark Henry F5\u0027d through the table!!","RT @GULLYKING82: Mark Henry got his ass F5ed through the table ain\u0027t learned shit from the last time Brock whooped his ass niggas never lea…","RT @ByMikeMooneyham: That\u0027s what they pay Mark Henry to do. #WWE, #Raw","RT @nodqdotcom: Lesnar gives Mark Henry an F5 through the table... and the crowd responds with @CMPunk chants. #raw","RT @The_Dalyxman: Mark Henry still wants some of Brock Lesnar??? Okay, let\u0027s go. @WWE #RAW","Ugh.  Perhaps I should be happy missing the top of the show.  RT  @CaptoniousMonk  I\u0027m tired of Mark Henry getting his butt whooped.","#Raw man Brock lesner kick mark Henry\u0027s ass wow he\u0027s the man !!!!","RT @a_vrs: How did Brock pickup Mark Henry like that....","RT @QueensiceZ: Mark Henry needs to stop going against Brock Lesnar it never works out good for Mark Henry. #WWE.#RAW. #RawChicago.","RT @Trademark629: Cheering for Mark Henry? So much for hijacking.","mark henry is my dude","#Raw someone tell mark Henry that he deserved that","I think Mark Henry is getting inducted in his own Hall Of Pain!! #WWE #RAW #WWEChicago","RT @Jagnarok: Brock Lesnar and Mark Henry are going at it, while the fans chant for CM Punk! This crowd is amazing! #Raw #WWE","omg mark Henry just got slammed by brock lesner #undertaker is raw","#RawChicago mark henry and f5 is trending worldwide #Raw","Mark Henry thrown through a table, tag team titles changed hands \u0026 its not even a hour in #Whattt #Raw","THE USOS!! My NINJAS!! New champs! Ok WWE, you made up for that Mark Henry bullshit!","RT @JamesRush25: what about mark henry? @RalphRetro","#Raw started w/ Heyman coming out to CM Punks music and running his mouth + Lesnar sending a message to Undertaker by taking out Mark Henry.","#RAW #WWEChicago  USOS and Brock vs New age outlaws and mark Henry","@JamesGuttmanWWI I agree Lesnar is amazing.  You can\u0027t man-handle Mark Henry two or three times in a row and not be amazing. #RawWWI","@Nicky_Gilbert @MattCizzle @BritneyHebert7 you\u0027re nothing compared to mark henry. stop.","RT @_dylandevlin3: Mark Henry at the #Oscars2014 http://t.co/mfzDrZ6Mbd","RT @blowticious: Mark Henry gotta summon his inner beard power, dawg.","RT @WWE: Trending Worldwide for @WWE #RAW: F-5, Mark Henry (@TheMarkHenry)","Mark Henry still wrestles?","RT @CJStarchild: LOL RT @and1grad: RT @davidmac90: 12 weeks a Kofi. Lets be real. RT @DavidDTSS: Vince got Mark Henry out here in 12 Weeks …","RT @WNSource: Brock Lesnar destroys the announce table. \n\nPICKS UP MARK HENRY.\n\nF5 THROUGH THE TABLE! IT\u0027S CRAZY IN CHICAGO! #WWE #Raw","brock lesnar really fucked mark henry up earlier","RT @ZProphet_MMA: GIF - Brock F5\u0027s Mark Henry #RAW   http://t.co/W8sbxuwPLc","So Mark Henry is not in the Wrestlemania card? Or can he heal as fast as Big Show after Royal Rumble?","Mark Henry gotta summon his inner beard power, dawg.","RT @TheWWECody: Brock Lesnar F-5 Mark Henry through the announcer table! #Raw","Mark Henry http://t.co/KV86sRmUBz","On #RAW, it\u0027s sad that in a world where Brock vs Taker at WM 30 is one of the main-events, they still need Mark Henry to put over Lesnar","Mark Henry is spending the last few years of his career as a upper mid-card punching bag, it seems.","Sandow or Ziggler with a guy like the Big Show or Mark Henry. Those work. See Kane/Daniel Bryan and the Rock n Sock connection.","@MattCizzle @kassiedawnt @BritneyHebert7 If you had to rate me from 0 to Mark Henry, where do I on the cuteness scale?","Watching #RAW, did Brock Lesnar really do it to Mark Henry again? Stay out of his way. #WWE #CMPunk","RT @RingsideNews: Mark Henry comes out to kick the crap out of Brock Lesnar... well, at least we can say he tried #RAW http://t.co/042E4wcF…","Did anyone else think Mark Henry was the strongest man in the world as a kid? LOL","Can\u0027t believe Mark Henry just got tha F-5!!!  #brocklesner @wwe","Mark Henry needs to stop going against Brock Lesnar it never works out good for Mark Henry. #WWE.#RAW. #RawChicago.","@DavidDTSS ever since Mark Henry started rocking the Rick Rawse beard it has been downhill for Mark","RT @tapemachines: I don’t think Mark Henry should try to fight this man anymore. :-\\","RT @JoeyWWEFan: What\u0027s up with WWE constantly making Mark Henry look weak? Don\u0027t hype him up as the World\u0027s Strongest Man to make him look …","RT @tomdoyle94: Did anyone else see Mark Henry at the oscars last night? Cheeky devil #Oscars2014 #lookalike #bigmoma http://t.co/7cB5ssU1TW","How did Brock pickup Mark Henry like that....","What\u0027s up with WWE constantly making Mark Henry look weak? Don\u0027t hype him up as the World\u0027s Strongest Man to make him look like El Torito.","Mark Henry\u0027s neck rolls be glistenin , shawty.","Mark Henry. Concurred!!! #wwe #raw @WWE #brocklesnar","Lol mark Henry. Lesnar can\u0027t be messed with you sill bitch","RT @WNSource: Brock Lesnar destroys the announce table. \n\nPICKS UP MARK HENRY.\n\nF5 THROUGH THE TABLE! IT\u0027S CRAZY IN CHICAGO! #WWE #Raw","@MarkHenrysfan we all know that Mark Henry would do pieces to entire WWE roster.","RT @The_Dalyxman: Mark Henry still wants some of Brock Lesnar??? Okay, let\u0027s go. @WWE #RAW","RT @DavidDTSS: Vince got Mark Henry out here in 12 Weeks a Jobber","So did they bring Mark Henry back just so everyone could get a push by thrashing him?? #RAW","RT @realjasonrivera: Mark Henry didn\u0027t check the calendar. It\u0027s March. Your Black History Month Super Powers are gone. @WWE #RAW","RT @WWE: Trending Worldwide for @WWE #RAW: F-5, Mark Henry (@TheMarkHenry)","\"You picked the WRONG day Mark Henry\" haha shut up Lesnar #RAW","RT @DavidDTSS: Vince got Mark Henry out here in 12 Weeks a Jobber","RT @WNSource: Brock Lesnar destroys the announce table. \n\nPICKS UP MARK HENRY.\n\nF5 THROUGH THE TABLE! IT\u0027S CRAZY IN CHICAGO! #WWE #Raw","Mark Henry has been turned into a jobber since his return. #raw #wwe","WWE Monday Night Raw Results: Brock Lesnar gives Mark Henry F-5 through the table (GIF) http://t.co/2Uaj1P2HO1","RT @CMPuLs3: Mark Henry\u0027s new t-shirt is everything I don\u0027t like about wrestling shirts. #Raw","Mark henry is weakest strongest man in the world kmt","Brock lesner went beast mode on mark Henry #WWEChicago","Mark Henry needs to quit coming out to attack Brock. It always ends up with Henry laying on the ground","@Axl_Icon And look where the Usos were nearly 3 yrs ago, jobbing to Khali and Mark Henry in 2 on 1 handicap matches, come a long way buck","@Jsplash_lyfe he fucking f 5ed mark henry thru a table","And please @wwe stop jobbing Mark Henry every other week. It is getting old. #RAW","@theWWERAW why does mark henry think he can beat Brock lesnar?","This is, what, the third time Lesnar has beat up Mark Henry?","@MarkHenrysfan exactly Mark Henry is 100 percent now he had Lesnar beat for a second","RT @KeepItFiveStar: Black History Month is OVER, Mark Henry...Welcome to March.","Mark Henry look like a walking monster truck tire","@MattCizzle @Nicky_Gilbert @BritneyHebert7 we all have to agree that mark henry is cute as heck","Mark Henry comes out to kick the crap out of Brock Lesnar... well, at least we can say he tried #RAW http://t.co/MUS44ct363","RT @RealKurtAngle: Reunion of pro, olympic and Amateur wrestlers at the Arnold. Randy Couture, Mark Henry and Myself http://t.co/qWwVwaAYMh","RT @SK4NO: Last time mark Henry came out to Brock  it wasn\u0027t pretty.  Diff time, same results","@josh042198 did you see that F5 on Mark Henry through the announce table? That must\u0027ve hurt huh?","@miraLEONA mark henry is a punk who let a white boy beat his ass again a disgrace to our black race old uncle tom nigger and disgrace to our","RT @Jagnarok: Brock Lesnar and Mark Henry are going at it, while the fans chant for CM Punk! This crowd is amazing! #Raw #WWE","RT @_dylandevlin3: Mark Henry at the #Oscars2014 http://t.co/mfzDrZ6Mbd","Devastating beat down on Mark Henry from Brock Lesnar earlier... I think it\u0027s safe to say he is not a happy man! #RAW","@JakeCameron4 would love to understand why Mark Henry had to come out, so pointless","RT @WWEgames: Maybe.. Maybe Mark Henry stops showing up during @BrockLesnar\u0027s time in the ring? Just a thought. #RAW","RT @WWE: Trending Worldwide for @WWE #RAW: F-5, Mark Henry (@TheMarkHenry)","RT @SK4NO: Mark Henry such a coon","Mark Henry is not The Undertaker. #RAW #RawChicago","RT @RainbowKUSH_: Mark Henry really has to stop coming out to attack Lesnar if he can\u0027t handle him lol #Raw","RT @BryanIsWWE: Trending now for the @WWE: #WWEPreShow, Paul Heyman, #hijackRAW, Mark Henry, Brock Lesnar. #RAW","RT @Jagnarok: Brock Lesnar and Mark Henry are going at it, while the fans chant for CM Punk! This crowd is amazing! #Raw #WWE","RT @SmallzYT: So when Mark Henry is a face he gets killed. When he a heel he\u0027s kills everyone. Got it #RAW","RT @TheHistoryofWWE: Mark Henry just needs to pull out a gun at this point. The physicality isn\u0027t working  #WWEChicago","RT @TheMattFowler: Looks like Brock Lesnar’s about to introduce Mark Henry to the BALLROOM OF INJURY! #wwe #raw","RT @WyzaNow: black history month ends and so does mark henry","@jordynsmith51 yup, but mark henry is ready and knows what to expect, brock needs to stop using objects and fight clean with WSM","#WWE Brock Lesnar destroys the announce table. \n\nPICKS UP MARK HENRY.\n\nF5 THROUGH THE TABLE! IT\u0027S CRAZY IN CHICAGO! #WWE #rawhijack","Mark Henry looking like Rick Ross lol","RT @ZProphet_MMA: GIF - Brock F5\u0027s Mark Henry #RAW   http://t.co/W8sbxuwPLc","Mark Henry Is Just A Body Full Of Air And Flesh, But Is Not The Worlds Strongest Man! #RAW","RT @realjasonrivera: Mark Henry didn\u0027t check the calendar. It\u0027s March. Your Black History Month Super Powers are gone. @WWE #RAW","@ChocnessMonsta @Kaibutsu i wouldnt say that. They treating mark henry like shit. Stone cold held titles plenty of times","RT @WWE: Trending Worldwide for @WWE #RAW: F-5, Mark Henry (@TheMarkHenry)","RT @WWERetweeting: If you\u0027re happy to see Mark Henry, RT this! #WWERetweeting #WWE #RAW","RT @Jagnarok: Brock Lesnar and Mark Henry are going at it, while the fans chant for CM Punk! This crowd is amazing! #Raw #WWE","#Raw F5 F5 F5 to Mark Henry by @BrockLesnar that was nasty.","@WWECreative_ish Is there something about Mark Henry that we didn\u0027t know? http://t.co/rh38jMa0XP","RT @BryanIsWWE: Trending now for the @WWE: #WWEPreShow, Paul Heyman, #hijackRAW, Mark Henry, Brock Lesnar. #RAW","RT @WWE: Trending Worldwide for @WWE #RAW: F-5, Mark Henry (@TheMarkHenry)","RT @kissingcontest: I hope when mark Henry comes out of his coma from that F5 he transforms back onto sexual chocolate mark Henry","RT @RebelSen: I call so much b.s. If Mark Henry is the world\u0027s strongest man. How come the @wwe always make him seem so weak? #RAW","Mark Henry got F5\u0027d through the announcer table “@AkmarShabazz: What happened on RAW so far?”","RT @lukejamesbgn: Wow! R.I.P. to Mark Henry after taking that F-5 through the announcer\u0027s table...but the crowd still chants for CM Punk ha…","what about mark henry? @RalphRetro","I want the mark Henry to pound his face in","Mark Henry deserves better than this 18 years he\u0027s given #WWE let him whoop Lesnar\u0027s ass 1 time #ChicagoRAW","RT @realjasonrivera: Mark Henry didn\u0027t check the calendar. It\u0027s March. Your Black History Month Super Powers are gone. @WWE #RAW","RT @and1grad: RT @davidmac90: 12 weeks a Kofi. Lets be real.  RT @DavidDTSS: Vince got Mark Henry out here in 12 Weeks a Jobber","RT @Jagnarok: Brock Lesnar and Mark Henry are going at it, while the fans chant for CM Punk! This crowd is amazing! #Raw #WWE","RT @KeepItFiveStar: Black History Month is OVER, Mark Henry...Welcome to March.","@Beantown_OS Just started. Brock Lesnar beat up Mark Henry for some reason. Wasn\u0027t really paying attention.","RT @Jagnarok: Brock Lesnar and Mark Henry are going at it, while the fans chant for CM Punk! This crowd is amazing! #Raw #WWE","@MarkHenrysfan Mark Henry hasn\u0027t forgot what Brock Lesnar did to his elbow but now Mark Henry got F5 threw the table","We are watching #WWERAW watching Mark Henry get bodied by Brock Lesnar. My wife Krystal DS-Jadore says \"They... http://t.co/9ttd5zTkmf","Dam Seeing Mark Henry Going Though The Announce Table! That Was Awesome! #RawChicago","RT @DaRealistRapper: CM Punk chants runs wild #RawChicago til Paul Heyman \u0026 @BrockLesnar destroy Mark Henry . What a way to kick off Raw to…","#Raw Brock Lesnor beat up mark henry again !!","I wish big show and mark henry and under taker would gang up on Brock and kick his butt big time! ! ! That would be great! !","Mark Henry got destroyed again lol","RT @KeepItFiveStar: Mark Henry\u0027s pride just got put in the Hall Of Pain.","\"@WWE: Trending Worldwide for @WWE #RAW: F-5, Mark Henry\"  Don\u0027t think @WWE are going to show #rawhijack is Trending Worldwide too","RT @WWEgames: Maybe.. Maybe Mark Henry stops showing up during @BrockLesnar\u0027s time in the ring? Just a thought. #RAW","RT @CaliBornClinton: Brock Lesnar and Mark Henry are going at it, while the fans chant for CM Punk! This crowd is amazing! #RawChicago","RT @QoSBaszler: The fact that @BrockLesnar can F5 Mark Henry like that speaks of his explosive power....holy crap! #RAW #RawChicago"],"id":70,"autoSummary":"Mark Henry thrown through a table, tag team titles changed hands \u0026 its not even a hour in #Whattt #Raw"}}