{"71":{"topic":"jared leto","tweets":["RT @SissyRed_Angel: Jared Leto on March 3, 2014 in Studio City, California #4 http://t.co/7c6eE9DEgu","my obsession with Jared Leto is sick.","Jared Leto is a beautiful lady","No offense to Andi, but Jared Leto wore the ombré a little bit better. #TheBachelor #WTA","Jared Leto bares a striking resemblance to Steven Tyler...","Looking at @TheEllenShow selfie again\u0026I bet Bradley Cooper cut Jared Leto out on purpose.He did lose to him\u0026there was room on the right side","RT @sesy_mailing: Jared Leto♡ http://t.co/RvB76z598x","RT @GlobalGrindStyl: Terry Richardson gives us a closer look at Lupita \u0026 Jared Leto\u0027s Oscar moments… http://t.co/1whbRkB940 http://t.co/pbD…","@troyesivan what is your opinion on jared leto?","RT @GlobalGrindStyl: Terry Richardson gives us a closer look at Lupita \u0026 Jared Leto\u0027s Oscar moments… http://t.co/1whbRkB940 http://t.co/pbD…","#best #buy #4: Dallas Buyers Club: Dallas Buyers Club Jared Leto (Actor), Matthew McConaughey (Actor) | Format... http://t.co/mtJpzhYZJZ","Jared Leto on March 3, 2014 in Studio City, California #4 http://t.co/7c6eE9DEgu","Jared Leto doesn\u0027t look like he\u0027s doing too flash after all the oscars partying #poorguy","Although I try to steer clear of Man Crush Mondays, Jared Leto is a must. 🙊🙊 http://t.co/DcqhR5dAVd","Jared Leto\u0027s hair is longer than mine but he\u0027s still so damn beautiful","can i make a half hearted argument in favor of the jared leto casting decision in dallas buyer\u0027s club? the script pretty much exclusively...","And Jared Leto too for supporting actor","“@accesshollywood: Jared Leto Hasn\u0027t Seen \u0027Dallas Buyers Club\u0027 http://t.co/S1Mo6Shw6a #Oscars” @TaylorChristian nvm wanna watch with him","RT @missjacquerae: Jared Leto has prettier hair than I do. . . Wtf","Jared Leto\u0027s face actually takes my breath away","RT @kulandaybarrett: My tweet calling out #transmisogyny in @HuffPostGay: Why Some People Are NOT Happy About Jared Leto\u0027s Oscar Win http:/…","Jared Leto and Jesus http://t.co/mPQtAzowFI lewat @9GAG","#MCM Jared Leto ♥ he\u0027s beautiful http://t.co/uMNTDBvwhQ","RT @betximelena: Jared Leto is so attractive 💖👌 http://t.co/mP0Cue4rUc","Here\u0027s Jared Leto\u0027s Beyond Perfect Oscar Acceptance Speech http://t.co/7FLXwogR2D via @mashable","RT @WHEREISWALTJNR: Jared Leto wins an Academy Award for best supporting actor/gets eaten by angry homeless man.","RT @SissyRed_Angel: Jared Leto on March 3, 2014 in Studio City, California http://t.co/oc68FEQuAE","Jared Leto\u0027s speech again I\u0027m crying 😭😭😭😭😭😭😭😭😭😭","27 Reasons Jared Leto Was The Absolute Best Person During All Of Awards Season http://t.co/0qEHGlvlsd DUH","RT @LoveeeeNaomi: Jared Leto is a money bag 😩😍💰","RT @claristegmann: And the Oscar for best hair goes to Jared Leto.","Photo: ellendegeneres: So handsome. He’s on my live show tomorrow. I love Jared Leto http://t.co/DxuGoND9aw","“@CommonWhiteGrls: I\u0027m acutally dying http://t.co/xiog9wvWa0” Jared Leto\u003d Jesus","My hairs gonna be better than Jared Leto\u0027s","Jared Leto on March 3, 2014 in Studio City, California #3 http://t.co/2uuDjJTdaa","RT @IamEnidColeslaw: had a nightmare Jared Leto mentioned 30 Seconds to Mars in his Oscar acceptance speech","RT @GlobalGrindStyl: Terry Richardson gives us a closer look at Lupita \u0026 Jared Leto\u0027s Oscar moments… http://t.co/1whbRkB940 http://t.co/pbD…","@blightlessfird  I peeped that Jared Leto avatar on tumblr tho. ;)","Jared Leto ....good pic! http://t.co/lXxnSKV7AM","\"@EmilyScottx0: Jared Leto is hot idc bye\" yaaasss","RT @TheFilmStage: Our interview with Best Supporting Actor winner @JaredLeto for @DallasBuyers: http://t.co/Kj0wirKtBh http://t.co/bt92Bihb…","RT @GlobalGrindStyl: Terry Richardson gives us a closer look at Lupita \u0026 Jared Leto\u0027s Oscar moments… http://t.co/1whbRkB940 http://t.co/pbD…","RT @NH22CO: remember when edward norton beat jared leto up in fight club?","ACADEMY AWARD WINNER JARED LETO! This is how we address the dude moving forward! I love you @JaredLeto","Jared Leto is Jesus wha t","RT @BoganetteNZ: A Step By Step Guide through Jared Leto’s Trans Ignorance. http://t.co/AYjuEtWIOw","RT @SissyRed_Angel: Jared Leto on March 3, 2014 in Studio City, California http://t.co/oc68FEQuAE","RT @FlauntMagazine: Our cover for the #TheListIssue is.... @JaredLeto. You\u0027re all welcome. http://t.co/O5N5gRR9di http://t.co/OhitN8eJPl","RT @peoplemag: \"Put the rumors to rest. We are indeed dating.\" --Jared Leto \u0026 June Squibb, in their latest round of flirting. #Oscars...","Jared Leto and Jesus http://t.co/otTLwbQUxw via @9GAG http://t.co/SHJSUQCYUI","Jared Leto is so attractive 💖👌 http://t.co/mP0Cue4rUc","Andi has the same hair as Jared Leto tho #Bachelor","RT @SissyRed_Angel: Jared Leto on March 3, 2014 in Studio City, California http://t.co/oc68FEQuAE","RT @saintnicotine: How to have hair as pretty as Jared Leto\u0027s.\n\nDon\u0027t do anything to your hair. Also be Jared Leto. http://t.co/9ITqg3drJR","Jared Leto is so amazing in Dallas Buyers Club. Well deserved Oscar win. 👌","RT @IMDbEmily: Jared Leto told us the entire budget for make up and hair was $250.","RT @saintnicotine: How to have hair as pretty as Jared Leto\u0027s.\n\nDon\u0027t do anything to your hair. Also be Jared Leto. http://t.co/9ITqg3drJR","Jared Leto is a money bag 😩😍💰","RT @StevenErtelt: He Could Have Been Aborted: Best Supporting Actor Jared Leto Thanks Single, High School Dropo… http://t.co/84GOSp1PTD htt…","RT @StevenErtelt: He Could Have Been Aborted: Best Supporting Actor Jared Leto Thanks Single, High School Dropo… http://t.co/84GOSp1PTD htt…","Jared Leto on March 3, 2014 in Studio City, California #2 http://t.co/zCDFKJn9Mm","RT @carmen_mmiller: why is jared leto prettier than me?","Jared Leto your speech was incredible, just wow","Oh my god Jared Leto no EW stop it","Daydreaming about burying my face into Jared Leto\u0027s beautiful ombre locks while he sings me a Jesus lullaby","Now everyone is on the Jared Leto train","Jared Leto Dedicates Oscar To LGBT People And ‘36 Million Who Have Lost The Battle To AIDS’  http://t.co/h8PNaPDPqo via @gaycivilrights","RT @ChesterBe: Congratulations Jared Leto! That Oscar was well deserved!!","RT @peoplemag: Jared Leto\u0027s face is perfection in Ellen DeGeneres\u0027s group selfie pic. #oscars http://t.co/G0uyflWToa","RT @beaconpayne: Jared Leto pls father my children","RT @BoganetteNZ: A Step By Step Guide through Jared Leto’s Trans Ignorance. http://t.co/AYjuEtWIOw","RT @shaymitch: Jared Leto stole my look! Killing it in the hair department tonight!!! #bestcolor #ombre","RT @wkamaubell: Why Some People Are NOT Happy About Jared Leto\u0027s Oscar Win http://t.co/7aqYtbHOjW // Allies have to be able to have their c…","I will donate my chest and become a B cup to Lupita if she and Jared Leto date forever  😳😩😭😭 #obsessed","RT @SissyRed_Angel: Jared Leto on March 3, 2014 in Studio City, California http://t.co/oc68FEQuAE","Jared Leto - Best Supporting Male | 2014 Film Independent Spirit Awards: http://t.co/dXx62GcT1c via @youtube","RT @ChesterBe: Congratulations Jared Leto! That Oscar was well deserved!!","@cynthia_archila If they are comparing Jared Leto to Jesus...they are correct.","RT @LOHANTHONY: jared leto is so intelligent and beautiful why isn\u0027t he in my bed","RT @TheKingSatta: I want Roman Reigns and Jared Leto to touch me. Honestly. I\u0027ll be content if they brush pass my shoulder. #raw","ha see previous tweet \nHow Jared Leto Keeps His Hair So Crazy Gorgeous | Women\u0027s Health Magazine http://t.co/uVGA2tjBSX via @womenshealthmag","Jared leto is a beast. What a beautiful acceptance speech.","Id be so bummed if I was Jared Leto\u0027s brother. #theotherleto","Steven Tyler and Jared Leto must be brothers http://t.co/qHsuVumIqh","RT @nika_12_zg: Jared Leto has better hair than 90% of girls","@livefrome @IAmCattSadler you should ombre your hair you and Jared Leto could be twinses  #LiveFromE","RT @SissyRed_Angel: Jared Leto on The Ellen Show - March 04 , 2014 - FULL:http://t.co/1M7fISLNHQ","People getting angry over Jared Leto winning an Oscar is COMPLETELY ridiculous. #shutupandsitdown #hedeservedit #itscalledACTING","RT @HunterRaeHodges: i pray to almighty god that jared leto \u0026 lupita nyongo are a thing. their kids would glow like the gods of mt olympus …","Andi and Jared Leto have the same hair!! #WomenTellAll","Jared Leto is so hot omg 😍","Jared Leto is amazing ❤️ #LiveFromE","I told this girl behind me I didn\u0027t like Jared Leto and I can still feel her judgey eyes on the back of my head","Photoset: dogimed: There’s no kill like overkill: Jared Leto, Jennifer Lawrence, Channing Tatum, Meryl... http://t.co/3FZis5FMhm","RT @tlrd: Ellen Catches Up with Jared Leto, Lupita Nyong\u0027o, and the Pizza Guy in Post-Oscars Show:VIDEO http://t.co/ifVyFR3SnL http://t.co/…","RT @amirightfolks: I mean after taking a role that could\u0027ve been played by a trans woman, mentioning them was kinda the least Jared Leto co…","If you want Jared\u0027s issue of Flaunt, you better buy one of these... I\u0027ve seen 4 different listings sell out today lol http://t.co/41Fryv4Cc4","Jared Leto, everyone\u0027s dream guy!","LAFP \u003c3\u0027s @JaredLeto and his mom!Help #lafilmprize bring them back to Bossier City by signing this petition! http://t.co/LI7FZpENfN","RT @TVZNews: \"Vencedores\": Jared Leto posa com Matthew McConaughey no Oscar. http://t.co/829uW9mfI9","RT @Puddug: Jared Leto and his mother http://t.co/pbviXXA9R3","RT @ProLifeStuff: He Could Have Been Aborted: Best Supporting Actor Jared Leto Thanks Single, High School Dropo… http://t.co/p6w3pSEc5F htt…","@TheLadyKendrick For years I thought it was Jared Leto.","Jared Leto....is so...beautiful.....I\u0027m getting emotional........","RT @GlobalGrindStyl: Terry Richardson gives us a closer look at Lupita \u0026 Jared Leto\u0027s Oscar moments… http://t.co/1whbRkB940 http://t.co/pbD…","Lupita Nyong and Jared Leto in @InStyle. http://t.co/OXS3Y8MxvK ICYMI: See all the winners from the 2014 Academy Awards: #Oscars","@filiptelfords oh damn. Seriously Jared Leto is blowing my mind. Completely transforms onscreen, physically is only half of it.","Jared Leto is. so. Fine.\nLoved his face since \"my So-called life\"\nMmm","Jared Leto on March 3, 2014 in Studio City, California http://t.co/oc68FEQuAE","RT @TVZNews: Anne Hathaway e Jared Leto no Oscar. http://t.co/OtyPNKQt0C","im gonna marry jared leto","I miss the eye liner wearing Jared Leto whatever happened to him?","RT @TVZNews: Anne Hathaway no Oscar + Jared Leto http://t.co/scOMFADq5d","Jared leto is actually reallyy attractive without his super long hair","RT @StevenErtelt: He Could Have Been Aborted: Best Supporting Actor Jared Leto Thanks Single, High School Dropo… http://t.co/84GOSp1PTD htt…","@r38y That you’re unaware of Jared Leto!","@IAmCattSadler Jared Leto was the prettiest one at the Oscars last night. #LiveFromE","oh so Jared Leto owes his Oscar to the transgender community?","Oscars 2014: Best and Worst Moments Jared Leto, Lupita Nyong\u0027o and Alfonso Cuaron took home top honors at the Ac... http://t.co/tBFKeGziff","RT @HunterRaeHodges: i pray to almighty god that jared leto \u0026 lupita nyongo are a thing. their kids would glow like the gods of mt olympus …","Even Jared Leto have won the Oscar. @leonardodicaprio","@Bethany_Hillman Matthew  McConaughey and Jared Leto (as a tranny) good film better than Gravity was!!","RT @kulandaybarrett: My tweet calling out #transmisogyny in @HuffPostGay: Why Some People Are NOT Happy About Jared Leto\u0027s Oscar Win http:/…","RT @soberdenatural: Jared Leto how could you be so insensitive?\nThere is pain in his eyes. So much pain. I\u0027m so sorry for your pain, Leo ht…","Jared Leto has better hair than 90% of girls","RT @chantalclaret: Good job Jared Leto not mentioning LGBT people once in your acceptance speech for doing a lame Candy Darling impression.","Set de fotos: ddiego: Jared Leto is happy for his Oscar http://t.co/j6hJWK4g9H","RT @missjacquerae: Jared Leto has prettier hair than I do. . . Wtf","@nypost Jared Leto got one eye in Ellen\u0027s selfie. ;) @TheEllenShow","I want Jared Leto to braid my hair","Where has Jared Leto been all of my life!?! 😍","RT @GlobalGrindStyl: Terry Richardson gives us a closer look at Lupita \u0026 Jared Leto\u0027s Oscar moments… http://t.co/1whbRkB940 http://t.co/pbD…","How can Jared Leto be that pretty","RT @eonline: The best dressed men at #TheOscars2014: http://t.co/21P0nYqprW. Bye, swooning. http://t.co/qPJnK1fUlN","RT @Nickram83: Jared Leto, what a good speech #Oscars2014","RT @R_BruhBruh: @finger_my_kinks Jared Leto and no they\u0027re not dating lol Ellen asked her a while back \u0026 she said they were just rumors","Steven Tyler and Jared Leto 😍 #mcm http://t.co/lzfVUUTPuI","Jared Leto should have won best supporting actress.","Ad hominem logic\u003d counterproductive to #LGBT community\n\n\"Why Some People Are NOT Happy About Jared Leto\u0027s Oscar Win http://t.co/qt6d7ux1cR\"","RT @ItsBritBitch823: @Bryanna_Flagg thinks that Jared Leto is soooooo hot favorite if you agree with her","It\u0027s all about Jared Leto","Foto: running-nyc: Incidentally, I felt a little sorry for Jared Leto that he was cut out of ‘the best... http://t.co/Yk7Yg61ar6","How do I contact Jared Leto\u0027s mom???","Steven Tyler con Jared Leto me muero.","@Bryanna_Flagg thinks that Jared Leto is soooooo hot favorite if you agree with her","Jared Leto is 42 let that sink in","RT @HunterRaeHodges: i pray to almighty god that jared leto \u0026 lupita nyongo are a thing. their kids would glow like the gods of mt olympus …","@strombone1 @eddielack he wanted to rock the off-white like Jared Leto","RT @troyesivan: I am in love Jared Leto","plz dont talk about jared leto, http://t.co/u492kv5HbL","RT @carmen_mmiller: why is jared leto prettier than me?","Jared Leto.... ur hair eyes face make me melt ily http://t.co/cDtSlR4OtM","White Tux goes to Jared Leto/ DeGeneres","RT @VannsaHudgens: Jared Leto Highlights His Mom Dancing with Madonna As Favorite Oscars Moment! http://t.co/c1lTvPrD6y","I HATE long hair on dudes. But....... Avan Jogia, Jared Leto and Tyler Blackburn got it goin on. Shew weeeee. #ineedaminute","RT @amarinlucas: God damn Jared Leto","RT @_jerrylover: Jared Leto hands down looked best in a white tux #LiveFromE","Jared Leto is literally a sex god 😍😍😍","RT @10thAmendment: MSNBC Outraged Jared Leto Spoke About Ukraine And Venezuela Instead of “Transpeople” During Oscar Win Speech… http://t.c…","RT @HathawayUK: Jared Leto photobombs our lovely Anne Hathaway ! So funny!!  http://t.co/I4Tq8fWUrO","LMAO AT PEOPLE GIVING JARED LETO SHIT FOR HIS ROLE IN DBC BEING DISRESPECTFUL AND INNACURATE FUCK YALL","RT @EchelonRomance: Jared Leto con Jim Carrey #Oscars2014 http://t.co/80qRV00efi","RT @HunterRaeHodges: i pray to almighty god that jared leto \u0026 lupita nyongo are a thing. their kids would glow like the gods of mt olympus …","RT @TMZ: Earlier: Anne Hathaway -- PHOTOBOMBED ... By Prettiest Oscar Winner Ever (Arguably) http://t.co/y7BCnfkPui","They\u0027re all dressed THE SAME! Just because Kevin Spacey \u0026 Jared Leto did tuxes in color doesn\u0027t do much.  #menswear\nhttp://t.co/OzKpZVBi3M","#mcm #sorrybabehe\u0027lltakeabill Jared Leto http://t.co/2QYBkCtdyD","I\u0027m in love with Jared leto and Jarrod Chapman mmmmm","RT @ChesterBe: Congratulations Jared Leto! That Oscar was well deserved!!","@D1CK_TOO_BOMB Basically, Jared Leto\u0027s getting a lot of recognition so everyone on Tumblr is looking for something to make him look bad.","RT @TheAcademy: Jared Leto wins Best Supporting Actor.  #Oscars","Jared Leto\u0027s admiration for Lupita is so cute . The way he looks at her is just everything .","RT @GlobalGrindStyl: Terry Richardson gives us a closer look at Lupita \u0026 Jared Leto\u0027s Oscar moments… http://t.co/1whbRkB940 http://t.co/pbD…","jared leto does look like jesus though","RT @BoganetteNZ: A Step By Step Guide through Jared Leto’s Trans Ignorance. http://t.co/AYjuEtWIOw","Yes. We\u0027re all so funny + snarky. But sometimes, we can just let things be great. Lordy. Saw whole post breaking down Jared Leto\u0027s speech.","RT @OKMagazine: Jessica Biel was spotted jetting out of town at LAX today—See her killer plane style here: http://t.co/ME96bYBPcB (PHOTOS)","I like how Jared Leto can rock an ombré look.","@cmherring more like Danny Davis\u0027 and Jared Leto\u0027s hair is perfection.","People are now noticing Jared Leto because he won an Oscar can we say Bandwagons! 💁","actually really proud of my bby jared leto man","Jared Leto ","How does Jared Leto make you feel #AskTroye","There\u0027s so much sexy about Jared Leto it\u0027s not even funny","@livefrome Is Jared Leto and Leonardo DiCaprio not the sexiest!! #LiveFromE #gushingoverthem #caniknowthegirthofbothofthem","Jared Leto Hasn’t Seen ‘Dallas Buyers Club’\n http://t.co/IBN2jWNE2O","RT @my_chellee: I HATE long hair on a guy, but I wouldn\u0027t mind playing with Jared Leto\u0027s locks😍","RT @tere_107: #LiveFromE Jared Leto may be an awesome actor but come on he needs a haircut.....","Omg I\u0027m not the only one who thinks Jared Leto looks like Jesus! RT @CommonWhiteGrls: I\u0027m acutally dying http://t.co/rjhbFtYqdZ","RT @eonline: #Oscars photobomb roundup: http://t.co/ns9sbFdhx1. @Lupita_Nyongo, Taylor Swift, @JaredLeto and more! http://t.co/1AXvIRFQKe","RT @AarionnaYork: \"@CommonWhiteGrls: I\u0027m acutally dying http://t.co/ci01dSTNt6\" haha Jared Leto is god.","Jared Leto needs to father Lupita\u0027s kids","I\u0027m about to blow your mind: Jared Leto is 42.","Photo: jessiejczech: Huge congratulations to Jared Leto on his first Academy Award for Best Supporting... http://t.co/VB6tbS8jdk","remember Jared Leto and his white tuxedo jacket and his burgundy bow tie .. !!!!","RT @StevenErtelt: He Could Have Been Aborted: Best Supporting Actor Jared Leto Thanks Single, High School Dropo… http://t.co/84GOSp1PTD htt…","RT @kellyoxford: If you put me beside Jared Leto and asked random people \"who\u0027s the prettier woman,\" he would definitely win.","how is jared leto 42 years old but still has the face of a baby","10 #Trans Actors Who Could Have Played Jared Leto\u0027s Role in \u0027Dallas Buyers Club\u0027 | /Bent http://t.co/rSc9r6sYQq","RT @IanSDamonS: MTV recently tweeted out a tough question Who would rather Ian Somerhalder or Jared Leto?  Jared humbly replied “IAN. Done …","RT @StevenErtelt: He Could Have Been Aborted: Best Supporting Actor Jared Leto Thanks Single, High School Dropo… http://t.co/84GOSp1PTD htt…"],"id":71,"autoSummary":"Jared Leto and Matthew MacConaughey won Oscars ahead of Fassbander and DiCaprio that\u0027s like slovenia winning the world cup against brazil"}}