{"72":{"topic":"john travolta","tweets":["RT @DreamHouseX: John Travolta parks his planes in his driveway. ~ http://t.co/c4FQi32FPe","RT @rainnwilson: Grease 3 with John Travolta \u0026 Adele Nazim.","john travolta plastic surgery before and after","RT @kayleighrichel: Yes, John Travolta may have dyslexia, but you know what he also has? THE ABILITY TO MEMORIZE THINGS. Sorry, not buying …","RT @ElizaBayne: John Travolta accidentally pronounced Idina Menzel\u0027s name as Adele Dazim. On the bright side, he just got hired at Starbucks","RT @rainnwilson: Grease 3 with John Travolta \u0026 Adele Nazim.","Leonardo DiCaprio, Will Smith, Johnny Depp, Tom Cruise, John Travolta, Robert Downey, JR., Liam Neeson, Mark Wahlberg never won Oscars...","Why is John Travolta so gross now?! He should\u0027ve joined Leonardo DiCaprio when he visited the fountain of youth","“@rainnwilson: Grease 3 with John Travolta \u0026 Adele Nazim.”","John Travolta really meant that shit. Like, who is Adele Dazeem? Bruh. -.-","RT @billyeichner: JOHN TRAVOLTA WE ARE STILL WAITING FOR AN EXPLANATION.","RT @caseeeyfitz: Del on John Travolta pronouncing Idina\u0027s name wrong: \"Maybe it\u0027s an inside joke??\"","John Travolta messed up lol","RT @kumailn: My name already sounds like the John Travolta version of my name.","Alfie Edbrards.  My john Travolta name","\"John Travolta can call me whatever he likes.\" - 7 year old and current me.","RT @kumailn: My name already sounds like the John Travolta version of my name.","This is how John Travolta screwed up Idina Menzel’s name at the Oscars http://t.co/rOv2Va7NYv","John Travolta should not be hosting any award show... He can barely pronounce Les Mis and Idina Menzel.","RT @scottstanford1: Be fun if John Travolta was guest ring announcer tonight on #RawChicago !! Entering the ring at this time - The one, th…","RT @MeganRoss1311: \"Please welcome the wickedly talented, one and only, Adele Dazeeb.\"\n\n-John Travolta (Introducing Idina Menzel.)\n\nYOU HAD…","RT @kumailn: My name already sounds like the John Travolta version of my name.","If John Travolta was on #raw he would be announcing Brock lesnar as Brick lektor smh","RT @PatrickMooreRIP: The only reason John Travolta mispronounced Idina Menzel\u0027s name was because he was thinking about dirty dicks.","RT @haileyduquette: John Travolta literally sounded like he mixed up the letters of Idina\u0027s name and read it backwards #dyslexic?","RT @eonline: John Travolta knew how to say Idina Menzel\u0027s name at Oscars rehearsal…so where did Adele Dazeem come from?! \"Nerves.\" http://t…","RT @DreamHouseX: John Travolta parks his planes in his driveway. ~ http://t.co/c4FQi32FPe","Can\u0027t wait to see @JuanPaGalavis ... Or, if John Travolta was introducing him: \"June Pubes.\" #Bachelor #WTA @BachelorABC","RT @EricDSnider: Someone said John Travolta has dyslexia, but no, I\u0027m pretty sure it\u0027s just male pattern baldness.","RT @LesMisFandom: Here are some valuable life lessons from John Travolta:\nDon\u0027t mess up Idina Menzel\u0027s name or else your entire life will b…","RT @theguttag: \"Adele Dazeem\" was a brilliant strategic move by John Travolta.  Mess up a Broadway star\u0027s name to keep gay rumors at bay, @…","RT @rainnwilson: Grease 3 with John Travolta \u0026 Adele Nazim.","I\u0027m still trying to figure out who Adele Dazim is and why John Travolta is thinking of her.","Winter storm the day after John Travolta mispronounced @idinamenzel\u0027s name? I\u0027m not saying there is a connection, but she is the snow queen.","RT @DreamHouseX: John Travolta parks his planes in his driveway. ~ http://t.co/c4FQi32FPe","If John Travolta Had To Pronounce Everyone’s Name At The Oscars http://t.co/Ra86YgUoQo","RT @Missinfo: More awkward: John Travolta\u0027s slip-up or Matthew McConaughey/Kim Novak? #Oscars http://t.co/Ofp2t1dlh7","RT @FrankieJGrande: King and Queen of the Oscars… John Travolta \u0026 Adele Dazeem","I read today John Travolta\u0027s mispronounciation of @idinamenzel\u0027s name was most likely his dyslexia. My heart goes out to both. #Oscars2014","RT @FrankieJGrande: King and Queen of the Oscars… John Travolta \u0026 Adele Dazeem","Thanks to @Slate and John Travolta, I may also be known as Katherine Gerbson. Unless she\u0027s wanted by the authorities. http://t.co/kltHfyyWdo","John Travolta butchering Idina Menzel\u0027s name will never not be funny","“@ariana2525: Do you think John Travolta mispronunced Idina Menzel\u0027s name so we would stop thinking he\u0027s gay? #Oscars” #beardpronunciation","John Travolta is such a babe","RT @chinaboytellem: John Travolta must be the one\u0027s mispelling all of your names on @Starbucks cups.","I think the most baffling thing about John  Travolta\u0027s Oscars gaff is how he got all his hair back.","RT @eonline: The cold never bothered Adele Dazeem anyway: http://t.co/hZVLYutYJn","RT @DamienFahey: I bet John Travolta\u0027s \"Free Stress Test\" was off the charts today.","@Cumber_love @SugarVogue john travolta representing the fandom","RT @rainnwilson: Grease 3 with John Travolta \u0026 Adele Nazim.","My Facebook feed is filled with new names thanks to John Travolta","RT @billyeichner: JOHN TRAVOLTA WE ARE STILL WAITING FOR AN EXPLANATION.","RT @rainnwilson: Grease 3 with John Travolta \u0026 Adele Nazim.","RT @MattMira: I would pay 500 dollars to hear John Travolta pronounce Chiwetel Ejiofor. #Oscars2014","RT @FrankieJGrande: King and Queen of the Oscars… John Travolta \u0026 Adele Dazeem","RT @AndrewRannells: Has John Travolta issued a formal apology to Idina Menzel yet? #becausehefuckingshould","RT @kumailn: My name already sounds like the John Travolta version of my name.","RT @kumailn: My name already sounds like the John Travolta version of my name.","John Travolta accidentally pronounced Idina Menzel\u0027s name as Adele Dazim. On the bright side, he just got hired at Starbucks","Apparently John Travolta has dyslexia. I feel bad. #immabadperson","RT @ElizaBayne: John Travolta accidentally pronounced Idina Menzel\u0027s name as Adele Dazim. On the bright side, he just got hired at Starbucks","RT @FrankieJGrande: King and Queen of the Oscars… John Travolta \u0026 Adele Dazeem","Lord there\u0027s already a website where you can see how John Travolta would butcher your name haha. I truly love/hate the internet","RT @TaherehMafi: i would love to hear john travolta pronounce my name is all i have to say","@Colvinius @aptronym @Lauren_Mmm @HelenGGreenwood John Travolta is doing the voiceover","RT @billyeichner: JOHN TRAVOLTA WE ARE STILL WAITING FOR AN EXPLANATION.","RT @kumailn: My name already sounds like the John Travolta version of my name.","Still can\u0027t believe John Travolta introduced Idina Menzel at the Oscars as Adele Dazeem xD LMAO the way he says it aswell haha cracking up!","Apparently my john travolta name is \"Jennifer whayte\"","RT @kumailn: My name already sounds like the John Travolta version of my name.","RT @billyeichner: JOHN TRAVOLTA WE ARE STILL WAITING FOR AN EXPLANATION.","Leave John Travolta alone!! The poor thing. Everyone makes mistakes. #AdeleDazeem","My John Travolta name is Greig Geercia","RT @TheatreProbsKid: I still can\u0027t get over John Travolta.","RT @DreamHouseX: John Travolta parks his planes in his driveway. ~ http://t.co/c4FQi32FPe","My Indian mother just spelled Lupita Nyong\u0027o\u0027s name perfectly in a Facebook post, so John Travolta has no legit excuse whatsoever. #Oscars","RT @SarcasticRover: My John Travolta name is Bobak Ferdowsi.","RT @FrankieJGrande: King and Queen of the Oscars… John Travolta \u0026 Adele Dazeem","RT @benjpasek: \"Well...I think that should finally put it to rest\" - John Travolta mispronouncing Idina\u0027s name to end the gay rumors once a…","RT @billyeichner: JOHN TRAVOLTA WE ARE STILL WAITING FOR AN EXPLANATION.","There is so much funny in this @Starbucks RT: \"John Travolta must be the one\u0027s mispelling all of your names on @Starbucks cups.”","If JOHN TRAVOLTA can do it to IDINA MANZELL, imagine what he can do for YOUR NAME! Take it from me;THEO PATTERSEEM    http://t.co/g0dl0ee0G9","RT @billyeichner: JOHN TRAVOLTA WE ARE STILL WAITING FOR AN EXPLANATION.","RT @Slate: Vladimir Putin\u0027s John Travolta Name is Victoria Prizeef. What\u0027s yours: http://t.co/FoW7MrWRoC #JohnTravoltaNames http://t.co/O4O…","john travolta\u0027s face scares me","@kirstiealley watching you and John Travolta raise a baby","If John Travolta tried to pronounce my name he\u0027d probably be the only person in the world to do it right.","RT @kumailn: My name already sounds like the John Travolta version of my name.","Slow clap for John Travolta #Oscar2014 #dobetter","RT @kumailn: My name already sounds like the John Travolta version of my name.","RT @billyeichner: JOHN TRAVOLTA WE ARE STILL WAITING FOR AN EXPLANATION.","RT @theguttag: \"Adele Dazeem\" was a brilliant strategic move by John Travolta.  Mess up a Broadway star\u0027s name to keep gay rumors at bay, @…","RT @abc4utah: In case you\u0027re wondering, John Travolta would call ABC 4 Utah \"Abi Yoing.\" http://t.co/lPT8OiTonP #JohnTravoltaNames #Oscars","RT @ElizaBayne: John Travolta accidentally pronounced Idina Menzel\u0027s name as Adele Dazim. On the bright side, he just got hired at Starbucks","RT @ninjasexparty: more john travolta jokes please","If John Travolta Had To Pronounce Everyone’s Name At The Oscars http://t.co/lJoHp2rQI6  via @itslaurenyap","RT @dramafever: If #JohnTravolta presented Hallyu awards-\u003ehttp://t.co/MMmnPVdcgS http://t.co/vquJW0OVrx","John Travolta called Idina Menzel Adele Dazeem: What\u0027s Your Travolta name? - \"Sean Seempzon\" http://t.co/iC2Osi51R1","Still laughing about John Travolta saying Adele Dazeem","RT @billyeichner: JOHN TRAVOLTA WE ARE STILL WAITING FOR AN EXPLANATION.","RT @billyeichner: JOHN TRAVOLTA WE ARE STILL WAITING FOR AN EXPLANATION.","RT @billyeichner: JOHN TRAVOLTA WE ARE STILL WAITING FOR AN EXPLANATION.","Ok, I just learned that John Travolta is dyslexic. I apologize for anything rude I might have said.","RT @billyeichner: JOHN TRAVOLTA WE ARE STILL WAITING FOR AN EXPLANATION.","RT @rainnwilson: Grease 3 with John Travolta \u0026 Adele Nazim.","RT @kumailn: My name already sounds like the John Travolta version of my name.","My name as pronounced by John Travolta is \"Mitchel Magnus\" - @MeatBallio @lono2014 @BathSaltBetty http://t.co/gtRrvLoIHU","i think i lost brain cells from the way john travolta pronounced idina menzel\u0027s name","RT @lkbaker21: According to John Travolta, @h_scissorkicks name is Hassan Parkinsmack... New nickname?","RT @kumailn: My name already sounds like the John Travolta version of my name.","Has anyone checked on John Travolta today?","champagne-and-accordions: Guys food for thought here. John Travolta has dyslexia. Which can get worse when... http://t.co/U4UipNFWgr","RT @billyeichner: JOHN TRAVOLTA WE ARE STILL WAITING FOR AN EXPLANATION.","@brianlogandales we have the same travoltified last name! did John Travolta just accidentally marry us? http://t.co/GmwpZArUcN","RT @rainnwilson: Grease 3 with John Travolta \u0026 Adele Nazim.","RT @rainnwilson: Grease 3 with John Travolta \u0026 Adele Nazim.","RT @funnyordie: For all you Adele Dazeem fans. 10 John Travolta Quotes Updated after the Oscars http://t.co/yhIQBQOorQ http://t.co/LbKZYwm4…","John Travolta, my name is not Armina Kamisoto. ;- /","RT @rainnwilson: Grease 3 with John Travolta \u0026 Adele Nazim.","The amount of times I\u0027ve burst out laughing to myself today thinking about John Travolta at the Oscars last night is a little embarrassing.","I guess John Travolta is glad something is overshadowing the gay rumors...","No matter how rough your Monday was, at least you aren\u0027t John Travolta. #yikes","GUYS. You can now \"Travoltify\" your own name in the same style that John Travolta butchered Idina\u0027s last night. 😅http://t.co/Pn36IQsqiA","RT @ElizaBayne: John Travolta accidentally pronounced Idina Menzel\u0027s name as Adele Dazim. On the bright side, he just got hired at Starbucks","Photo: John Travolta did something to embarrass himself at the Oscars? I’m shocked. http://t.co/tXtYAEHIBI","Wait a minute.. the John Travolta name generator is a collector for the scientology goons!! Prepare to be audited!!!","RT @ImReadyForNYC: \"@kvnmiller: @idinamenzel never noticed resemblance until John Travolta mentioned.I see it now that I put u together htt…","RT @DamienFahey: I bet John Travolta\u0027s \"Free Stress Test\" was off the charts today.","RT @rainnwilson: Grease 3 with John Travolta \u0026 Adele Nazim.","Still can\u0027t get over John Travolta last night. YOU HAD ONE JOB, JOHN. #AdeleDazeem","I don\u0027t think I can ever forgive John Travolta","RT @dramafever: If #JohnTravolta presented Hallyu awards-\u003ehttp://t.co/MMmnPVdcgS http://t.co/vquJW0OVrx","RT @billyeichner: JOHN TRAVOLTA WE ARE STILL WAITING FOR AN EXPLANATION.","i want retta\u0027s video response to john travolta\u0027s unsolicited \"i love you\" played at my funeral","RT @dramafever: How #JohnTravolta would pronounce #LeeMinHo if he presented DramFever awards-\u003ehttp://t.co/MMmnPVdcgS http://t.co/dCxw81r3MD","RT @JonAcuff: Other ways John Travolta thought of pronouncing Idina Menzel\u0027s name at the Oscars. (Via Huffington Post.) http://t.co/DEaEQxI…","RT @DamienFahey: I bet John Travolta\u0027s \"Free Stress Test\" was off the charts today.","“@billyeichner: JOHN TRAVOLTA WE ARE STILL WAITING FOR AN EXPLANATION.” @colleen_cocca He is so ANGRY!","I love a joke but not when people make fun of disabilities: Travolta\u0027s #dyslexia kicks in on Idina Menzel\u0027s name http://t.co/zkctIdeW08","RT @lilgaynerd: let’s not make fun of john travolta wrt mispronunciation bc he has dyslexia. let’s do make fun of john travolta for like ev…","RT @EricStriffler: MADDOW MOHOGANY http://t.co/C4w1XX5B32 @JoeSergio #adeledazeem #oscars","10 John Travolta Quotes Updated After the 2014 Oscars John Travolta totally nailed his introduction of Id … http://t.co/BY9c8r9PJR","Little known fact, John Travolta wrote the  original \"spongeboob squirepen\" joke, he thought that was the name of the show.","RT @billyeichner: JOHN TRAVOLTA WE ARE STILL WAITING FOR AN EXPLANATION.","RT @theguttag: \"Adele Dazeem\" was a brilliant strategic move by John Travolta.  Mess up a Broadway star\u0027s name to keep gay rumors at bay, @…","RT @Possessionista: If John Travolta was introducing this, we\u0027d be about to watch the #Bachelor, Josephine Paddlebrush.","Nobody cares how John Travolta would pronounce your name. FYI","RT @DamienFahey: I bet John Travolta\u0027s \"Free Stress Test\" was off the charts today.","Teleprompter reads \"ousted Ukrainian president Viktor Yanukovych.\" John Travolta explodes.","RT @willdeutsch: Immediately after his brilliant mispronunciation last night, John Travolta was offered a job at Starbucks.","RT @ElizaBayne: John Travolta accidentally pronounced Idina Menzel\u0027s name as Adele Dazim. On the bright side, he just got hired at Starbucks","RT @samir: If John Travolta Had To Pronounce Everyone’s Name At The Oscars http://t.co/Ucn7DeaaTx http://t.co/kvIDmE2yjq","RT @ElizaBayne: John Travolta accidentally pronounced Idina Menzel\u0027s name as Adele Dazim. On the bright side, he just got hired at Starbucks","RT @billyeichner: JOHN TRAVOLTA WE ARE STILL WAITING FOR AN EXPLANATION.","i\u0027m trying so hard not to reblog those john travolta malapropisms shit bc he hAS DYSLEXIA","RT @DamienFahey: I bet John Travolta\u0027s \"Free Stress Test\" was off the charts today.","RT @billyeichner: JOHN TRAVOLTA WE ARE STILL WAITING FOR AN EXPLANATION.","RT @cammyr12: Have to practice reading off a TelePrompTer in TV broadcasting class tomorrow. DEFFss pulling a John travolta 😂@cravinCatheri…","RT @DreamHouseX: John Travolta parks his planes in his driveway. ~ http://t.co/c4FQi32FPe","RT @ElizaBayne: John Travolta accidentally pronounced Idina Menzel\u0027s name as Adele Dazim. On the bright side, he just got hired at Starbucks","I\u0027m Leona Dizuncan. “@Slate: What\u0027s YOUR John Travolta Name? http://t.co/lzrKPLOQSk #JohnTravoltaNames http://t.co/QGYQpb4SNx”","RT @FrankieJGrande: King and Queen of the Oscars… John Travolta \u0026 Adele Dazeem","RT @DreamHouseX: John Travolta parks his planes in his driveway. ~ http://t.co/c4FQi32FPe","RT @BuzzFeed: John Travolta Mispronounced Idina Menzel\u0027s Name And It Was Deeply Weird http://t.co/K2616r8bfV","RT @wylie_gorup: “@BuzzFeed: If John Travolta Had To Pronounce Everyone’s Name At The Oscars http://t.co/kVrs6lhQ4v” @HallieGorup","“@DamienFahey: I bet John Travolta\u0027s \"Free Stress Test\" was off the charts today.” Hahaha! Omg, this made me laugh for real.","RT @kumailn: My name already sounds like the John Travolta version of my name.","RT @luvelizabethany: Today in commenters who need to STFU: \"You\u0027re bullying John Travolta by posting about \u0027Travolifying your name.\u0027\"","John Travolta\u0027s Famous Movie Lines Get Spoofed In Parody Following Last Night\u0027s Oscar Flub http://t.co/8dVpVXE7Ja","RT @dramafever: How #JohnTravolta would pronounce #LeeMinHo if he presented DramFever awards-\u003ehttp://t.co/MMmnPVdcgS http://t.co/dCxw81r3MD","Did John Travolta write this Craigslist ad? #AdeleDazeem http://t.co/0v9wUgOYSQ","Still laughing at Adela Dazeem. Thank you John Travolta 😂","RT @billyeichner: JOHN TRAVOLTA WE ARE STILL WAITING FOR AN EXPLANATION.","Everybody leave John Travolta alone. He\u0027s a religious weirdo with an uber hot wife that he has no idea how to please. Dude is stressed 24/7.","RT @rainnwilson: Grease 3 with John Travolta \u0026 Adele Nazim.","NFL should let John Travolta introduce Johnny Manziel at the draft.","Cheryl\u0027s john travolta name is \"Charley Crawzford\"","RT @ElizaBayne: John Travolta accidentally pronounced Idina Menzel\u0027s name as Adele Dazim. On the bright side, he just got hired at Starbucks","RT @LogoTV: It\u0027s hard to pick a favorite Oscar moment. But if we asked John Travolta, it\u0027d be when Adele Dazim sang \"Make It Grow\" from \"Fr…","RT @MatthewCaputo_: My best Oscars moment. John travolta announcing Idina Menzel. #priceless #oscars  https://t.co/vCeDjFH0Yn @daniwatson_t…","RT @kumailn: My name already sounds like the John Travolta version of my name.","You may now call me Georgia Sgardner.  At least that\u0027s what John Travolta calls me. Hahaha!","RT @billyeichner: JOHN TRAVOLTA WE ARE STILL WAITING FOR AN EXPLANATION.","RT @DamienFahey: I bet John Travolta\u0027s \"Free Stress Test\" was off the charts today.","John Travolta’s Idina Menzel Flub Could’ve Been Avoided If He’d Watched... New on @theneeds #music http://t.co/sFTQqeaZDz","RT @SarcasticRover: My John Travolta name is Bobak Ferdowsi.","RT @sideshowkat: So what have we learned from this year\u0027s Oscars, kids? We learned that it\u0027s a good thing John Travolta didn\u0027t introduce Be…","RT @kumailn: My name already sounds like the John Travolta version of my name.","RT @billyeichner: JOHN TRAVOLTA WE ARE STILL WAITING FOR AN EXPLANATION.","RT @DamienFahey: I bet John Travolta\u0027s \"Free Stress Test\" was off the charts today.","RT @keithlapinig: I\u0027m sort of sad I\u0027ll never have the chance to have John Travolta introduce me and REALLY butcher MY name.","RT @ElizaBayne: John Travolta accidentally pronounced Idina Menzel\u0027s name as Adele Dazim. On the bright side, he just got hired at Starbucks","YEP I STILL LOVE IT http://t.co/LRsugPS5kT","RT @billyeichner: JOHN TRAVOLTA WE ARE STILL WAITING FOR AN EXPLANATION.","I don\u0027t think John Travolta messed up at all. I think he\u0027s just prepping for his role in the biography of Dr. Steve Brule.","RT @DamienFahey: I bet John Travolta\u0027s \"Free Stress Test\" was off the charts today.","I\u0027m pretty sure John Travolta is dyslexic, which means you\u0027re all TOTAL ASSHOLES. #haveyouevenSEENbrokenarrow?","RT @DamienFahey: I bet John Travolta\u0027s \"Free Stress Test\" was off the charts today.","RT @AndrewRannells: Has John Travolta issued a formal apology to Idina Menzel yet? #becausehefuckingshould","My #Travoltified name is \"Robbie Florzes\". Remind me to superkick John Travolta next time I see him. h/t @GusRamsey"],"id":72,"autoSummary":"“@billyeichner: JOHN TRAVOLTA WE ARE STILL WAITING FOR AN EXPLANATION.”\n\nLeave him alone Bolo Heicny!"}}