{"74":{"topic":"the usos","tweets":["Congratulations to the USOS!!! New Tag Team Champions! 💕 :-) #RAW @wwe","RT @TattedSavior: Congrats to the Usos.","Congrats to the Usos.","RT @LanceStorm: Damn tonight keeps getting better. Very happy for the Usos. #RAW","We got New Tag Champs The Usos it\u0027s about time","CONGRATS TO THE NEW @WWE #CHAMPS THE USOS @WWEUsos YOUR POPS IS SO PROUD OF U GUYS SO AM I 💪😆☝\u0026 OH HECK THIS A #YESMovement #YESYESYES ☝😆☝","@StarrMishell smh lol Supafly rikishi Rocks dad and his dad the usos Roman reigns Deuce Rosey Umaga stamina Snuka are all related","RT @MarkinOut: RETWEET THIS if you\u0027re happy to see THE USOS as your NEW #WWE Tag Team Champions!  #RAW #RawChicago http://t.co/ED4mxyEOC0","I am the 3rd member of the usos","The Usos NEW TAG TEAM Champions http://t.co/SwPibWXj5B","Watching raw swagger is greeneyed lovin the usos ur dad will be proud, @TheWWEGuys @WrestleMania @WWE @WWETheSource @WWEUsos","The Shield and The Usos\u003e\u003e\u003e\u003e #TheNextBigThing #WWE","RT @DJ_2BoUnCe: “@KingDavidF: The Usos the new tag team champion. #RAW #TagTitles”","RT @bktspinal: Congrats to The Usos New WWE Tag Team Champions!!!! #WWE #RAW http://t.co/Mi6oSC1iJj","also on raw tonight the usos wins the tag team titles","This @WWE #RAW is pretty live tonight! Congrats to the Usos for winning the Tag Team Belts!","RT @WWERetweeting: If you\u0027re happy The Usos defeated The NAO \u0026 became the NEW tag team champions, RT this! #WWERetweeting #WWE #RAWChicago","RT @WrestleRopes: Good to see The Usos holding championship gold for the first time! #WWE #Raw","Congrats to the USOs on winning their first tag title!... Welcome to the Tag Champ Club boys!!!\n\n#TagChamps #WWE","About time the Usos win the Tag Titles. Now who are they going to defend against at Mania?","RT @djdelz: MY SPIZZOT: The Usos Beat The New Aged Outlaws \u0026 Are New Tag Team Champions #RAW http://t.co/hbv5LmDLaJ","@TheRealXPac Oh and the Usos.","@NickCoit gotta keep this crowd from rebelling and chanting CM Punk and killing the show (also I\u0027m glad the Usos are finally champs)","@WWE @WWEUsos Finally the Usos get what they deserve! Congrats Usos","RT @realjasonrivera: The GOOD NEWS: The Usos are tag team champions.\nThe BAD NEWS: The Outlaws get a rematch so we get to see this match fo…","Your winners and NEEEEEEEEW WWE Tag Team Champions...The Usos! #Raw #wwe","RT @WWECreative_ish: The Usos win and the crowd goes wild. So much for the hijacking #RAWTonight","RT @cmmud: THE USOS ARE THE NEW WWE TAG TEAM CHAMPIONS! YES! YES! YES! #RawChicago #hijackRAW","RT @WWERetweeting: If you\u0027re happy to see The Usos, RT this! #WWERetweeting #WWE #RAW","RT @Z4PPA: FINALLT! The Usos got the belts! They worked hard for them and the match was great for it being so short. #RawChicago","Congrats to The Usos New WWE Tag Team Champions!!!! #WWE #RAW http://t.co/Mi6oSC1iJj","RT @jimmykorderas: \"We want young guys like the USOs to get their due, So we will chant for CM Punk\" -Chicago","RT @KWFlawless: THE USOS ARE NEW TAG TEAM CHAMPS!  THAT\u0027S BEST FOR BUSINESS!!!!  #RAW","RT @HellinBootsChic: Congrats To The Usos You Guys Really Do Deserve It!!!! #RawChicago","RT @WrestleRopes: Good to see The Usos holding championship gold for the first time! #WWE #Raw","RT @FightFan83: The Usos completely deserved that moment \u0026 thank you to Chicago for giving them the respect and not hijacking that moment #…","The usos are fun to watch","The usos win tag team champion!","RT @WWE_1800: The USOS winning the tag team titles tonight is awesome! RAW needed an big match like this RT if you agree #RAW #RawChicago #…","RT @LaYnUhhSoPretty: Your new TAG TEAM CHAMPIONS... THE USOS!!! Y\u0027all that been sleepin on these boys. Well the True Tag… http://t.co/YiOcC…","The tweet with the most impact of the #Usos Trend, was published by @WWE: http://t.co/oLYLDhpsxh (73 RTs) #trndnl","RT @Inside_TheRopes: Really happy that the crowd got behind The Usos and popped for their title win. Great team, bright future. #RAW","Missed the end of that match but s/o to the usos for winning the titles. #RawChicago","RT @WrestleRopes: Good to see The Usos holding championship gold for the first time! #WWE #Raw","#RawChicago wooo the new wwe tag team champions the usos and now shield/v wyatt awsome none stop","Happy for the Usos! Even though I would have booked the title win for Mania. #RAW","RT @punk_lakersx: YES! THE USOS! THEY DID IT! #RAW","RT @WWEiIndia: Congratulations to the NEW #WWE Tag Team\nChampions, The Usos... :)\n#Thakur http://t.co/e97mGBmhyC","RT @WrestleRopes: Good to see The Usos holding championship gold for the first time! #WWE #Raw","Missed the first 30 minutes of #RAW  but managed to see the usos win tag team gold.","@RenaPrengel thanks for retweeting that and spoiling that the usos won I\u0027m not watching -_-","It took The Usos three years to get the WWE tag team titles. What a shame if you ask me. #RAW","Your new TAG TEAM CHAMPIONS... THE USOS!!! Y\u0027all that been sleepin on these boys. Well the True Tag… http://t.co/YiOcCZClSL","RT @WWERetweeting: If you\u0027re happy The Usos defeated The NAO \u0026 became the NEW tag team champions, RT this! #WWERetweeting #WWE #RAWChicago","Your new Tag Team Champions... The Usos... !! #WWE #RAW\n#Thakur http://t.co/n58XOuAxSl","What a great night for the #Usos. They’ve been paying their dues for years and they finally cash in! #RAW #LateRAWtweets","RT @ericluvgirls: Hell yeah the usos are tag champs #RAW","RT @joejnapoli: Great to see the Usos win the belts. Hard working and fun team. Good future for these two. #RAW #TagTitle","RT @jimmykorderas: \"We want young guys like the USOs to get their due, So we will chant for CM Punk\" -Chicago","RT @WWECreative_ish: The Usos win and the crowd goes wild. So much for the hijacking #RAWTonight","@WWE congratulations to the usos #WWETagTeamChamps","so stoked that the usos won the tag team championship","RT @WWECreative_ish: The Usos win and the crowd goes wild. So much for the hijacking #RAWTonight","They finally give the Usos the titles","Awesome! New Tag Team Champions The Usos! #RAW @WWE","RT @WWENewsForFans: The Usos are the new Tag Team Champions! #RAW","RT @LaRosaMendes: New Tag Team Champs!!  I know how the Usos are feeling right now!!  Best feeling ever!!! #RAW","RT @WWEiIndia: Congratulations to the NEW #WWE Tag Team\nChampions, The Usos... :)\n#Thakur http://t.co/e97mGBmhyC","RT @OfficialCenafan: The Usos new tag team champions. Finally, Very much deserved. #RAW","RT @WNSource: The Usos Win WWE Tag Team Championship On RAW http://t.co/YIZVF69YC1 #wwe #raw #usos","Holy freaking crap!!! This match is crazier than The Usos vs. The New Age Outlaws! #WWERAW #WWEChicago","Congrats to the new WWE tag team champions the Usos.  #RawChicago","I knew the Usos were gunna win this time only because it will buzz around and thts what WWE wants to do to get our minds off Punk good job👌","RT @WrestleRopes: Good to see The Usos holding championship gold for the first time! #WWE #Raw","RT @SMOOVEJAZZFAN: THE USOS WIN! THEY\u0027RE FINALLY THE TAG-TEAM CHAMPS! @WWE #RAW","Glad to see the Usos get the tag belts.  Long time coming. #RawChicago","The usos is the new tag team  champions","RT @FightFan83: The Usos completely deserved that moment \u0026 thank you to Chicago for giving them the respect and not hijacking that moment #…","RT @I_Love_The_WWE: YES ! YES ! YES ! The Usos finally got the #TagTitles ! :D #RAW","@SteveandLarson I\u0027m surprised that the usos won the tag titles!","The Wyatt\u0027s suck, The Shield sucks, The Usos suck, there aren\u0027t teams like The Gentleman\u0027s Club or F.I.S.T. anymore.","RT @WNSource: The Usos Win WWE Tag Team Championship On RAW http://t.co/YIZVF69YC1 #wwe #raw #usos","RT @WrestleRopes: Good to see The Usos holding championship gold for the first time! #WWE #Raw","Congrats to the #usos for being the new tag team champions #raw #TagTitles","And it looks like the #RAW hijacking has took a halt with cheering for the Usos win and counting (cont) http://t.co/nuKRTmzIKR","@WWE @WWEUsos  I hate the usos they got lucky by beating the new age outlaws next time the usos should fight the sheild","RT @The_Dalyxman: Idiotic fans: \"I\u0027m not going to enjoy the title win because I don\u0027t like that the Usos didn\u0027t win the title at Mania.\" \u003c-…","RT @WWECreative_ish: The Usos win and the crowd goes wild. So much for the hijacking #RAWTonight","RT @WWECreative_ish: The Usos win and the crowd goes wild. So much for the hijacking #RAWTonight","Hell yeah the usos are tag champs #RAW","New!!!! WWE Tag Team Champions!!! the Usos!!!!!!","RT @OfficialCenafan: The Usos new tag team champions. Finally, Very much deserved. #RAW","RT @BrittLovesCena: Congrats to The Usos \u003c3 #NextTagTeamChamps 🙌","Yes yes yes !!! WE HAVE NEW TAG TEAM CHAMPIONS!! THE USOS!! #RAW #wwe","#Raw #WWE the usos did an incredable","Im glad The Usos put the living paws on The New Age Outlaws and won the tag team titles Congratulations #tagteamtitles","im so fucking happy for the usos\u0027 man so sosososososos happy","loool I don\u0027t understand a thing the usos say in their intro but I love it!! @WWEUniverse #RAW","The Usos new tag champs in Chicago http://t.co/wCPhZcjACB","@TheMysteryMen It was an excellent match and a cool moment. It was like with the Usos - they chased the title for what felt like forever.","Congrats to the Usos ! New tag champs ! #RawChicago","@ThatWerewolfJG I take it she likes the Usos?","@theusos, congradualations to the usos for becoming the new tag team champs. I was praying for you guys.","RT @hwrestlingradio: HOWEVER, this *should* have been a WrestleMania moment for the Usos... Think Chicago\u0027s \"hijack\" threats prevented that…","RT @ZakerAlii: THE USOS HAVE DONE IT, NEW TAG TEAM CHAMPIONS #RAW","Even though im a New Age Outlaws guy, Congrats to the Usos. This should set up a big tag match for WM30 if theyre smart. #raw","RT @WWERetweeting: If you\u0027re happy The Usos defeated The NAO \u0026 became the NEW tag team champions, RT this! #WWERetweeting #WWE #RAWChicago","RT @WWERetweeting: If you\u0027re happy The Usos defeated The NAO \u0026 became the NEW tag team champions, RT this! #WWERetweeting #WWE #RAWChicago","RT @LanceStorm: Damn tonight keeps getting better. Very happy for the Usos. #RAW","RT @JRHWriting: For those that criticized #hijackRaw, the movement just made the Usos title win more special. Comment? #wwe #raw @TNACreati…","@JRHWriting @TheAOster I think Aaron meant it cost the Usos a special win at Mania.","The Wyatt\u0027s suck, The Shield suck, The Usos suck, there aren\u0027t teams like The Gentleman\u0027s Club or F.I.S.T. anymore.","HOWEVER, this *should* have been a WrestleMania moment for the Usos... Think Chicago\u0027s \"hijack\" threats prevented that from happening. #RAW","ALSO THE USOS ARE THE NEW TAG TEAM CHAMPIONS I SCREAMED AND YELLED YEAH BABY LIKE THE AUDIO OF THAT SQUART GUY","@WWEUsos woooo aaaaaaaa\nthat\u0027s what i wanted conrgaltion folks u desarve it the new tag team champion the #usos #wwe #raw","Finally the Usos is the #TagTeamChamps","The Usos new tag team champs","The Usos, @wweusos is now trending in #Chicago http://t.co/7wI2nAoVpU","Great Matches So Far. #Raw New tag champs the Usos","The Usos Win The WWE Tag Team Championship - Raw 3/3/14: http://t.co/ODuNHDPPMz via @YouTube","RT @WWERetweeting: If you\u0027re happy The Usos defeated The NAO \u0026 became the NEW tag team champions, RT this! #WWERetweeting #WWE #RAWChicago","@wrestlingheads I like the New Age Outlaws and can\u0027t get into the usos ...  But maybe this new tag champs means rematch at mania so ....","@PieroGentile watching it lad Yoo fuck the usos lmao","So far we have seen Brock Lesnar, The Usos Winning The Tag Titles, Big E The Shield \u0026 The Wyatts \u0026 we have well over 2 hours left 😘 awesome","RT @WWERetweeting: If you\u0027re happy The Usos defeated The NAO \u0026 became the NEW tag team champions, RT this! #WWERetweeting #WWE #RAWChicago","Has it never occured to the Usos to get 2 Twitter accounts?","Title change on Raw: The Usos beat The New Age Outlaws in the TV opener in Chicago to win the WWE ta... http://t.co/nu2S15zL3S #WWE #TNA","#RawChicago  it\u0027s about time the usos become tag champions thank u","WOOOO!! New Champs!!! My tag team THE USOS!!! @WWEUsos Congrats guys no one else deserve to hold those belts more they you guys! #RAW","Yes was time 4 the usos to be championhttp://twitter.com/WWE/status/440664544352808961/photo/1","Watch CCW Spring Fever 2014 part 2 tomorrow to see if me and Vitamin C receive the same fate as The Usos did tonight! http://t.co/a95OUNxW3r","@Luke_Higgins92 well I expected more chaos from the crowd but i liked the Heyman promo and the Usos won the tag team titles finally 🙌","RT @WWERetweeting: If you\u0027re happy The Usos defeated The NAO \u0026 became the NEW tag team champions, RT this! #WWERetweeting #WWE #RAWChicago","REALLY impressed with how WWE is handling the crowd so far tonight.start with Heyman then the Usos finally win the gold now Shield vs Wyatts","Finally the usos is win the tag team belts usoooooooooooooooo#rawchicago","RT @WrestlingPotato: YES YES YES The Usos are THE NEW TAG TEAM CHAMPIONS","RT @TheHistoryofWWE: The Usos - just like Daniel Bryan - show the benefit of the slow burn. It wouldn\u0027t have meant as much if this happened…","AND NEW WWE TAG TEAM CHAMPIONS, JIMMY AND JEY THE USOS!!!!!\n@WWEUsos @WWE \n#RAW #TagTitles #UsosAreTheChampions","#Raw belive in the USOS!! #raw  #chicogo","YES YES YES! Finally The Usos are the tag champs after a great match congrats!","RT @ImAMelFo: Nobody deserved it more than the Usos! The best tag team in WWE. Congrats @WWEUsos!! #raw","RT @WrestleRopes: Good to see The Usos holding championship gold for the first time! #WWE #Raw","RT @TremayneVX: Watching #Raw proud that the Usos finally won the tag team titles in a BIG way. Winning against the #NAO? Sounds like a chi…","RT @mikexklinsky: Congratulations to the Usos! Such a good match. #RawChicago","RT @LaRosaMendes: New Tag Team Champs!!  I know how the Usos are feeling right now!!  Best feeling ever!!! #RAW","Congrats to the usos for winning the tag team championship!!! So happy! What is going to happen with the Real  Americans!!!","MY SPIZZOT: The Usos Beat The New Aged Outlaws \u0026 Are New Tag Team Champions #RAW http://t.co/hbv5LmDLaJ","RT @WWECreative_ish: The Usos win and the crowd goes wild. So much for the hijacking #RAWTonight","@LUV_THE_WWE4EVA I just jizzed over the Usos, I\u0027m not ready for this match","The usos win the title! #raw","RT @WWEiIndia: Congratulations to the NEW #WWE Tag Team\nChampions, The Usos... :)\n#Thakur http://t.co/e97mGBmhyC","Watching RAW with non-fans tonight, they\u0027ve actually been entertained thus far, they dug the shit out of the Usos.","THE USOS!!!!!! New tag team champs👍👍👍👍👍👍👍 #RAW","RT @SlingshotSuplex: CM Punk was going to come back, but he\u0027s too angry at all the people adding an unnecessary apostrophe when discussing …","Omg the USOS won? Congrats!! #wwe #raw","@TrueWWE2004 @Jtg1284 and he\u0027s friends with the USOs I don\u0027t see why it\u0027s so bad for him to congratulate his friends","RT @Bella__Twins_: YESSSSS THE USOS NEW TAG TEAM CHAMPIONS!!!! #RAW","RT @WWECreative_ish: The Usos win and the crowd goes wild. So much for the hijacking #RAWTonight","RT @The_Dalyxman: Idiotic fans: \"I\u0027m not going to enjoy the title win because I don\u0027t like that the Usos didn\u0027t win the title at Mania.\" \u003c-…","RT @kqserenity5: Finally the Usos have the titles #UsoClan #RAW","RT @wokeupolder: The Usos deserve those belts. One of the few consistently great, legitimate tag teams in @WWE. #Raw #TagTitles","Congrads to the Usos","@ChocnessMonsta It won\u0027t stick. They just didn\u0027t like the sneak attack. They had a moment last week with the Usos interrupting Road Dogg.","@x_RuthyBella_x @WWEUsos Thank The Usos won \u0026 the new Tag Team Champions","WAIT THE USOS WON THE TITLES?! Awesome","RT @The_Dalyxman: Idiotic fans: \"I\u0027m not going to enjoy the title win because I don\u0027t like that the Usos didn\u0027t win the title at Mania.\" \u003c-…","@WWE #Raw The Usos winning the tag belts was EPIC!","RT @WrestleRant: I\u0027ve got CHILLS! The Usos are TAG TEAM CHAMPIONS! What a four year chase. NO ONE is more deserving! Congrats to them! :D :…","congrats to the usos\u0027 #RAW","RT @WrestleRopes: Good to see The Usos holding championship gold for the first time! #WWE #Raw","RT @AJLeeUKWidows: The Usos are new tag team champions!!!! :D #RAW xxx","@The_Dalyxman well I could have been a bigger moment at wrestlemania. Plus makes the Usos more important and their title win","Congratulations to the #USOS @WWE  !!","RT @LaRosaMendes: New Tag Team Champs!!  I know how the Usos are feeling right now!!  Best feeling ever!!! #RAW","I say The Usos would have won those titles months ago if they didn\u0027t wear plastic shorts. #wwe #raw","RT @Romaine55: The Usos ARE WINNERS TONIGHT ON #RAW #TagTitles Congratulations and i know @TheREALRIKISHI is very proud right now","RT @JacquelynS125: The Usos vs The New Age Outlaws for the tag team titles. I\u0027m going with the #Usos to win this! #RAW","RT @WrestleRopes: Good to see The Usos holding championship gold for the first time! #WWE #Raw","RT @WWERetweeting: THEY DID IT, THEY FINALLY DID IT! THE USOS HAVE WON THE TAG TEAM TITLES! #WWERetweeting #WWE #RAWChicago","RT @WNSource: The USOS WIN THE TAG TEAM CHAMPIONSHIPS! #WWE #RAW","#Raw finally the #wwe put the titles on the Usos, but for how log.","The Usos deserve those titles","RT @TheHistoryofWWE: The Usos - just like Daniel Bryan - show the benefit of the slow burn. It wouldn\u0027t have meant as much if this happened…","Just got the word The Usos just won the tag champs... yesirrrr #Usoooooo","RT @BeardofMikeKnox: Open the show with Heyman/Lesnar and giving the Usos a win over HHH\u0027s NAO is a smart way to handle the crowd.  #WWE #R…","RT @The_Dalyxman: Idiotic fans: \"I\u0027m not going to enjoy the title win because I don\u0027t like that the Usos didn\u0027t win the title at Mania.\" \u003c-…","RT @WWERetweeting: If you\u0027re happy The Usos defeated The NAO \u0026 became the NEW tag team champions, RT this! #WWERetweeting #WWE #RAWChicago","Me gustó un video de @YouTube de @comunidadessf http://t.co/4zqwQ5BmQa WWE RAW 3/3/14 - The Usos is New Tag Team Champions First","The Usos are the new WWE Tag Team Champions","But happy the usos the new tagg team champs #RAW #WWE","#RawChicago \n #TagTitles The Usos \nFinally the get a Big Push. They deserve it .. way way over due @WWE @WWERoadDogg @steveaustinBSR","RT @WWERetweeting: If you\u0027re happy The Usos defeated The NAO \u0026 became the NEW tag team champions, RT this! #WWERetweeting #WWE #RAWChicago","RT @TremayneVX: Watching #Raw proud that the Usos finally won the tag team titles in a BIG way. Winning against the #NAO? Sounds like a chi…","RT @LadyVipress: Beyond Happy for the Usos. It\u0027s amazing watching a dream turn into a reality. #RAW","I may be the only one besides my son that likes the Usos but I do. #TagTitles #WWE","Congratulations to the NEW #WWE Tag Team\nChampions, The Usos... :)\n#Thakur http://t.co/e97mGBmhyC","Congratulations to The Usos on becoming our new Tag Team Champions. #WellDeserved #RawChicago","RT @TremayneVX: Watching #Raw proud that the Usos finally won the tag team titles in a BIG way. Winning against the #NAO? Sounds like a chi…","The usos won the wwe tag team championship","@WWE @WWEUsos WOW! The Usos FINALLY found somebody they can beat when it really counts!"],"id":74,"autoSummary":"RT @WNSource: The USOS WIN THE TAG TEAM CHAMPIONSHIPS! #WWE #RAW"}}