{"76":{"topic":"usos","tweets":["RT @BigZ_Massa: @JGreen0115 @nodqdotcom @JeanElias The hijack isn\u0027t about ignoring good talent like Usos, Shield, and Wyatts. It\u0027s about bo…","*cries at @smithycfc1\u0027s support of the Usos*","RT @RocoDeModera: NEW TAG TEAM CHAMPS THE USOS!!! OOOOOSE OOOOOOOOO","RT @WWERetweeting: THEY DID IT, THEY FINALLY DID IT! THE USOS HAVE WON THE TAG TEAM TITLES! #WWERetweeting #WWE #RAWChicago","RT @WWEiIndia: Your new Tag Team Champions... The Usos... !! #WWE #RAW\n#Thakur http://t.co/n58XOuAxSl","RT @WWERetweeting: If you\u0027re happy The Usos defeated The NAO \u0026 became the NEW tag team champions, RT this! #WWERetweeting #WWE #RAWChicago","RT @expressrealism: YES! YES! YES! YES! YES! YES! YES! YES! YES! @WWEUsos are the tag teams champs! I waited three years to say tag-team ch…","RT @BTBGreen: @WWEUsos BTB back on it usos !!! new music video http://t.co/jqbeYAHomK","@WWE @WWEUsos Congrats Usos that was so awesome!","The Usos won the titles on only their 32nd opportunity","RT @TheWWECody: The Usos are the new Tag Team Champions! #TagTitles","Congratulations to the USOS!!! New Tag Team Champions! 💕 :-) #RAW @wwe","@PhillyCustoms  yeah I heard that too, so probably them Vs Usos Vs New Age Outlawz at mania","RT @TheBlackLawler: Usos finally got the straps! #Raw WE STILL WANT PUNK! STILL NOT SATISFIED! #CMPunk","RT @TattedSavior: Congrats to the Usos.","YES! YES! YES! YES! YES! YES! YES! YES! YES! @WWEUsos are the tag teams champs! I waited three years to say tag-team champs Usos! #RAW #WWE","@Bloodyroarxx I dunno if you\u0027re watching Raw but did you catch them say \"Billy and Jimmy in the ring\" during Usos match? #DoubleDragon","Congrats to the Usos.","RT @LanceStorm: Damn tonight keeps getting better. Very happy for the Usos. #RAW","@SANDfuckinTOAST usos took the straps?","RT @InfamousMalice: @TentialTheMove BRO! TCM PUNK TROLL, PAUL HEYMAN PIPEBOMB, BROKING ANNOUNCE TABLE, USOS NEW TAG CHAMPS, AND WYATTS VS. …","We got New Tag Champs The Usos it\u0027s about time","RT @BigZ_Massa: @JGreen0115 @nodqdotcom @JeanElias The hijack isn\u0027t about ignoring good talent like Usos, Shield, and Wyatts. It\u0027s about bo…","RT @trendinaliaUS: @Addicted2AJLee the 1st mention of #Usos appears on your TL. Now is Trending Topic in United States! #trndnl","CONGRATS TO THE NEW @WWE #CHAMPS THE USOS @WWEUsos YOUR POPS IS SO PROUD OF U GUYS SO AM I 💪😆☝\u0026 OH HECK THIS A #YESMovement #YESYESYES ☝😆☝","@StarrMishell smh lol Supafly rikishi Rocks dad and his dad the usos Roman reigns Deuce Rosey Umaga stamina Snuka are all related","RT @BigZ_Massa: @JGreen0115 @nodqdotcom @JeanElias The hijack isn\u0027t about ignoring good talent like Usos, Shield, and Wyatts. It\u0027s about bo…","RT @MarkinOut: RETWEET THIS if you\u0027re happy to see THE USOS as your NEW #WWE Tag Team Champions!  #RAW #RawChicago http://t.co/ED4mxyEOC0","I am the 3rd member of the usos","The Usos NEW TAG TEAM Champions http://t.co/SwPibWXj5B","Watching raw swagger is greeneyed lovin the usos ur dad will be proud, @TheWWEGuys @WrestleMania @WWE @WWETheSource @WWEUsos","The Shield and The Usos\u003e\u003e\u003e\u003e #TheNextBigThing #WWE","RT @DJ_2BoUnCe: “@KingDavidF: The Usos the new tag team champion. #RAW #TagTitles”","@TentialTheMove BRO! TCM PUNK TROLL, PAUL HEYMAN PIPEBOMB, BROKING ANNOUNCE TABLE, USOS NEW TAG CHAMPS, AND WYATTS VS. SHIELD IN A HOUR!","RT @bktspinal: Congrats to The Usos New WWE Tag Team Champions!!!! #WWE #RAW http://t.co/Mi6oSC1iJj","also on raw tonight the usos wins the tag team titles","This @WWE #RAW is pretty live tonight! Congrats to the Usos for winning the Tag Team Belts!","RT @NoelleFoley: That had to be one of the happiest hugs I\u0027ve ever seen in my life!!! Congrats Usos!!! #TagTeamChamps #RAW","RT @WWERetweeting: If you\u0027re happy The Usos defeated The NAO \u0026 became the NEW tag team champions, RT this! #WWERetweeting #WWE #RAWChicago","RT @WrestleRopes: Good to see The Usos holding championship gold for the first time! #WWE #Raw","Finally! #RAW #USOS!","RT @BigZ_Massa: @JGreen0115 @nodqdotcom @JeanElias The hijack isn\u0027t about ignoring good talent like Usos, Shield, and Wyatts. It\u0027s about bo…","So happy @WWEUsos are the new tag team champions 😆 if anyone deserves it, it\u0027s definitely them 😃 #Usos","RT @BigZ_Massa: @JGreen0115 @nodqdotcom @JeanElias The hijack isn\u0027t about ignoring good talent like Usos, Shield, and Wyatts. It\u0027s about bo…","RT @BigZ_Massa: @JGreen0115 @nodqdotcom @JeanElias The hijack isn\u0027t about ignoring good talent like Usos, Shield, and Wyatts. It\u0027s about bo…","Congrats to the USOs on winning their first tag title!... Welcome to the Tag Champ Club boys!!!\n\n#TagChamps #WWE","About time the Usos win the Tag Titles. Now who are they going to defend against at Mania?","RT @djdelz: MY SPIZZOT: The Usos Beat The New Aged Outlaws \u0026 Are New Tag Team Champions #RAW http://t.co/hbv5LmDLaJ","@TheRealXPac Oh and the Usos.","RT @BigZ_Massa: @JGreen0115 @nodqdotcom @JeanElias The hijack isn\u0027t about ignoring good talent like Usos, Shield, and Wyatts. It\u0027s about bo…","RT @BigZ_Massa: @JGreen0115 @nodqdotcom @JeanElias The hijack isn\u0027t about ignoring good talent like Usos, Shield, and Wyatts. It\u0027s about bo…","@NickCoit gotta keep this crowd from rebelling and chanting CM Punk and killing the show (also I\u0027m glad the Usos are finally champs)","RT @BigZ_Massa: @JGreen0115 @nodqdotcom @JeanElias The hijack isn\u0027t about ignoring good talent like Usos, Shield, and Wyatts. It\u0027s about bo…","Hell good job usos glad you won the gold......","RT @BigZ_Massa: @JGreen0115 @nodqdotcom @JeanElias The hijack isn\u0027t about ignoring good talent like Usos, Shield, and Wyatts. It\u0027s about bo…","so far wwe has done it\u0027s best to keep the cm punk chants at a minimum with what they are giving us, brock, usos, shield, wyatts","“@NaomiWWE: @WWEUsos the new TAG TEAM CHAMPIONS😍👏👏👏👏👏👏 http://t.co/mwCOu1xG3X” way to  go USOS!","@WWE @WWEUsos Finally the Usos get what they deserve! Congrats Usos","RT @realjasonrivera: The GOOD NEWS: The Usos are tag team champions.\nThe BAD NEWS: The Outlaws get a rematch so we get to see this match fo…","Your winners and NEEEEEEEEW WWE Tag Team Champions...The Usos! #Raw #wwe","RT @WWECreative_ish: The Usos win and the crowd goes wild. So much for the hijacking #RAWTonight","RT @cmmud: THE USOS ARE THE NEW WWE TAG TEAM CHAMPIONS! YES! YES! YES! #RawChicago #hijackRAW","RT @WWERetweeting: If you\u0027re happy to see The Usos, RT this! #WWERetweeting #WWE #RAW","RT @NoelleFoley: That had to be one of the happiest hugs I\u0027ve ever seen in my life!!! Congrats Usos!!! #TagTeamChamps #RAW","RT @Z4PPA: FINALLT! The Usos got the belts! They worked hard for them and the match was great for it being so short. #RawChicago","@offtheropesshow You know what? Have fun. I thought the moment was awesome and I\u0027m perfectly fine with Usos winning the tag titles.","Congrats to The Usos New WWE Tag Team Champions!!!! #WWE #RAW http://t.co/Mi6oSC1iJj","RT @jimmykorderas: \"We want young guys like the USOs to get their due, So we will chant for CM Punk\" -Chicago","RT @KWFlawless: THE USOS ARE NEW TAG TEAM CHAMPS!  THAT\u0027S BEST FOR BUSINESS!!!!  #RAW","RT @BigZ_Massa: @JGreen0115 @nodqdotcom @JeanElias The hijack isn\u0027t about ignoring good talent like Usos, Shield, and Wyatts. It\u0027s about bo…","RT @HellinBootsChic: Congrats To The Usos You Guys Really Do Deserve It!!!! #RawChicago","RT @WrestleRopes: Good to see The Usos holding championship gold for the first time! #WWE #Raw","RT @FightFan83: The Usos completely deserved that moment \u0026 thank you to Chicago for giving them the respect and not hijacking that moment #…","#RAW Usos just won the Tag Team Championship. That match....is RADICAL.","The usos are fun to watch","The usos win tag team champion!","RT @WWE_1800: The USOS winning the tag team titles tonight is awesome! RAW needed an big match like this RT if you agree #RAW #RawChicago #…","RT @LaYnUhhSoPretty: Your new TAG TEAM CHAMPIONS... THE USOS!!! Y\u0027all that been sleepin on these boys. Well the True Tag… http://t.co/YiOcC…","2 verified accounts helped to turn #Usos into a Trending Topic. These accounts were: @WWE \u0026 @SashaBanksWWE — #trndnl","The tweet with the most impact of the #Usos Trend, was published by @WWE: http://t.co/oLYLDhpsxh (73 RTs) #trndnl","#Top3Apps for #Usos\n\nTwitter for iPhone 31%\nTwitter for Android 22%\nWeb 21%","4,576,722 people could have seen #Usos since its 1st mention until it became a Trending Topic. #trndnl","486 users and 517 tweets (238 RTs) in 1 week made #Usos a Trending Topic in United States. #trndnl","RT @Inside_TheRopes: Really happy that the crowd got behind The Usos and popped for their title win. Great team, bright future. #RAW","Missed the end of that match but s/o to the usos for winning the titles. #RawChicago","RT @WrestleRopes: Good to see The Usos holding championship gold for the first time! #WWE #Raw","#RawChicago wooo the new wwe tag team champions the usos and now shield/v wyatt awsome none stop","Happy for the Usos! Even though I would have booked the title win for Mania. #RAW","Wat a merciful Usos","RT @punk_lakersx: YES! THE USOS! THEY DID IT! #RAW","@WeTalkWrestling for sure. The wrestlers are treating it like a big deal too. Usos, cesaro, and Rollins are all going crazy.","@Addicted2AJLee the 1st mention of #Usos appears on your TL. Now is Trending Topic in United States! #trndnl","RT @WWEiIndia: Congratulations to the NEW #WWE Tag Team\nChampions, The Usos... :)\n#Thakur http://t.co/e97mGBmhyC","RT @WrestleRopes: Good to see The Usos holding championship gold for the first time! #WWE #Raw","Missed the first 30 minutes of #RAW  but managed to see the usos win tag team gold.","@RenaPrengel thanks for retweeting that and spoiling that the usos won I\u0027m not watching -_-","It took The Usos three years to get the WWE tag team titles. What a shame if you ask me. #RAW","Your new TAG TEAM CHAMPIONS... THE USOS!!! Y\u0027all that been sleepin on these boys. Well the True Tag… http://t.co/YiOcCZClSL","WAIT WHATTT!? USOS ARE TAG CHAMPS?!?!?","RT @WWERetweeting: If you\u0027re happy The Usos defeated The NAO \u0026 became the NEW tag team champions, RT this! #WWERetweeting #WWE #RAWChicago","Your new Tag Team Champions... The Usos... !! #WWE #RAW\n#Thakur http://t.co/n58XOuAxSl","What a great night for the #Usos. They’ve been paying their dues for years and they finally cash in! #RAW #LateRAWtweets","RT @ericluvgirls: Hell yeah the usos are tag champs #RAW","RT @joejnapoli: Great to see the Usos win the belts. Hard working and fun team. Good future for these two. #RAW #TagTitle","@JGreen0115 @nodqdotcom @JeanElias The hijack isn\u0027t about ignoring good talent like Usos, Shield, and Wyatts. It\u0027s about booing the bad.","RT @jimmykorderas: \"We want young guys like the USOs to get their due, So we will chant for CM Punk\" -Chicago","RT @WWECreative_ish: The Usos win and the crowd goes wild. So much for the hijacking #RAWTonight","@WWE congratulations to the usos #WWETagTeamChamps","so stoked that the usos won the tag team championship","RT @WWECreative_ish: The Usos win and the crowd goes wild. So much for the hijacking #RAWTonight","@calvin_berry @StewartatATTUNE Like I say, I think with Outlaws as authority lackey heels for a month dropping to Usos had value.","They finally give the Usos the titles","RT @nodqdotcom: Usos win the tag team titles! Crowd went nuts! #raw","Awesome! New Tag Team Champions The Usos! #RAW @WWE","RT @WWENewsForFans: The Usos are the new Tag Team Champions! #RAW","RT @LaRosaMendes: New Tag Team Champs!!  I know how the Usos are feeling right now!!  Best feeling ever!!! #RAW","Just saw these guys!! New tag team champs!! #usos wwe http://t.co/XjaGKgvcYG","RT @AirPatrick730: \"@PhillyCustoms: Ziggler and Miz vs Usos for tag titles at mania.\"whenever someone says the miz... http://t.co/QhkCc5cVGF","RT @WWEiIndia: Congratulations to the NEW #WWE Tag Team\nChampions, The Usos... :)\n#Thakur http://t.co/e97mGBmhyC","RT @OfficialCenafan: The Usos new tag team champions. Finally, Very much deserved. #RAW","RT @WNSource: The Usos Win WWE Tag Team Championship On RAW http://t.co/YIZVF69YC1 #wwe #raw #usos","Holy freaking crap!!! This match is crazier than The Usos vs. The New Age Outlaws! #WWERAW #WWEChicago","Congrats to the new WWE tag team champions the Usos.  #RawChicago","I knew the Usos were gunna win this time only because it will buzz around and thts what WWE wants to do to get our minds off Punk good job👌","RT @WrestleRopes: Good to see The Usos holding championship gold for the first time! #WWE #Raw","People are acting like #hijackRAW has actually done something. We see Heyman, Henry, Usos, Wyatts, Shield EVERY WEEK. WWE owns you all. #RAW","RT @SMOOVEJAZZFAN: THE USOS WIN! THEY\u0027RE FINALLY THE TAG-TEAM CHAMPS! @WWE #RAW","Glad to see the Usos get the tag belts.  Long time coming. #RawChicago","The usos is the new tag team  champions","RT @FightFan83: The Usos completely deserved that moment \u0026 thank you to Chicago for giving them the respect and not hijacking that moment #…","RT @NoelleFoley: That had to be one of the happiest hugs I\u0027ve ever seen in my life!!! Congrats Usos!!! #TagTeamChamps #RAW","MCM. My boys are the new Tag Team Champions😊😊 #wwe#usos  @naomiwwe http://t.co/KygFhqBsrK","RT @I_Love_The_WWE: YES ! YES ! YES ! The Usos finally got the #TagTitles ! :D #RAW","@SteveandLarson I\u0027m surprised that the usos won the tag titles!","The Wyatt\u0027s suck, The Shield sucks, The Usos suck, there aren\u0027t teams like The Gentleman\u0027s Club or F.I.S.T. anymore.","RT @WNSource: The Usos Win WWE Tag Team Championship On RAW http://t.co/YIZVF69YC1 #wwe #raw #usos","RT @WrestleRopes: Good to see The Usos holding championship gold for the first time! #WWE #Raw","\"@PhillyCustoms: Ziggler and Miz vs Usos for tag titles at mania.\"whenever someone says the miz... http://t.co/QhkCc5cVGF","Congrats to the #usos for being the new tag team champions #raw #TagTitles","Just a thought! USOS winning now cud mean Rybaxel win at WM!!! BOOK IT!!! Get sum gold back around that waist of @RealCurtisAxel YES!!! #RAW","And it looks like the #RAW hijacking has took a halt with cheering for the Usos win and counting (cont) http://t.co/nuKRTmzIKR","@WWE @WWEUsos  I hate the usos they got lucky by beating the new age outlaws next time the usos should fight the sheild","RT @The_Dalyxman: Idiotic fans: \"I\u0027m not going to enjoy the title win because I don\u0027t like that the Usos didn\u0027t win the title at Mania.\" \u003c-…","Usos good win off to hoop now","RT @PWFEmpire: Crowd chanting \"Let\u0027s go Usos\"? Great! I\u0027m surprised to see they remember people who didn\u0027t walk out on the company... #PWTR","RT @WWECreative_ish: The Usos win and the crowd goes wild. So much for the hijacking #RAWTonight","Always \u0026 Will Continue to be Team Usos 🏆 New Tag Team Champions!!! It\u0027s about time \nThey deserved it 💪… http://t.co/yobkjASWpL","RT @WWECreative_ish: The Usos win and the crowd goes wild. So much for the hijacking #RAWTonight","Hell yeah the usos are tag champs #RAW","New!!!! WWE Tag Team Champions!!! the Usos!!!!!!","RT @OfficialCenafan: The Usos new tag team champions. Finally, Very much deserved. #RAW","#RawChicago good job usos","@AKATheMaskedMan doesn\u0027t Swagger realize that USOs won tag titles? Wouldn\u0027t their gimmick put them in #1  contender picture?","RT @BrittLovesCena: Congrats to The Usos \u003c3 #NextTagTeamChamps 🙌","Yes yes yes !!! WE HAVE NEW TAG TEAM CHAMPIONS!! THE USOS!! #RAW #wwe","Damn, not been an hr into #RawChicago, and we have seen cesaro, lesner, Usos, new age outlaws, big e, the shield, and the wyatts","#Raw #WWE the usos did an incredable","Im glad The Usos put the living paws on The New Age Outlaws and won the tag team titles Congratulations #tagteamtitles","@WWE  \nUsos New tag team Champion\nyes yes yes !!!!\n#Raw !!","“@AJLeeWorldWide: FUCK YES! Usos The NEW Tag Team Champions! I\u0027m crying 🙈”","Congrats Usos I knew you could eventually do it!","im so fucking happy for the usos\u0027 man so sosososososos happy","loool I don\u0027t understand a thing the usos say in their intro but I love it!! @WWEUniverse #RAW","The Usos new tag champs in Chicago http://t.co/wCPhZcjACB","@TheMysteryMen It was an excellent match and a cool moment. It was like with the Usos - they chased the title for what felt like forever.","RT @DangerRich32: FINALLY!!! HELL YEAH USOS!! NEW TAG TEAM CHAMPIONS #WWE","what i miss in the first 30 min of raw i started watching during usos match","@wwe throwing the kitchen sink at this first hour of #Raw. Heyman and Bork. Usos winning the titles. Shield vs. Wyatts. #yes","Congrats to the Usos ! New tag champs ! #RawChicago","I not have #USOS","@ThatWerewolfJG I take it she likes the Usos?","@PositiveManCam pipebomb by Heyman, Brock destroyed the announce table and F5\u0027d Henry on it, Usos new tag champs","@theusos, congradualations to the usos for becoming the new tag team champs. I was praying for you guys.","RT @hwrestlingradio: HOWEVER, this *should* have been a WrestleMania moment for the Usos... Think Chicago\u0027s \"hijack\" threats prevented that…","RT @ZakerAlii: THE USOS HAVE DONE IT, NEW TAG TEAM CHAMPIONS #RAW","Even though im a New Age Outlaws guy, Congrats to the Usos. This should set up a big tag match for WM30 if theyre smart. #raw","RT @austin_24WWEFan: Usos finally did it!!!!","RT @WWERetweeting: If you\u0027re happy The Usos defeated The NAO \u0026 became the NEW tag team champions, RT this! #WWERetweeting #WWE #RAWChicago","RT @WWERetweeting: If you\u0027re happy The Usos defeated The NAO \u0026 became the NEW tag team champions, RT this! #WWERetweeting #WWE #RAWChicago","@DevilMaySpy heyman came out to punk\u0027s music and said punk\u0027s not there, crowd chants punk every time they can, usos are new tag champs","RT @LanceStorm: Damn tonight keeps getting better. Very happy for the Usos. #RAW","RT @JRHWriting: For those that criticized #hijackRaw, the movement just made the Usos title win more special. Comment? #wwe #raw @TNACreati…","@JRHWriting @TheAOster I think Aaron meant it cost the Usos a special win at Mania.","The Wyatt\u0027s suck, The Shield suck, The Usos suck, there aren\u0027t teams like The Gentleman\u0027s Club or F.I.S.T. anymore.","HOWEVER, this *should* have been a WrestleMania moment for the Usos... Think Chicago\u0027s \"hijack\" threats prevented that from happening. #RAW","Ziggler and Miz vs Usos for tag titles at mania.","RT @nodqdotcom: Usos win the tag team titles! Crowd went nuts! #raw","USOS got it!!","ALSO THE USOS ARE THE NEW TAG TEAM CHAMPIONS I SCREAMED AND YELLED YEAH BABY LIKE THE AUDIO OF THAT SQUART GUY","@ITommy219 yes! Also makes me feel old that the stars I watched as a kid, their kids are stars today. Rotunda kids bray and Bo Usos etc","@WWEUsos woooo aaaaaaaa\nthat\u0027s what i wanted conrgaltion folks u desarve it the new tag team champion the #usos #wwe #raw","Contragulations to Usos as New Tag Team Champions! #RAW","Finally the Usos is the #TagTeamChamps","@WWEUsos : Congratulations on becoming the new tag-team champions!!! #Usos #RawChicago","The Usos new tag team champs","The Usos, @wweusos is now trending in #Chicago http://t.co/7wI2nAoVpU","Great Matches So Far. #Raw New tag champs the Usos","The Usos Win The WWE Tag Team Championship - Raw 3/3/14: http://t.co/ODuNHDPPMz via @YouTube","Congratulations to @WWEUsos on their first tag team title victory #raw #RawChicago #usos","Guess its goodbye for new age outlaws #Usos"],"id":76,"autoSummary":"Usos win the tag team titles!! I\u0027m happy for them :) #wwe #RAW they really have come far"}}