{"78":{"topic":"lent","tweets":["@Missterious_Gal to use up all the \"good\" stuff ready for lent.","@nug9 true but they\u0027re so worth it. I will have enough money if I don\u0027t buy coffees for 100 days, in time for Lent as well!","RT @PeteGreig: Welcome to Shrove Tuesday everyone - a day of liturgically sanctioned SNACKING before #Lent ~ Enjoy!","having my last ramen before lent. think I might cry at the end #byeramen #missyoualready #40","RT @cohendave: Every year around this time I make the same topical joke about Lent. Well I\u0027m not going to do it any more.","@PeterMakrillos The start of lent..don\u0027t ask \u0027What\u0027s Lent\u0027!","Back on the healthy eating today ready for giving up the junk for lent","Listen to Foyle \u0026 Pancakes sound delic.  Went off Coffee during lent last year \u0026 still off it \u0026 still miss it - nothing like that this year!","RT @brennacliff: Might give up talking for lent all it does is get me into shit","RT @BranchBoasts: 40 days of lent, 40 days to give back, rather than give up. Join me for a generous journey: @40acts http://t.co/Q9C1SsohO1","RT @PeteGreig: Welcome to Shrove Tuesday everyone - a day of liturgically sanctioned SNACKING before #Lent ~ Enjoy!","last day of eating crap and then it\u0027s healthy healthy healthy #lent #willpower","RT @alouiseg: The best thing about being an atheist is picking out the fun bits of religion like Shrove Tuesday and avoiding the miserable …","RT @inquirerdotnet: Just two days before the start of Lent. What do Church leaders ask of the faithful? http://t.co/gzDqLZBd4H","RT @OFalafel: Pancake Day is the Christian  neknominate followed by the stomach pump of Lent.","RT @AlexBleadorn: If this gets 100 retweets, @ColeEbel will give up Twitter for Lent. #Retweet #hashtag","Giving up meat for lent. Pray for me plz 😂","@Lee_Lewy Its also the day before Lent. The beginning of easter.","I don\u0027t entirely understand what Lent is, but I think I just signed up to give up coffee for forty days! Wish all those around me well...","For Lent I\u0027m suppose to give up beef 😫😫😫","Some of you catholic chicks need to give up \u0027being a slut\u0027 for lent.","Giving up meat and chocolate for #lent","For the third year in a row, I am giving up (added) sugar for lent. (It seems like a good time of year to join in!)","I\u0027ve forgotten what I was going to give up for lent. Dammit.","A thing I want to try to do in Lent: make someone a compliment every day. (Different people, obviously.)","RT @RBCparklife: You don\u0027t have to give something up for lent. Try doing something extra like volunteering on your local park or green spac…","RT @lorddeben: Shrove Tuesday: Pancakes and realisation that we aren\u0027t ready for Lent which this year seems to have arrived without warning!","RT @alouiseg: The best thing about being an atheist is picking out the fun bits of religion like Shrove Tuesday and avoiding the miserable …","#StEugenesCathedral#LentIdeas The Cathedral will stay open 8- 10pm during Mondays of#Lent for prayer or Sacrament of Reconciliation.","Giving up chocolate and sweets for lent","I wish I can sacrifice people for lent.","Giving up fizzy pop for lent 😣 oh dear","Just two days before the start of Lent. What do Church leaders ask of the faithful? http://t.co/gzDqLZBd4H","RT @WaterfrontStudy: A completely different stance on Lent. We should give this a go #LiveFreeLent http://t.co/9P7dy8lN72 @SoulActionUK","RT @svejky: The Fight Between Carnival and Lent by Brueghel http://t.co/OK3ylrOXqO","@Stiniestyles But it wasn\u0027t even Lent! :-)","I\u0027ve never done \u0027give up for lent\u0027 but I\u0027m going to give it a go. No chocolate for 40 days!! #challenging","RT @catholicherald: Blessed John Henry Newman had a simple recipe for happiness. Why not try it this Lent?: http://t.co/4UX0KerkxN http://t…","“@aliceonthehill: Giving up men, money \u0026 maltesers for lent .....”\nSeconded. Mini eggs, men and morons.","I\u0027m giving up having sex with women for lent this year. \n\nIt seems a more achievable goal than giving up chocolate. *wink*","RT @GMPStockNorth: Happy #ShroveTuesday! Some ppl give something up 4 #Lent but u can also do something proactive like #volunteering: http:…","RT @AvaLaurenCatton: The magnolia house have decided to give up takeaways for lent. Let\u0027s see how long this lasts.","@SainsburysPR  #SainsbosPelfie  Taken by the bugs in our garden! They wanted to do a selfie so I lent them a camera.! http://t.co/kricdMAj1W","A completely different stance on Lent. We should give this a go #LiveFreeLent http://t.co/9P7dy8lN72 @SoulActionUK","Taking the decision to support a fellow colleague and give up chocolate for lent...#cantsayIamnotnice","RT @loveyourstreets: Lent -don\u0027t just give up give out! #Do1NiceThing is a Lent-full of simple ideas 2 help u make the difference 4 others …","A\u0026Es are facing their busiest day of the year as 1000s of Christians overdose on alcohol, sweets and cigarettes on the last day before Lent.","Dunno what to give up for lent 😦","i have decided to give up maccas and hungry jacks for lent","RT @StaffAmber: Giving up alcohol and takeaway for lent, this is gonna be a fun 40 days...","Feel like giving something up for lent, but can\u0027t decide what. Frothy coffees perhaps, but then I\u0027d never have any energy.","RT @fisherandmore: Don\u0027t forget that #shrovetuesday isn\u0027t about pancakes, it\u0027s about being \u0027shriven\u0027! Enjoy your pancakes but go to #confes…","Just incase anyone missed it on facey or insta... @MissTashan @HeddoVerheals 😂😩😫😭😅😆 #lent http://t.co/0glMDfi7SS","@LeviMathurine because back in the old days people used to use rich foods like egg sugar milk before 40 days of lent","@twowitwowoo I wonder what the Borrowers give up for Lent.","@Coifsh some people find it funny. Let them ;) my MIL gives up biscuits and cake every Lent. Without fail.","What are we all giving up for Lent?","I\u0027ve given up sniffing glue for Lent  ...and I\u0027m sticking to it","RT @roxyburger: So instead of giving something up every Lent, my friends and I give away 1 sandwich a day for 40 days. Join us here: http:/…","Hahahahahah,manala a thatha RT \"@MaGladwin: So I lent someone my nail clippers... They returned blunt... What\u0027s the world coming to???\"","Is it today that lent starts? #lent #confused #whatdoigiveup","It\u0027s Lent.\nI give up.","RT @ArchdiocGlasgow: Lent involves divesting ourselves of useless and bad habits. Plan your Lent today ...","Pancake tuesday, shame i canny eat them, one day left to decide whats getting gave up for 6 weeks ...decisions #lent #decisionsdecisions","How didn\u0027t I realise it was pancake day and lent starts tomorrow?!?! What am I giving up for Lent? Stress/being rude/ coca cola 🙅","#Lent starts tomorrow, how about giving up paper? @MagVault has a selection of digital health \u0026 wellbeing magazines: http://t.co/d8CFjgqlPz","I just lent to Célestine Oloyede dedi on @lendwithcare. Make a loan, change a life: http://t.co/hL2aTUs5Yt","RT @TimeWisdom: Too busy? Find 10 top tips for giving up busyness this Lent at http://t.co/MIZvC8Hofw.","@HobnobJunkie oh bugger it\u0027s lent again? ... I give up something every year ...  I can\u0027t be bothered this year!","RT @ultramacky: LENT: brought to you by the makers of \u0027dinosaurs aren\u0027t real\u0027, \u0027gays must die\u0027, and \u0027women are utterly inferior\u0027. ENJOY!","Whereas i lent u the money in full n smiling,two days 2 the agreed date ur tokin of giving me back in installments!\u0027ve learnt albeit late","The beginning of lent tomorrow, so I\u0027m giving up wine \"shock, horror and...is that a sigh of relief I hear?!\" #Lent2014 #wineoclock #nomore","RT @christian_aid: Download our free #Lent app and get a recipe for delicious Viennese dish Kaiserschmarrn – ideal for Shrove Tuesday! http…","For 40 days of Lent why don\u0027t MLAs sidestep the bitchy us-and-them motions and concentrate on doing just one thing on health/education/jobs?","RT @jazyrosalinda: I\u0027m wish that I could give up wearing pants for lent.","@exCLOCKEND confuse him even more by asking what he\u0027s giving up for lent!","RT @SMCoulombeau: Pondering: instead of give things up, why not do extra things for Lent instead? Run further. Write more. Do a small, good…","Giving up social media for Lent? Leave a lasting impression while your away! Post your Ash Wednesday #selfie as a... http://t.co/Bd3rrmyD6q","My mom asked me what I was giving up for lent and I said chocolate. Not sure how to let her know I\u0027m actually giving up sex. #oops","Q: How many days belong to the year?\nA: 325. The other 40 are only Lent.","@dan_of_steele It\u0027s preparation for lent, so ridding the cupboards of stuff that can be made into pancakes. Bible had it sussed out!","pancake day, I\u0027m giving up stress and worrying for lent, oh and women","I always forget it\u0027s lent or whatever tomorrow the day where you can\u0027t have meat","RT @UKuncut: .@EndHungerFast demand: 1. Welfare that works 2. Work that pays 3. Food market that puts people before profits http://t.co/55w…","What can I give up for lent?! 😁","What will you be giving up for lent this year? In the mean time, give these a go! http://t.co/hH6PEHFC4X http://t.co/JgMpVCtxPl","Anyone giving up something for lent? I\u0027m giving up chocolate, so must have plenty today ;) Blog post coming up later on this....","Happy Pancake Day ! What will you give up this lent ? http://t.co/eHWibWiykq","Are you giving anything up for Lent? CCUSA UK are banning chocolate in the office. I wonder how long that will last!","RT @BranchBoasts: 40 days of lent, 40 days to give back, rather than give up. Join me for a generous journey: @40acts http://t.co/Q9C1SsohO1","Giving up people who make the joke \"giving up lent for lent\" for lent","What to give up for lent 💭","Are @Translink_NI giving up buses for lent? You\u0027re a day early, lads.","I\u0027m giving up running for lent.","So I lent someone my nail clippers... They returned blunt... What\u0027s the world coming to???","Since lent directly follows pancake day it seems like the best solution is to stuff your face today then jst give up pancakes for lent!!","Pancake Day! Anyone Giving Up Anything For Lent?? Or Y\u0027all Just Gonna Eat Pancakes And Act Like You Don\u0027t Know What For? Good Morning Peops.","Happy Pancake Day!! Make the most of yours @Becki_Landy, Lent starts tomorrow 😁😩👎","RT @rejunevated: Don\u0027t forget to use up all your old pancake jokes today before starting your lent jokes tomorrow.","if i told you i was giving you up for lent would you finally leave me alone :/","Giving up bread for lent #40 #days","Also since lent starts tomorrow, and I’ll be off sugar (for diet reasons not religious like) that also deserves a creme egg today. Yesss.","RT @Sadgrovem: What not to give up for Lent: your temper. By not losing it, live calmly, live wisely, live well \u0026 according to today\u0027s news…","“@simon__k: “@Fab_danni: I\u0027ve heard everything about pancake day but nothing about lent” what u giving up?”\u003cgood question lol, you?","Happy Shrove Tuesday - the day before #Lent begins! http://t.co/E0V2AHEbS1","Welcome to Lent Listening http://t.co/ddp5FYbmWl","RT @svejky: The Fight Between Carnival and Lent by Brueghel http://t.co/OK3ylrOXqO","Great Lent began yesterday for us. 40 days. No meat, no chicken, no desserts, no rich foods, no butter or milk.... http://t.co/c98nVk0Rn4","Happy Pancake Day! Are any of you going to be giving something up for Lent tomorrow? http://t.co/zUDfxyNl3X","@MGOATSKIN supposed to eat during Lent??? Or something??? Idk some holy thing","No idea what to give up for Lent this year 😣","Giving up carbs for lent. God help me 😥","RT @CHPublishingUK: @Steven_Croft Sam Wells\u0027s great advice on Lent habits introduces Reflections for Lent 2014 book/ebook/iOS/Android app","One last night of excess, before Lent. Who\u0027s game? Haha","@kendalljennxr didn\u0027t lent start yesterday","RT @headspill: I need to go out and buy eggs, milk and sugar in order to use them up before Lent.","RT @emitoms: Can I give up being an adult for lent?","1st day of lent tomorrow, what to give up??","RT @ATLVXMPS: giving up school for lent","Oh. Lent. That came around quickly.","RT @PeteGreig: Welcome to Shrove Tuesday everyone - a day of liturgically sanctioned SNACKING before #Lent ~ Enjoy!","RT @frmikeschmitz: InfoGraphic on Lent and Ash Wednesday and Fasting and days of penance and not eating meat and pursuing the Lord and.. ht…","I\u0027m fasting from Twitter during Lent. May you be aware of God\u0027s presence during this season. See you on April 19. http://t.co/8jODkXGLwR","RT @roxyburger: So instead of giving something up every Lent, my friends and I give away 1 sandwich a day for 40 days. Join us here: http:/…","@Ggnitaly84 you know that lent starts tonight right? make that double cappuccino and triple frittelle!","In @NetworkNatter Manchester office, we all deciding what to give up for Lent, #whatyougivingup? @dankondras @JonathanR1974 @charlotteilamb","Lent tomorrow! Goodbye bread or soda??? Gaa","RT @ultramacky: LENT: brought to you by the makers of \u0027dinosaurs aren\u0027t real\u0027, \u0027gays must die\u0027, and \u0027women are utterly inferior\u0027. ENJOY!","Wooo! Who wants to go vegan with me for 40 days?! #lent #holleratabrother","RT @ancientfaith: A collection of Lenten podcast episodes from the past and present that will be updated throughout Great Lent: http://t.co…","Although the bad thing about pancake day is tomorrow I give up food 😩 #lent","giving up foundation for lent","Really didn\u0027t think this lent thing through...","Want to give something up for lent but I don\u0027t know what to choose?! #lent","thinking of giving up social media for lent, or maybe alcohol and chicken...need yo decide soon","RT @PeteGreig: Welcome to Shrove Tuesday everyone - a day of liturgically sanctioned SNACKING before #Lent ~ Enjoy!","What should I give up for Lent... Hm","Yum! It\u0027s pancake day!! And deciding what to give up for lent....","Giving up alcohol \u0026 coffee for Lent, having withdrawals before its even begun. 😭 #FortyDaysAndFortyNights","For Lent I will give up getting annoyed when I find myself agreeing with @LouiseMensch. It\u0027s going to be hard.","Lent starts tomorrow and I feel as though I should give up chocolate","@PeterAttenborou Do you observe Lent?","What are you giving up for Lent?\nRELIGION.","I shall be abstaining from producing dance, pop or any kind of \"fun\" music during Lent.","@diptyabdj The day before Lent season begins :)","@MissAngelajay Giving up anything for Lent? x","RT @svejky: The Fight Between Carnival and Lent by Brueghel http://t.co/OK3ylrOXqO","@AmyFarricker might see if I can be a vegan for lent dunno tho","@TabithaBrowne @haloefekti Beginning of the Christian version of Ramadan, the Lent Fast - http://t.co/Iz23YAuOm2","Why give up things for Lent when you have no intention of embracing the Saviour for Easter! Makes no sense.","Why give up things for Lent when you have no intention of embracing the Saviour for Easter! Makes no sense.","So Lent starts tomorrow and you STILL don\u0027t know what to do for it...do you give up chocolate? Do you give up... http://t.co/2ExqYhQpYk","It\u0027s Shrove Tuesday, the last day before Lent and the day to indulge in #pancakes. Are you planning to give anything up for Lent this year?","What you giving up/ doing @JulesDymond 🍺 #lent","Mmmmm the feast before Lent RT “@ioannisdekas: Pancake day! You all know what to do...”","RT @emitoms: Can I give up being an adult for lent?","My 4th year of being crisp clean. What to give up for lent this year...","Giving up chocolate again for lent #givemewillpower #Lent2014","The magnolia house have decided to give up takeaways for lent. Let\u0027s see how long this lasts.","“@Fab_danni: I\u0027ve heard everything about pancake day but nothing about lent” what u giving up?","Pancake Day is traditionally the last day before Lent to use up all your old Pancake Day jokes - Let\u0027s hear \u0027em! Best ones will get RT\u0027s :)","Try abstaining from sewing for Lent.\n\nWill definitely make your clothes holier.","Giving up meat for Lent which starts tomorrow. So for a last meaty hooray, I\u0027m having an Ulster Fry to start the morning #Lent","RT @Xt3dotcom: Need ideas for #Lent? Download Xt3\u0027s Lent App,in partnership with @UNDANews.Go to http://t.co/X9LFHuqy24 or search Xt3 Lent …","Tomorrow is the first day of #Lent, what sacrifice will you be making?","People giving up things for lent even though they\u0027re not practising Christians zzzzz","What will you be giving up for Lent? Confession... I will be giving up my recent, secret addiction to Milky Bar Mini Eggs... yes really!","Idk what to give up for lent thoo 😩","\u0027Dr dilks what are you giving up for lent?\u0027 His reply \u0027SEX\u0027...","I decided I\u0027m gonna give up fried foods for lent","Day 21: Deciding on lent sacrifices! :)))","I\u0027m thinking about giving up all social networks for lent .. And I wanna give up meat again and go vegetarian for good. And quit drinking","Happy Pancake Day - What are you giving up for lent to help your exams? http://t.co/ravpIeQlAR","RT @Swizzymack: giving up fucks for lent...","Lol at everyone doing lent. Fools!","@j_mcelroy It has to do with Lent, I think. But all I know is that there are delicious pancake posters all over town and I\u0027m drooling.","RT @UKuncut: .@EndHungerFast demand: 1. Welfare that works 2. Work that pays 3. Food market that puts people before profits http://t.co/55w…","RT @AdamShawBiz: We eat pancakes today because Christians use up rich goods such as eggs \u0026 sugar so they can observe fasting of Lent which …","Rick Astley bloody hates Lent","tomorrow is the first day of the month of Lent ♡","http://t.co/uBQNBCZ1Es  We have found NO NHS/DWP care nor compassion from CofE schools in this part of England. We face destitution now.","Pancake Day evolved as a way to use up eggs before the 40 days of Lent #history #facts","Olivia (9) has announced that she\u0027ll be giving up Pancakes for Lent, which of course begins tomorrow, after Pancake Night! #smart","It\u0027s fattening Tuesday.  I have to eat all I can before lent.","Can I give up being an adult for lent?","I\u0027ve heard everything about pancake day but nothing about lent","RT @essbdee: also if one more fucker tells me how they are giving up chocolate for Lent I\u0027m going to punch the Christianity right out of th…","Oscar Pistorius gives up shooting girlfriends for lent. (Right, that\u0027s most of the trending topics covered).","I\u0027ve given up McDonald\u0027s for lent. #prayforalice","I am giving up bread, pasta and potatoes for lent. I\u0027ve just decided. RAH.","wish me luck guys, it\u0027s ash wednesday tmw and i\u0027m giving up nuts for lent","@LeviMathurine it\u0027s basically everything people used to give up for lent","A way to track where my friend is when I lent her my phone 😂 http://t.co/VYiLv0z0Tt","#PancakeTuesday #Lent tomorrow time to stuff my face with crisps n chocolates  #40days it can b done👍","Giving up alcohol and takeaway for lent, this is gonna be a fun 40 days...","Tonight is not going to be pretty, I\u0027m warning you... #FatTuesday #Lent","@EmilyRoseLoynd Shrove Tuesday, day before ash Wednesday which us the start of lent. #Jesusschool101","Think I might give up fb for lent? !?! Hmmmm","I\u0027m giving up crisps for lent. #hardestthingever #firstworldproblems","RT @ADoseofBuckley: I\u0027m going to give up religion for Lent."],"id":78,"autoSummary":"So I\u0027m giving up cursing for Lent.👌"}}