{"81":{"topic":"south park","tweets":["South Park: The Stick of Truth Walkthrough – Forging Alliances Part 4 http://t.co/c6qrrKPHHZ","South Park: The Stick of Truth Walkthrough – Call the Banners Part 1 http://t.co/8jahxGpoLM","South Park: The Stick of Truth Launch Trailer [North America]: http://t.co/myLYWfRJGO via @youtube","South Park: The Stick of Truth Walkthrough – Gain New Allies Part 1 http://t.co/TNpQNapeTq","South Park: The Stick of Truth Walkthrough – Attack the School Part 1 http://t.co/2paPtVujiK","@AngryJoeShow That\u0027s technically the equivalent of two seasons of South Park. 14 half hour episodes a season! Just FYI! :)","South Park: The Stick of Truth Walkthrough - Beat Up Clyde Part 2 http://t.co/MbukLI9A48","RT @Kotaku: South Park: The Stick of Truth is a great game, but sadly, it\u0027s a technical mess. Our review: http://t.co/V0Bpn7bgDY http://t.c…","RT @danielsahyounie: I want to get a cartman (South Park) tattoo on my ass.","South Park: The Stick of Truth Walkthrough – Beat Up Clyde Part 2 http://t.co/4gNNTjyWPQ","South Park: The Stick of Truth Walkthrough – Alien Abduction Part 1 http://t.co/PWVLckzoZ2","Als je in de South Park-game even niets doet... Butters: \"hey, if you are texting your friends, tell em about this game.\" Instant classic.","@NorthernlionLP This is a dumb question, but I\u0027m holding out hope... does South Park: The Stick of Truth go through uPlay?","RT @danielsahyounie: I want to get a cartman (South Park) tattoo on my ass.","the humor in south park is very... american. i suppose it has it\u0027s bright moments but i\u0027ve never been into it.","damn the more that I think about it the more angry I get that South Park\u0027s off Netflix...good thing u can watch every episode online","RT @AngryJoeShow: South Park The Stick of Truth is the best Movie/Television Licensed Game since Goldeneye!","South Park: The Stick of Truth Walkthrough – Defeat the Underpants Gnomes Part 1 http://t.co/Uqgcv6eVde","RT @danielsahyounie: I want to get a cartman (South Park) tattoo on my ass.","Wot I Think – South Park: The Stick Of Truth http://t.co/w1M2dGp4SZ","RT @danielsahyounie: I want to get a cartman (South Park) tattoo on my ass.","See here all the reviews for The Stick of Truth. Matt and Trey can be proud! http://t.co/sb2mbM7EAK","RT @NeoGAFNewThread: South Park: Stick of truth - VIDEO of all censored EU scenes including text for each http://t.co/3XWydihkJK","If you\u0027re a true South Park fan you\u0027ll love this game","I liked a @YouTube video from @tharadbrad http://t.co/TokOxvuiQd South Park Stick of Truth Gameplay Walkthrough Part 1 - Grand Wizard","South Park: The Stick of Truth Walkthrough – Defeat the Underpants Gnomes Part 2 http://t.co/eRrX9kWa94","South Park: The Stick of Truth Walkthrough – Forging Alliances Part 5 http://t.co/Ut8EREYmbW","RT @DanStapleton: If you\u0027re playing South Park on PC, I strongly recommend using a gamepad - and I rarely say that. The PC controls aren\u0027t …","RT @CVG_News: Here\u0027s our South Park: The Stick Of Truth review round-up. Things are looking good for Matt \u0026 Trey - http://t.co/v8rvJRqjdf","Sounds like South Park: The Stick Of Truth is a winner! http://t.co/ohvNohMEBI Well done @Obsidian :D","South Park The Stick of Truth is pretty great.","South Park: The Stick of Truth Walkthrough – Beat Up Clyde Part 1 http://t.co/xZwTX61FED","RT @Kotaku: South Park: The Stick of Truth is a great game, but sadly, it\u0027s a technical mess. Our review: http://t.co/V0Bpn7bgDY http://t.c…","RT @danielsahyounie: I want to get a cartman (South Park) tattoo on my ass.","South Park: The Stick of Truth Review: Let\u0027s get super cereal, shall we? South Park: The Stick of Truth is the... http://t.co/ZQoREIkno7","South Park: The Stick of Truth Walkthrough – Forging Alliances Part 3 http://t.co/rombj0trkW","South Park: The Stick of Truth Walkthrough – Forging Alliances Part 2 http://t.co/VHFb4Wv9iR","South Park The Stick of Truth streaming live on http://t.co/pP7u8p7hEF","Not available for PS4! What a pity :( http://t.co/OTXWWylrDM","South Park: The Stick Of Truth - Our 10 Favourite References [PS3 Gameplay] http://t.co/UKJOs681WR","South Park: The Stick of Truth - A Tour Of South Park [PS3 Gameplay] http://t.co/Bmj63u5RCq","RT @NeoGAFNewThread: South Park: Stick of truth - VIDEO of all censored EU scenes including text for each http://t.co/3XWydihkJK","South Park: The Stick of Truth Launch Trailer [North America] http://t.co/rzxo17Lbjh","South Park: The Stick of Truth Walkthrough – The Bard Part 1 http://t.co/YdVGud8PWt","I said it was good... http://t.co/QfqWvjFy8X","South Park: The Stick of Truth Walkthrough – The New Kid in Town http://t.co/lBSi6qBLUM","I wish South Park was on @HBO Ohhh Cartman\u0027s language..","South Park #TheStickOfTruth is so much fun. They really knocked it out the park. Fans will love it.","all these white guys in my timeline praising the south park game. i\u0027m rolling my eyes so hard.","South Park The Stick of Truth Playthrough: http://t.co/AAEnvkZhZG","South Park: The Stick of Truth Walkthrough – Alien Abduction Part 3 http://t.co/MRCGEZ17JT","@Miguel_Gator want to pick up something tomorrow. Would you say South Park or Thief is the better option?","@GodForgives_ yeah it\u0027s the South Park game","RT @GAMEDerby: #SouthPark #StickOfTruth, out Friday and a storming review! Come preorder it for some in game extras for the new kid! http:/…","South Park: The Stick of Truth Walkthrough – The Bard Part 2 http://t.co/BBMyPpvoPs","South Park: Stick of truth - VIDEO of all censored EU scenes including text for each http://t.co/3XWydihkJK","South Park: The Stick of Truth Walkthrough – Alien Abduction Part 2 http://t.co/Jq6AlgQwuI","RT @AngryJoeShow: Its safe to say as a South Park fan \u0026 a creative RPG fan, its worth it. Its the most disgusting game ive ever played. ...…","South Park: The Stick of Truth Walkthrough – Betrayal from Within http://t.co/9GxUbJbKna","South Park: The Stick Of Truth review – have yourself a time - Metro: MetroSouth Park: The Stick Of Truth revi... http://t.co/6n6NHEKeGw","RT @Babylonian: Here\u0027s my review of South Park: The Stick of Truth, a super impressive game that is also really hard to recommend: http://t…","Haven\u0027t watched an episode of South Park in at least a decade but really enjoyed the new Stick of Truth game. Review in the paper on Sunday","RT @MuzzyBearr: so i just got the south park game and this is me in south park form so yeah http://t.co/She09cQxul","Our verdict on South Park: The Stick of Truth - http://t.co/w5iNLtOc9H","Best thing about South Park game is that it\u0027s about 15-20 hours long, so actually completeable for time-lacking arses like me.","GOD DAMN IT! IT\u0027S TIME FOR SOUTH PARK!: http://t.co/NqthGHFFUp","@iPTD_ voted hot on South Park: The Stick Of Truth (X360\\PS3 £29.99 PC £22.99) Delivered @ GAME (Add £2 For  http://t.co/Qtc8Emza8v #HUKD","RT @TheKoalition: South Park: The Stick of Truth Review – Hilariously Offensive http://t.co/aVRvw8JLSD","I liked a @YouTube video from @the_t http://t.co/goTYqAslhM New Kid - SOUTH PARK: THE STICK OF TRUTH - Turps Plays #1","This Just In... South Park: The Stick of Truth Review http://t.co/LSAejFYOO2 @TheXboxHub #south-park-22","This Just In... South Park The Stick of Truth launch trailer http://t.co/YI3yfizlEu @TheXboxHub #south-park-21","South Park The Stick of Truth is getting some great reviews. This makes me happy.","@Z_H_ who the fuck cares? I\u0027ll have South Park stick of truth In 5 hours when the store opens lol",":| I... totally just splurged on the new south park game.. I am horrible.. *makes coffee*","I liked a @YouTube video from @whiteboy7thst http://t.co/jWmtI7wcq3 South Park: The Stick of Truth Gameplay Walkthrough Part 1","RT @giantbomb: South Park: The Stick of Truth Review http://t.co/9Mwlthhoml","RT @AngryJoeShow: South Park The Stick of Truth is the best Movie/Television Licensed Game since Goldeneye!","تقييمات  South Park: The Stick of Truth بدأت تطلع:\nGiantBomb 100\nIGN 90\nGameInformer 85\nPolygon 85\nJoystiq 70\nGameSpot 70\n#جيمرز #قيمرز","South Park: The Stick of Truth Review - Hilariously Offensive - The Koalition http://t.co/R89CpphU7N via @thekoalition","But Just A Little More Then 6 Hours And Ill Be Playing The South Park Video Game!!! ^.^","RT @IGN: Our review of South Park: The Stick of Truth is here! (For real this time) http://t.co/2Wizlm2pv5 || http://t.co/EMrjXELsUp","WE DOUBLE TEAM SOUTH PARK! (Dope! or Nope): http://t.co/nty25TL2kq via @SmoshGames #southparkstickoftruth","Apparently the reviews of the new South Park game are all the same and glaringly obvious.","Giantbombs Southpark review http://t.co/MkvL6OW7Ua","RT @AngryJoeShow: South Park The Stick of Truth is the best Movie/Television Licensed Game since Goldeneye!","South Park: The Stick of Truth anmeldelse http://t.co/4dVhdfamkO","RT @SouthPark: After 4 years of production, our epic new video game South Park: The Stick of Truth comes out TOMORROW! #StickOfTruth","RT @danielsahyounie: I want to get a cartman (South Park) tattoo on my ass.","RT @RAChampion: South Park: The Stick of Truth review: Respect its authori-tah - Ars Technica http://t.co/IOJ82HByZF #innovation","Lol south park is hilarious","South Park: the Stick of Truth - i voti http://t.co/PK2GOZqaG5","South Park almost done.. YAY..","The South Park game looks pretty good except for the South Park part","finally SOUTH PARK: STICK OF TRUTH on PC!","South Park: The Stick of Truth - Opening Cutscene: http://t.co/AmBjAXM2pz via @YouTube","Seriously thinking about getting the south park game","“South Park: The Stick of Truth (PS3)” Video Review by The Ranting Robots http://t.co/a0Sugcw7cM","South Park CHARLES MIKADO \u0026 REZA are Perverted they\\\u0027ve eaten tigers and little children http://t.co/NmOpTzO3BQ","“South Park: The Stick of Truth (PS3)” Video Review by The Ranting Robots http://t.co/a0Sugcw7cM http://t.co/4qznvuTxAM","RT @TheXboxHub: We\u0027ve already shown you our review, so now have a South Park The Stick of Truth launch trailer  http://t.co/h05Au2jAU1","RT @TheXboxHub: We\u0027ve already shown you our review, so now have a South Park The Stick of Truth launch trailer  http://t.co/h05Au2jAU1","Hopped into a South Park stream just to see a clip of them playing a certain song I love. Omg","RT @AngryJoeShow: I wanted to give yall a heads up since the review embargo has lifted on South Park The Stick of Truth - Go out and buy th…","Review – South Park: Stick of Truth http://t.co/IGoKzh82ol","RT @danielsahyounie: I want to get a cartman (South Park) tattoo on my ass.","RT @PeanutButterGmr: The South Park Game is blowing up my feed right now. I kinda want it actually... I\u0027m just not sure if I 60 dollars wan…","@SouthPark Thank you for an amazing game, FUCK GAMESTOP. 11 out of 10 for real south park fans #StickOfTruth #StickHappens #GOTY","So the South Park game reviews seem to say its good but buggy. Hmm.","I unlocked 3 Steam achievements in South Park: The Stick of Truth! http://t.co/Xehf3je0Cg","RT @idkSienz: SOUTH PARK http://t.co/ksMBXX2lOH","RT @SouthPark: “South Park: The Stick of Truth” REALLY does come out tomorrow. Seriously. Watch the first 13 minutes of the game - http://t…","RT @EddieRuckus: South Park: The Stick of Truth (PC): http://t.co/K7Hr4le0O2","South Park: The Stick of Truth Walkthrough - Beat Up Clyde Part 2 http://t.co/bTOooFfQpB","RT @TheGameJar: Howdy ho! We have a treat for you this morning - our #SouthPark: The Stick of Truth review!\nhttp://t.co/AlQ8cyga0E @Ubisoft…","RT @danielsahyounie: I want to get a cartman (South Park) tattoo on my ass.","Game Review: South Park’s mix of smut and smarts is in full force in The Stick Of Truth http://t.co/xJUSLIfjXI","RT @nytimesarts: South Park: The Stick of Truth, a Video Game, Arrives http://t.co/oFVm3rT2mb","RT @LootQuest: South Park: The Stick of Truth\n(PS3, Xbox 360)\n£34.99\nhttp://t.co/lV2IqK5nFM\nWin MGSV: GZ March 18 RT \u0026 Follow http://t.co/N…","HANDS-ON: South Park: The Stick of Truth http://t.co/3RG8RmRU7Z","SOUTH PARK http://t.co/ksMBXX2lOH","South Park: The Stick Of Truth review – have yourself a time - Metro: MetroSouth Park: The Stick Of Truth revi... http://t.co/cCf2RHrHt6","this south park game looks funny af http://t.co/f1XZXF5Ksh","If South Park wasn\u0027t pushing us further and further into depravity, then it wouldn\u0027t be South Park.","RT @danielsahyounie: I want to get a cartman (South Park) tattoo on my ass.","A Funny And Faithful Adaptation http://t.co/0o6zZ7A8pm","South Park: The Stick of Truth review: Come on down\nhttp://t.co/k27BBXwtXg","I liked a @YouTube video http://t.co/HEh68WKLQe ► WTF Is... - South Park: The Stick of Truth ? (strong language)","\"@IGN: Our review of South Park: The Stick of Truth is here! (For real this time) http://t.co/XxIjnBSdkV || http://t.co/zM9Pt3QVyW\"","Good read RT @JimSterling: My review for South Park: The Stick of Truth. http://t.co/ZXAeYiyK5i","Here\u0027s how to get South Park: The Stick of Truth for £30 on console/£23 on PC http://t.co/qre56gOVw7","RT @danielsahyounie: I want to get a cartman (South Park) tattoo on my ass.","South Park -MIKADO DEJA REZA \u0026 CHARLES THE # 1 FASCISTS ENDED THE WORLD EXPOSE THE WITCHES Flow @ RealDatill forthwith for The News \u0026 More","fuck i want to get stick of truth, it\u0027s like a 14 hour south park episode","So if I disappear for a while.... Don\u0027t blame me.. Blame the fact that there may be a south park game out 😂😂","RT @danielsahyounie: I want to get a cartman (South Park) tattoo on my ass.","thinking about renting South Park: Stick of Truth and powering through that through Twitch.tv in one or two sittings.","I liked a @YouTube video from @tharadbrad http://t.co/9icCaU57RN South Park Stick of Truth Gameplay Walkthrough Part 1 - Grand Wizard","Picked up \"South Park: The Stick of Truth\" for $45 \u0026 i don\u0027t even have my pc back together yet. \u0026 it\u0027s playable today.. 😩","Review: South Park: The Stick of Truth http://t.co/AcLjok3Tzt","RT @IGN: Our review of South Park: The Stick of Truth is here! (For real this time) http://t.co/2Wizlm2pv5 || http://t.co/EMrjXELsUp","South Park: The Stick of Truth review: Respect its authori-tah http://t.co/0IX673wRiT","The New Kid in Town - South Park: The Stick of Truth Walkthrough: \n\nThe New Kid in Town - South Park: The Stic... http://t.co/rrVLnQe16e","#fact There is a hidden alien in every episode of South Park!","RT @botherer: Here\u0027s my South Park review. I ended up having a good time with it. But \"ended up\" is a key phrase. http://t.co/6kmotN9pf1","RT @danielsahyounie: I want to get a cartman (South Park) tattoo on my ass.","RT @AngryJoeShow: I wanted to give yall a heads up since the review embargo has lifted on South Park The Stick of Truth - Go out and buy th…","South Park The Stick of Truth Walkthrough Part 1 - Let\u0027s Play - Thy Name is Douchebag: http://t.co/OUZkQ4A0kE via @YouTube","South Park #nw","RT @AngryJoeShow: Its safe to say as a South Park fan \u0026 a creative RPG fan, its worth it. Its the most disgusting game ive ever played. ...…","RT @AngryJoeShow: How long is South Park? 15-18 hrs w/ side quests. It was like playing an entire DVD Season \u0026 I still want more! http://t.…","Review – South Park: Stick of Truth http://t.co/ChcechsqAJ","RT @danielsahyounie: I want to get a cartman (South Park) tattoo on my ass.","South Park The Stick of Truth Walkthrough Part 6 - Ginger Down (Gameplay Commentary): http://t.co/wCwR3aj1Lt via @YouTube","South Park: The Stick of Truth review: Come on down  http://t.co/w3EG0FJAjH via @joystiq","South Park The Stick of Truth review round-up: All the verdicts in one place. Following a series of delays, So... http://t.co/mte2VZwlSO","RT @IGN: Our review of South Park: The Stick of Truth is here! (For real this time) http://t.co/2Wizlm2pv5 || http://t.co/EMrjXELsUp","RT @gamespot: Respect my authoritah! Watch these @SouthPark episodes before playing The #StickofTruth. http://t.co/mbF9A7XTJF http://t.co/o…","I liked a @YouTube video http://t.co/jHHGQS038t South Park: The Stick Of Truth - Our 10 Favourite References [PS3 Gameplay]","RT @G3ARnet: We Review: South Park: The Stick of Truth - http://t.co/eK9A7odq8V http://t.co/XFVwgJTG5W","South Park: The Stick of Truth Review #stickoftruth http://t.co/Ifi51jbxCT","Finally, Cartman Can Come Out to Play http://t.co/37dY9afkoz","First new series on my channel! South Park Stick of Truth! https://t.co/SDQjFR16XW","South Park: The Stick of Truth - Random Gameplay Montage: http://t.co/5nnj0gBEVb via @YouTube","Might have to get South Park:Stick of Truth this weekend","Are @maximilian_  and @DoomAssistMe  gonna play the new south park game?","RT @Whiteboy7thst: South Park: The Stick of Truth Gameplay Walkthrough Part 1: http://t.co/lWAKNEEfzv via @YouTube","RT @fiddlecub: Also, Stick of Truth confirmed my love of Butters as the best character on South Park.","RT \"@AngryJoeShow: South Park The Stick of Truth is the best Movie/Television Licensed Game since Goldeneye!\"","RT @danielsahyounie: I want to get a cartman (South Park) tattoo on my ass.","#Gamenews South Park: The Stick of Truth Walkthrough - Beat Up Clyde Part 2 http://t.co/0p61UiHSyV #Games","Game : South Park Stick of Truth-FTS http://t.co/TP61BLJx3X #torrent #download","I liked a @YouTube video from @tharadbrad http://t.co/lIv6sdJs7O South Park Stick of Truth Gameplay Walkthrough Part 1 - Grand Wizard","South Park -Rahul Gandhi \u0026 Justin Beaver DISINFORMERS are Barack Obama\\\u0027s pet LABRA-DOODLE. EXPOSE THE WITCHES! Follow @ RealDaTill","RT @AngryJoeShow: How long is South Park? 15-18 hrs w/ side quests. It was like playing an entire DVD Season \u0026 I still want more! http://t.…","i think everyone can agree that this new south park is better than the old shooter thing that was on playstation and n64","So South Park: TSOT is just plain awesome. All the smarts, all the funny \u0026 all the gross. Not sure \"pleasant surprise\" fits the bill though.","RT @danielsahyounie: I want to get a cartman (South Park) tattoo on my ass.","@GarnettLee Ohhhh, Garnett... it\u0027s been on Steam since 9pm. You\u0027ve lost 4 hours of valuable South Park time!","Hot Coffee Quest - South Park: The Stick of Truth - Gameplay [SPOILERS] http://t.co/LZalRyqOBX","RT @IGN_AU: \"Shut your f*\u0026^$ing face uncle f*\u0026^er\"! The Stick of Truth is here! All hail Trey  and Matt. http://t.co/K07f5y1OEG http://t.co…","RT @danielsahyounie: I want to get a cartman (South Park) tattoo on my ass.","XBA Review: South Park: The Stick of Truth http://t.co/JDbhw5OtK6","XBA Review: South Park: The Stick of Truth: Multiple delays and multiple publishers, surely it\u0027s destined to f... http://t.co/DtCiIMUP7o","Also seems like the South Park game is a usual Obsidian one: awesome but borked on release. Curious about the Paper Mario references though.","RT @danielsahyounie: I want to get a cartman (South Park) tattoo on my ass.","New Post: South Park: The Stick of Truth Review -  http://t.co/vOAJXbzPiL","South Park Stick of Truth \"Goth Group\" Lets Play Playthrough Gameplay Part 9: http://t.co/TrsdSmaxGk via @YouTube","South Park The Stick of Truth review round-up - http://t.co/a4xxvAs5br http://t.co/Ep4POre3VF #Technology","South Park: The Stick of Truth is a game that I liked. http://t.co/JzkyjsH2NK","South Park: The Stick of Truth (PS3) Review in Progress - http://t.co/yNh65l40LA http://t.co/X7eXxlsERh","RT @JimSterling: My review for South Park: The Stick of Truth. http://t.co/ugmn4wF5So","$ubi South Park: The Stick of Truth review round-up. Pretty good actually http://t.co/wtjUmXSgc8","@Ohmwrecker no way, you\u0027re playing it! :D awesome, I love south park :3 ♡","So of course I have to select the class of \"Jew\" in the South Park game..... May the adventures of T. Baggins be....something.","RT @Truth_CALI323: I really wanna buy South Park #TheStickOfTruth! Had all there games starting from 64! 🎮👾","It\u0027s out Friday! We can\u0027t wait to get our hands on this one for some South Park shennanigans! http://t.co/rQ4EojLPlF #TrailerTue #goveryeah","Have to say that was a pretty successful stream! Tomorrow we start \"day 2 in south park\"!","@JudgeRAW00 They are out now! You can check out a couple here \u003e\u003e http://t.co/EspeFWbd93 | http://t.co/GFd6BLO3sT.","RT @The4thGenGamer: I liked a @YouTube video from @justplaypokemon http://t.co/IiWjYEzcOn Let\u0027s Play South Park Stick of Truth at MIDNIGHT …","South Park: The Stick of Truth review: Come on down http://t.co/GK1IYEgwJp"],"id":81,"autoSummary":"South Park The Stick of Truth Walkthrough PART 11 - Saving Craig aka Feldspar the Thief: http://t.co/sQa4A8WIZY via @YouTube"}}