{"82":{"topic":"netflix","tweets":["Netflix Fitbit Hack Pauses Movies When Viewers Fall Asleep - Don\u0027t know if it\u0027s \"awesome\", \"creepy\", or both.  http://t.co/iawYJw8RPG","@_Omniscient_ truuuuue, but I\u0027m glad I actually know that there\u0027s something good to watch. I was losing hope on Netflix. Lol.","To bed since Netflix played me.","Only if someone would let me use there Netflix account right now 😏","RT @SaveTheBorgias: @domriccio Enjoy watching #TheBorgias on #Netflix want 2 see rest of the history vote 4 S4 http://t.co/1D8rcaDuSz http:…","damn the more that I think about it the more angry I get that South Park\u0027s off Netflix...good thing u can watch every episode online","Netflix just doesn\u0027t want to cooperate with me tonight.","Fuck you Netflix 😭😭 http://t.co/hBqU39UDcD","@Jessylumx haha chyess my house won\u0027t be so boring anymore too I gots wifi \u0026 that means netflix movies :) ugh wish I had video games tho lol","BGR\nFrightening new Netflix scam looks to steal all your private data\nhttp://t.co/BAJa3mCEBg","watching horror movies on netflix","I should sleep but Netflix is more important 😌","Ugh Netflix, you\u0027ve beaten me again. This time it was at the hands of The Office, which I\u0027ve seen every episode of at least 3 times.","Gonna watch a netflix movie or should i jus losten to music ......","Netflix for the day👍","The very first season of Pokemon is on Netflix......my life is complete @LD__Fatality @ItsTwitchyyyy","RT @endoyle1988: dog I\u0027m watching right fuckin now tho RT “@est_93wesguy: Praise Jah for Poke\u0027Mon on Netflix. I\u0027m set for a few months. Lif…","Like im now content staying in on a Friday night with netflix \u0026 takeout 🍱","RT @ComedyOnIy: Netflix gives you 15 seconds between episodes to decide whether or not you\u0027re doing anything with your life today.","Watching netflix wish I had someone to cuddle with 😕","RT @James_Yammouni: who wants to cuddle while its raining outside and drink hot chocolate while watching Netflix","New Netflix Phishing Scam Tricks You Into Calling Fake \"Tech Support\" http://t.co/BHNgZzcTFp","Time to get on this Netflix and see what i can find to watch while i snack on these Flammin Hot Fries. these fries killin Mcdonalds fries","Aww hell they put Tyler\u0027s Perry Temptation on Netflix. They got a sista\u0027s late night movie choice looking right👍","@kristen_naomi that\u0027s what happens when you ask for shows on Netflix. Lol everyone and they momma have Netflix.","hey @netflix you need to upgrade your streaming availability, VOD on my @dish has a better selection… why am I paying you?","Netflix has hit the jackpot my childhood is back Pokemon is on Netflixs","RT @TheNetflixLife: Netflix gives you 15 seconds between episodes to decide whether or not youre doing anything with your life today","I could have sworn I had plans to go to sleep. But then........Netflix.","Netflix do you hate me why wont you let me watch ouran. I just want to watch it. You freeze before I can click the show you hate me dont you","say an IP address over the phone like some robot dinosaur. what? next I will set the VCR to record off netflix","I can\u0027t tell if I just can\u0027t sleep because of my anxiety or if Netflix is the problem. basically I\u0027m just insane","Been watching a lot of The Munsters lately.. I used to watch it when I was little, and now I can watch it on Netflix! loll","RT @Anu_Calotis: @jasonnadams  dang I\u0027m on episode 16 but I\u0027m also watching this anime show called Attack On Titan on Netflix it\u0027s really i…","Netflix \u0026 food. 👌✌️","@Anu_Calotis OMG that\u0027s the best anime on netflix!!! Season 2 is comming up this summer!!😃","Netflix it is","ha ha netflix really seems to want me to watch merlin. not happening @rainie","unconditional is such a good movie 😭 I recommend it I loved it so much .. #netflix","Thanks Netflix for once","What. #netflix http://t.co/zWKDJuEYa3","So... Any suggestions for Netflix? Lol","everyone\u0027s all like wow pokemon on Netflix bitch i am on season 3 on YouTube 😮✌","RT @domriccio: The Borgias is on Netflix. The history nerd in me is screaming with happiness.","RT @WomensHumor: I do marathons (on Netflix).","@ImChrisSanchez_ dude hell yeah!!! I LOVE all of the Pokemon movies. I really hope they put them on Netflix.","Biographical Tortured-Genius Movies from the 1980s with 3 titles to watch. http://t.co/wxzPRNAaSx","@domriccio Enjoy watching #TheBorgias on #Netflix want 2 see rest of the history vote 4 S4 http://t.co/1D8rcaDuSz http://t.co/zpoqd4xYQs","@jasonnadams  dang I\u0027m on episode 16 but I\u0027m also watching this anime show called Attack On Titan on Netflix it\u0027s really interesting!","Why the hell am I still up watching Desperate Housewives on Netflix?","RT @KPins: Yes Pokemons on netflix #90skids","Netflix I don\u0027t pay you $8 a month to question if I\u0027m still watching after like 5 episodes of a show in a row...","Pokémon. On Netflix. If I don\u0027t tweet for x amount of days,  don\u0027t be surprised.","“@ThaRealRome_: Netflix is about to be killing the game with Pokemon now” whuuuuuu","I should be sleep. I have a busy day tomorrow. But nah I\u0027m up watching Netflix.","“@Gry_2timez: @asirammmm lol 😭😂” it\u0027s on Netflix, imma be up all night.","@brettouk The Good Wife is really good but if you got Netflix then house of cards for sure","RT @random_tangent: My @VerizonFiOS is running at a blazing fast .31 Mbit/sec. It\u0027s like they\u0027re pretending all my traffic is @netflix! \n\nT…","\"@ThiskidHIghLow: All Netflix needs to do now is add dragonball z and everything would be gravy\"","Why is my Netflix not working? 😭","Staying up all night to watch the whole season of Bates Motel on Netflix. Damn.","Watching Bates motel on netflix. First 20 min already shook me up. But juwan n shema say it\u0027s good so I\u0027m tryna see what the fuss is about.","This Insane Netflix \"Tech Support\" Scam Tricks You Into Giving Up Your Bank ... - http://t.co/RF1zpT1Hqy http://t.co/R5mF5GvxvM","#Apple Netflix - Netflix, Inc. http://t.co/fD1xPlAvCG - NetflixNetflix, Inc. Genre: EntertainmentRelease Date: April 1, 2010 Netflix is ...","@JackieMoFuckah yes! I couldn\u0027t believe it was on netflix.","I think I\u0027ve forgotten how to study.. Oh well, more time for netflix! #procrastination","Omg Pokemon is on Netflix now","I absolutely hate the feeling of when a show on Netflix is over. I am so sad. 90210 you will be rewatched. #thenewone #imissyoualready","This Insane Netflix \"Tech Support\" Scam Tricks You Into Giving Up Your Bank ... - http://t.co/POUo3hGWTX http://t.co/BlSQ7no4lM","RT @UberFacts: It\u0027s on Netflix now... If we stop tweeting, you know why. http://t.co/5h9l3XA1P3","Wait Pokemon really on Netflix???","I should have just watched @OITNB on Netflix and called it a night, but NOOOOOOOOOOO I risked it.","Star Wars Saga\u0027s Loose Ends Get Tied Up in Lost Episodes http://t.co/NCp8B8R7io","Cereal at night \u003e\u003e ft. Netflix \u0026 Young Kobe who is yawning lol http://t.co/hOfCCxj1gs","Lost Episodes Tie Up Star Wars Saga\u0027s Loose Ends The Clone Wars began in 2008 as a much-ma http://t.co/2qbiZ4dkol","RT @Daily_Dip: Am I the only one hype as hell Pokemon just came on Netflix? About to pack a Pikachew and reminisce on my childhood #GoodOle…","o dear mums canceled netflix","RT @yooooTEE: Netflix is some shit !!! but I still watch it tho 😒","Warning: Be Prepared to Avoid This Elaborate Netflix Scam http://t.co/NIsXkGgmng","RT @omarhuss: Dear @netflix ,\n\nCome save us. \n\nSincerely,\nMiddle east users.","RT @ProblemsAtUni: *writes assignment title* \n\n*rewards self with six hours of Netflix*","RT @KingTralle: @keturah__x yea I been watching on Netflix lately","Lost Episodes Tie Up Star Wars Saga\u0027s Loose Ends  http://t.co/AydYJaKPTq","Just got this #Houseofcards sticker. Check out my 251 other stickers on #tvtag http://t.co/0ejYHNCTTu #HouseofCards","Just got this #Houseofcards sticker. Check out my 251 other stickers on #tvtag http://t.co/esABuh0wAl #HouseofCards","Just got this #Houseofcards sticker. Check out my 251 other stickers on #tvtag http://t.co/eC9exSO9nl #HouseofCards","Just got this #Houseofcards sticker. Check out my 251 other stickers on #tvtag http://t.co/BCFjUfnDBq #HouseofCards","Just got this #Houseofcards sticker. Check out my 251 other stickers on #tvtag http://t.co/0yOJcMLjoV #HouseofCards","Just got this #Houseofcards sticker. Check out my 251 other stickers on #tvtag http://t.co/P1mVDJACsa #HouseofCards","Just got this #Houseofcards sticker. Check out my 251 other stickers on #tvtag http://t.co/TkC8fUSQhQ #HouseofCards","Just got this #Houseofcards sticker. Check out my 251 other stickers on #tvtag http://t.co/nPpGQCUKis #HouseofCards","Just got this #Houseofcards sticker. Check out my 251 other stickers on #tvtag http://t.co/P04yJQVfyg #HouseofCards","Lost Episodes Tie Up Star Wars Saga\u0027s Loose Ends http://t.co/wEFjN2vMw0","POKEMON IS ON NETFLIX!!!","I\u0027ve spent 6 hours of my life back to back watching Netflix. #bye","Lost Episodes Tie Up Star Wars Saga\u0027s Loose Ends http://t.co/NojbZP91IW #themesh #technology","Dish Network and Disney have reached a landmark deal that envisions the day when Dish will offer a Netflix-like... http://t.co/omv1va698j","It is amazing how fast The Comcast-Netflix interconnect agreement has improved my video quality on my Xbox One","Once I start watching Netflix I can\u0027t stop","Silence of the Lambs is on Netflix!!!!!! Fuck yeah! #TotesMcGotes","Why do I have a compulsion to binge watch Netflix, I should sleep","RT @jeremy_wilson23: Damn I\u0027m bored. What am I supposed to do without Netflix?","Luther on Netflix","@netflix when are you guys putting Dragon Ball Z on ur shit though","Too bad it\u0027s not on netflix 😂😂😂😂","@SeasonOfBytes @PBS #Sherlock is on my list on @Netflix, first ep. was great!","Damn I\u0027m bored. What am I supposed to do without Netflix?","RT @xoalyyy__: bouta chill \u0026 watch netflix","@AngBenPow I\u0027ve been watching Braves 2013 highlights haha, I think I\u0027m baseball deprived :/ \u0026 there\u0027s absolutely nothing on Netflix!","@keturah__x yea I been watching on Netflix lately","@BeatItLikeAPro_ about to watch it since it\u0027s on Netflix","Buying \"this is the end\" off Netflix may have been the clutchessed purchase","RT @Pokemon: Get ready, Trainers! #Pokemon is coming to Netflix this Saturday! RT if you\u0027re planning to watch! http://t.co/36fm8gZkMk","Late night snack and family guy on netflix. 👌🙌","RT @BeauWillimon: It\u0027s happening, folks. Binge-writing. One down, twelve to go. @HouseofCards @netflix http://t.co/cPE30aqQKp","RT @ThiskidHIghLow: All Netflix needs to do now is add dragonball z and everything would be gravy","“@duece_: Bout to turn on netflix \u0026 watch this Pokemon” bout to turn on my give a fucks","@bretthath36 netflix and video games man.","@DankDaisy lol hulu has a better line up, but Netflix has a few classics like initial D and trigun so Shii I switch back sometimes","Done! Crushed all five seasons of #SonsofAnarchy @Netflix in a week. And what a glorious gratuitously violent \u0026 vulgar week it was! #lovedit","RT @franalations23: 🙌 RT @Sn3ak3r_Fr3ak3r: Season 1 of #Pokemon on @netflix ?! W0TT ?! On my @franalations23 flow ✌️ http://t.co/zVnLnvSVhS","Netflix is about to be killing the game with Pokemon now","New Netflix Phishing Scam Tricks You Into Calling Fake \"Tech Support\" http://t.co/sPT3oLtX2f #Scamers","@itsbrandonbside @netflix @hulu I like Netflix never done hulu but this is def the most I\u0027ve ever watched it","RT @ThiskidHIghLow: All Netflix needs to do now is add dragonball z and everything would be gravy","RT @desusnice: If a Chick invites you over to watch netflix u better get the message dawg","they should just to DBZ on Netflix already","I AM SO TIRED BUT I HAVE SO MUCH TV TO WATCH AND ALSO TRYNA STUDY BEFORE BED MAN GIVE ME A PHD IN NETFLIX ALREADY I\u0027VE EARNED IT","Someone bless with a netflix so I can watch pokémon","Netflix til I crash","Already on Netflix","Pokemon on Netflix! #blessed http://t.co/Tr2EDVER3H","Security warning over fake tech support scam for Netflix and Gmail http://t.co/bu2nrBw7SQ @MailOnline","RT @keeeekss_: Thank you @netflix for the old Pokemon episodes 🙌 http://t.co/K0kdlyRRyz","If you\u0027ve been enjoying True Detective than I  recommend watching \"Kill List\" on Netflix IW. Imagine two hit men in similar situation.","RT @WomensHumor: I do marathons (on Netflix).","$F Options Check-Up: Ford Motor Company, Netflix, Inc., and JA Solar Holdings Co ...: \nOptions Check-Up: Ford ... http://t.co/pPYOoILaJ2","Late Night Netflix.","Damn near bouta go on netflix and watch Pokemon","RT @YahooTech: Beware of a New Breed of Scammers Pretending to Be Netflix Tech Support http://t.co/UwTOVzA5Wf","I\u0027m rewatching Pokémon since it\u0027s on Netflix now and all I can say is it\u0027s poorly dubbed and there are so many plot holes.","RT @KevANTESBERGER: If you have never watched the movie into the wild, you should probably watch it. It\u0027s on Netflix","Star Wars Saga\u0027s Loose Ends Get Tied Up in Lost Episodes http://t.co/2DJGL07NOP","Check out http://t.co/CjPXCrABim to get free #Netflix accounts! #Lifetime access! #NoSurvey!          8","@shawtyvegasbomb lol you still have stuff to watch on @netflix that\u0027s impressive...I usually scroll for 5 mins then turn on @hulu","That netflix date really isn\u0027t a bad idea — I know huh http://t.co/BgHUZN0ovg","RT @ThiskidHIghLow: All Netflix needs to do now is add dragonball z and everything would be gravy","Netflix Utilizing Amazon Cloud To Support Its Next-Gen AI For Recommendations http://t.co/yMEt1OiqAr","@skyedanielsxxx @netflix ok ill look that up next","RT @James_Yammouni: who wants to cuddle while its raining outside and drink hot chocolate while watching Netflix","4 1/2 hours later I finally gathered the will power to turn off Netflix","I forgot I heard pokemon is on netflix I feel like a born again Christian","RT @nrcruz0: Amen to Netflix🙌","4am netflix cuz fuk school man","bouta chill \u0026 watch netflix","One year after \"Enlightened\" was unjustly canceled, why Netflix should revive the beloved comedy http://t.co/m6u1gXz4k9","@MONTcler_ gimme ya netflix😳","RT @Andrew_Scholz: I blame social media and netflix for making me sleep until noon.","RT @JohnnyRandall25: Why would I sleep when I can let Netflix ruin my life","@ColdBloodNigga lmao. Sekirei, it\u0027s on Netflix. All the anime on there r horrible. But I like corny/girly anime","Netflix till I fall asleep","RT @ProblemsAtUni: *writes assignment title* \n\n*rewards self with six hours of Netflix*","Bout to turn on netflix \u0026 watch this Pokemon","@shawtyvegasbomb @netflix watch \"abduction of eden.\"","My second movie on netflix ..tf is life . #vampin #whatissleep","my hardest decision at night is pandora or netflix . lol","RT @James_Yammouni: who wants to cuddle while its raining outside and drink hot chocolate while watching Netflix","Netflix allll nighhhht long","Trying to decipher whether to listen to music or watch netflix","My mom\u0027s internet just gets worse \u0026 worse! If I\u0027m playing Netflix only one app can download at a time. \u0026 I cant load pictures! Damn it AT\u0026T!","Cerebral Scandinavian Documentaries with 3 titles to watch. http://t.co/EsAbghZDJF","RT @deemoneyLA: Now that The Wood is back on Netflix... I don\u0027t see how this household will go a week without watching... We\u0027ve seen it 3 t…","@KingWilly__ do they have the 1 one on netflix? or redbox?","Still on Netflix 😭 maybe that\u0027s why my head be hurting","I swear I watched almost every t.v series and movie of my interest on Netflix .. Lol I\u0027m too bored","Netflix users!!! Read up and protect yourself from fraud!! @CaptScottBarrow @Brainsy11 @JOEYTHANINJA @nbyrne6  http://t.co/oC64YqJBgt","@Wasanga_Mayhem ...(cont) u r already able to stream games via the Supersport website, so Netflix can integrate that into their system.","@SimeonMasonb  has reminded me that I can take my mind off of things with Netflix. Good times.","@jasonnadams  are you watching them all on Netflix too?!?","Seriously can\u0027t hack staying up late anymore. I\u0027m dying right now. Damn you Netflix","🙌 RT @Sn3ak3r_Fr3ak3r: Season 1 of #Pokemon on @netflix ?! W0TT ?! On my @franalations23 flow ✌️ http://t.co/zVnLnvSVhS","@OG_Channa do you have netflix?","Well like my childhood I watched 2 episodes of Pokemon before bed so glad they put it on netflix. Goodnight twitter!","RT @JC_hammer4: Pokemon is on Netflix now😳 #childhoodmemories","I love Markus because he has Marilyn Monroe\u0027s films in his list on Netflix that he lets me use.","Why cant frozen be on netflix","“@CommanderCastro: Thank you #Netflix for #Pokemon http://t.co/anoJEBCBsM” lemme borrow your netflix lol","All Netflix needs to do now is add dragonball z and everything would be gravy","Having Pokemon on Netflix is awesome. #pokemon #netflix","Netflix and wings","Now that The Wood is back on Netflix... I don\u0027t see how this household will go a week without watching... We\u0027ve seen it 3 times this week","Desperate housewives on netflix rn","@ian40james Ian get on house of cards on netflix mate, I was once in the same position, now I feel like a corrupt meth cooking political tit","RT @FinninMatt59: The Pokemon tv series is on netflix... There goes my life for the indefinite future #pokemaniac","I think I solved my problem with staying up late..go to sleep and wake up extra early so I can watch as much of Netflix until life calls.","Ugh damn it @netflix is taking over the night. Again. Fml #revenge","RT @NW_PIRATE: You best believe I\u0027m watching Pokemon on netflix","@netflix just finished watching all the pokemon eps. When is the rest of season 1 and more of the series going to be put on Netflix?","I\u0027m gonna just drown in Netflix","Just got this #Lilyhammer sticker. Check out my 250 other stickers on #tvtag http://t.co/B7M5fiKXnM #Lilyhammer"],"id":82,"autoSummary":"Netflix I don\u0027t pay you $8 a month to question if I\u0027m still watching after like 5 episodes of a show in a row..."}}