{"86":{"topic":"lent","tweets":["Giving up twitter for lent ((6 wks)) bye feliciaaaa 😭","Well im giving up soda for lent... #thisisgonnasuck #withdrawal #ineedhelp","For lent I\u0027m giving up masturbating","Lent is anything but gloomy. Instead, it’s a time for love and a journey to the fulfilment of hope. — feeling blessed","LENT BEGINS RIGHT NOW NO MEAT BITCHES","RT @kaelymichelle: Giving up school for lent.","Now hiring for new snapchat best friend. @stasiafacee is giving it up for lent.... #lifeisbasicallyover","I tried to give up my gf for lent 😂","RT @PaigeLaurane: I DON\u0027T KNOW WHAT TO GIVE UP FOR LENT #CATHOLICPROBS","RT @Wesley25All3n: Can I give up school for lent and still pass with all A\u0027s","And that\u0027s a wrap. Happy Lent, kiddos!  See you after Easter! #herewego","Only hours away from #ashwednesday \u0026 it haven\u0027t figured out what to give up for #lent. #catholicproblems","RT @ExclsvEdgar: @Eladrian_ give me up for lent","First day of lent! #ashwednesday","RT @juanalv101: I was going to give up drinking for lent but realized that it was going to be too hard so I\u0027m gonna give up going to school…","RT @MaximousG: I\u0027m giving up talking to Allgood for Lent.","RT @TylerGang21: Ash weds tomorrow lent starts wat y\u0027all giving up huh","RT @briiannemorgan: can I give up emotion and feelings for lent?","No final thoughts. It\u0027s lent. Caring emptiness is rife.","@Icky_RICKYY I heard you\u0027re giving up dick for lent.","RT @babyy_l: For lent im giving up soda and chips.","RT @JordonTurcsak: @SpencerHereford ok 100 retweets and I\u0027ll stop smoking weed for Lent...has to have 100 by 12 tomorrow haha","RT @dhauptman5: Giving up school for lent","PS22 Chorus \"In The Embers\" -- perhaps unintentional, but this is so sweet and perfect for ash wed #lent  http://t.co/yAxH6OPYiF","RT @destinyareee: Giving up fast food for Lent ...this is guna be really hard lol 😔 .","Called Archdiocese of Bombay, the app is really helpful, set to help people this Lent be pious, so great timing too http://t.co/iNm4YQIado","Dominican Jesus…. “@Jew_Chainz: holy shit RT @cstew13 Jews. . RT @Jew_Chainz: what\u0027s everyone who participates in Lent giving up?”","And Lent begins!","I\u0027m thinking about giving up social media for lent 😳","RT @HayLow8: “@mustywaffle: I\u0027m giving up being ugly for lent”😂","RT @SomethingGolden: I\u0027m giving up school for lent","RT @DominicScott: giving up my innocence for lent","I got Caffeine! What Should You Give Up For Lent? http://t.co/TMQcosA9XN via @sbstryker","RT @phantomkennace: For Lent this year, I\u0027m giving up.","RT @h8myparents: For lent I am giving up my feelings","Lent starts now right ?","From Dust we came \u0026 unto dust we return #Lent #Catholic http://t.co/mzMnYJJ5DE","What will I give up for lent?... Brussel sprouts :)","Hmm... What give up for lent... #decisionsdecisions #notevencatholic","for lent you should give up your morals oh wait","For lent I give up giving shit up","Adult website ratings significantly drop when Lent starts.","RT @JordonTurcsak: @SpencerHereford ok 100 retweets and I\u0027ll stop smoking weed for Lent...has to have 100 by 12 tomorrow haha","Start of Lent today! Have a blessed day all ♡","Lent starts at midnight, so I must bid you farewell 👋","giving up living for lent","RT @_briannna27: I\u0027m giving up school for Lent. 👌 lol #bye #jkIwish","I think I might give up social media for lent...","Giving up \"yo barber\" jokes for lent...","Lent. Giving up that one bad habit that everyone hates. This one goes out to all of my homies out there. #forthehouse","No RT @Po3TiC_1: Is “Lent” real enough to the point y’all really have to give shit up for it?","and so it begins… #lent","RT @shegotagronk: Giving up hoodrats for lent.","First day of lent☝️","@kortney_meat your suppose to give up something important for lent...","I\u0027m going to give up gossiping for Lent. It\u0027s been a while since I\u0027ve actually done anything but I feel like this activity is too consuming.","Giving up chocolate for lent. I give it 12 hours.","Giving up social media for lent. I\u0027ll either be dead in a week or a doctor by the end of the semester because of it.","RT @gimza_nathan: Can I give up school for lent?","The Three pillars of lent.\n1. Prayer.\n2. Fasting.\n3. Almsgiving.","im gonna give up school for lent","I\u0027m giving up sociopaths for lent. Wish me luck.","I dont know what to give up for lent 😞","no fast food \u0026 soda for lent 🙌","@foreveral0ne120 this is what happens when you work Sunday mornings \u0026 don\u0027t go to church in 2months. You forget about lent. D:","See you in six weeks twitter #lent","I got Nothing! What Should You Give Up For Lent? http://t.co/fDrDmSBCm5 via @sbstryker","40 days of Lent begin today ASH WEDNESDAY http://t.co/cCS4JFFJ3C http://t.co/SlEQrgBsOT #trinidad #tobago","I\u0027m giving up being childish for Lent.","Im not giving up anything for lent. I will try to come closer to God by reading the bible everyday. At least a verse \u0026 apply it to my life.","No desserts for Lent, starting now","RT @RileyMetz: Giving up college for Lent. yolo","Remember it\u0027s not all about WHAT you\u0027re giving up for #Lent. It\u0027s WHO you are growing in relationship with. Each day grow #Closer2Christ","See y\u0027all in 40 days #Lent http://t.co/t18YcaX8kl","RT @mufasa16_: People are complaining about lent and I\u0027m here like #tryramadan http://t.co/RTu8BUQA3s","Lent tomorrow\u003d no more fast food and no more soda...","I legit can\u0027t think of a single decent thing to give up for lent.","@lefaunce @melschreibs I\u0027m being nice for Lent #God","I give up school for lent ayy","And so lent begins","RT @michaelahoov: How about I give up cold weather for lent this year","RT @FrassMarley: Lmaooo RT @karyewest Lent RT @Neemzy: What Y\u0027all Giving Up For Lent?","RT @catholicteens48: Be careful not to make Lent about a second New Years resolution. It\u0027s a little different... 😊","I\u0027m giving up lent for lent.","RT @scottagunn: Listening to alleluias. After tonight, it\u0027s my Lent playlist until after the Great Vigil.","RT @eseJassiel: I want to give up homework for lent","Might as well be sober for lent","RT @LILJUICYJEREMY: Giving up ass eating for lent","Lent starts now. Let the games begin","#Lent has officially begun... http://t.co/1ZAJzQHwXk","RT @SpencerHereford: Retweet this.... me and @JordonTurcsak deal #lent #retweet #100 http://t.co/FIjZIH3P0Z","Maybe I should give up you for lent LMAO","RT @emlarrabee: Okay actually gonna not swear for lent...","I thought I was ready for lent....but I\u0027m not....dear Jesus keep me strong","Can\u0027t wait to see how this Lent thing goes","RT @keemypit: Anyways no alcohol for lent 😇","RT @DangerBrad: Giving up going to class for lent. I should be excused for religious purposes.","I\u0027ll give up candy for Lent","giving up peanut butter 4 lent #PBbitchnomore","any Catholics out there giving something up for lent?","RT @Bijankam99: @CarlyRinehart should give up slapping me for lent","do you know why you celebrate lent? If not, this is why http://t.co/y1lXDtDxXG","The final peppermint patty before lent is the best #butimjewish","Lent My Way. No Fried Foods http://t.co/X3nvsdKnNQ","All these people giving up social media for lent and I promise 40 days from now I still won\u0027t realize haha","Goodbye Social Networks. Facebook, Instagram and Twitter. #Lent","@Street_Fighter5 @drewwhisenant and I givin it up 4 Lent!! Tom couldn\u0027t join so the almst empty one I drank for him! http://t.co/RQ657v9T2m","For lent, so far, I\u0027m giving up junk food \u0026 cussing. And FYI \"hell\" isn\u0027t a cuss word. 😌","Giving up Twitter for Lent. See you on Easter.","@suezelle @scroll_in Lol yess!! Wish you a holy and blessed lent :)","cant decide what i should give up for lent 😁","happy lent","RT @joellemartino: giving up twitter for lent might be my best/worst decision ever. sooooo ya goodbye :)","Tomorrow is lent and I\u0027ve decided to give up .... Nothing because I\u0027m not catholic","Don\u0027t forget, it\u0027s Ash Wednesday today http://t.co/SRTViR2QfL","Amen, by brothers and sisters.  I am off FB and Twitter through Lent.  See you Holy Thursday.  :-)","RT @Love_Dreya: Chu said I have to give up something for lent. Lol.","RT @chase_short: And no more pop for lent starts now. This is going to be tough.","What are you giving up for Lent?","RT @natalie_walrath: girls confuse \"lent\" with \"diet\" but like pls jesus didn\u0027t die for ur thigh gap","Tomorrow is the start of lent.... I\u0027m willing to give up....Morals...","I\u0027m giving up meat for Lent \u0026 I already know I\u0027m going to miss chicken tenders the most. :\u0027(","RT @presdinosaur115: After much inner conflict, I\u0027ve decided to give up chemistry for lent.","RT @_makenzierose_: Can I give up school for lent?","What i would give up for Lent is 40 days of school ##FallonTonight #ihearya","RT @ericcabral2: Giving up sass for lent","\"@PostGradRants: This year for Lent I\u0027m just giving up.\" @ashleylhodnett","RT @Kailynn_33: Lent is gonna be so hard this year 😣","Take your pick 💒🙏 #Lent http://t.co/aUTZ8q4deo","gonna give up 8\u003d\u003d\u003d✊\u003d\u003d\u003dD for lent","Twitter, it\u0027s been real. See you in 40! #Lent","Lent has begun🙌🙏....no meat for you catholics today","Okay, so it starts. One of the things I\u0027m giving up for Lent is cussing. This is gonna be a tough one. #pottymouth","Lent My Way. No Fried Foods http://t.co/aUAliMbYU8","But lent does mean 3 dollar filet of fish meals 🐟 #healthy","We\u0027ll see you in after lent twitter. #givingupallnegativethings","Giving up something for lent doesn\u0027t make you a good Christian","The fact that lent is starting right now😭","RT @wtfelias: i\u0027m giving up being a thot for lent","Lent begins pray, fast and help the less fortunate never give up","Is \"Lent\" real enough to the point y\u0027all really have to give shit up for it?","RT @ChinchKhach: Giving up snacking and soda for lent. Solid.","RT @MachynPotts: It\u0027s offical, giving up school for lent.","HAPPY LENT TWITTER! See ya in 40 days #lent ✌️","See you on the flip side (after #Lent) if you need me, call/text. Peace out homiesss ✌️","I\u0027m gonna give up alcohol for Lent.","Last year I have up soda for lent, and I haven\u0027t had a soda since. 😌","U got one to give Up? Ooooook RT @Yattabing: “@ChristianDAmbz: Giving up my phone for lent” car for me..","I am giving up bread for lent","“@mustywaffle: I\u0027m giving up being ugly for lent”😂","It\u0027s midnight and I decided on a whim that I\u0027d give up ice cream for Lent. I solemnly swear to hand in… http://t.co/bALuwIAfPh","For lent I\u0027m giving up fast food and straightening my hair😅","1 min until Fat Tuesday ends: Chloe is taking a quiz on what to give up for lent","Thinking of something to give up for lent ...","Lent My Way. No Fried Foods http://t.co/kna02Nvioa","Unless I\u0027m doing a bday s/o or something......I\u0027m ghost till lent is over. Working on me. ALWAYS… http://t.co/9IeQJWY05i","Photo: its the first day of Lent… © planetBAM. 2014. http://t.co/fXLPb38AhF","RT @deeewadee: Giving up the vending machines for Lent","Anyone who says their giving up social media for lent...uhh yeeeeahh sure you are","omg it\u0027s 12 am and idk what I\u0027m giving up for lent","RT @deeenadash: Giving up school for lent. ✌️","RT @matjns: For lent I\u0027m giving up","Cant believe im giving up Root Beer for Lent. If im cranky we all know why","RT @ShitDuBKidsSay: \"I\u0027m giving up social media for lent\"","Giving chipotle up for lent 😩😭","I\u0027m giving up writing this essay for lent.  I mean yeah it works right?","See y\u0027all in 40 days and nights. #Lent","I suppose I should decide on what I\u0027m giving up for lent.. #whoops","What if I gave up dip for lent","Should I give up @TacoBell for lent?","Gone for Lent 🙏🙏🙏 http://t.co/5Go73xQ8vJ","Giving up ice cream and chocolate for lent. (Minus chocolate milk and dark chocolate squares).","Ash Wednesday, Lent is here!","Lent My Way. No Fried Foods http://t.co/ESNYUpbgbb","Ill give up rum for lent #whiskeytime","@UkirkMemphis @ecowen1991 giving up feeling less than this lent #ukirk","Idk What I\u0027m Giving Up for Lent.","RT @t_borondy: Lent isn\u0027t about telling people that you\u0027re doing it. You do it for your relationship with God.","RT @Dmagg97: Stafford County gave up school for Lent.","I would totally give up cursing and drinking for lent, but I know I would fail at both within hours 🙎","Can\u0027t wait to try all the seafood recipes I\u0027ve compiled for lent this year.","So is everybody disappearing this month for Lent?","Lent start today ??","For Lent I\u0027m giving up mine and Camy\u0027s friendship","Not straightening my hair until Easter! The season of Lent is upon us!","Fish hate this time of year. #lent #40days40nights","RT @joycallejo: \"@_camialopez: Giving up school for lent\"","Welcome to Lent, EST.","I guess I\u0027m giving up crystal meth for lent according to @_GEORGE_MEYER_","I\u0027ve always thought using social media during Lent is a great idea. But here\u0027s why I\u0027m fasting from it this year: http://t.co/z2GTcJs86Z","RT @CharmOfTheSouth: Can I give up giving a shit for lent?","Lmfaooo ode RT “@RacistJuan: Dominican woman love using Lent as a \"diet\" program.”","RT @erinxmartin: can I give up feelings for Lent or no","“@callmejanette: What am I gunna give up for lent?” 🍁","Oh how much I don\u0027t give a damn that lent begins today....","So lent starts tomorrow and I don\u0027t know what I\u0027m giving up!!!","What are you giving up for Lent? #AshWednesday","You\u0027re a bad catholic if you don\u0027t give up jaggin off for lent","trying to figure out what to give up for lent with jenny and tat....this is harder than we expected.....","RT @_double_decker: Prayers go out to @ReeannMcCarty as she embarks on her brave twitterless journey this lent.."],"id":86,"autoSummary":"RT @carezoneil: so i can give up school for lent right"}}